#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. в функции ВводНаОсновании.СоздатьКоллекциюКомандСоздатьНаОсновании
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт



КонецПроцедуры

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт

	 
	Если ПравоДоступа("Добавление", Метаданные.Документы.ПереоценкаВалютныхСредств) Тогда
		КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Идентификатор = Метаданные.Документы.ПереоценкаВалютныхСредств.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ВводНаОсновании.ПредставлениеОбъекта(Метаданные.Документы.ПереоценкаВалютныхСредств);
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьНесколькоВалют";
	

		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов) Экспорт

	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);

КонецПроцедуры


// Выполняет переоценку всего чего возможно в оперативном учете.
//	Переоцениваются:
//	- Остатки денежных средств
//	- Взаиморасчеты с клиентами
//	- Взаиморасчеты с поставщиками
//	- Остатки по кредитам, депозитам, займам
//
// Параметры:
//	Период - Дата - любая дата месяца за который неоходимо провести переоценку
//	Организация - СправочникСсылка.Организации, Массив, Неопределено - Организация (список организаций) по которой необходимо выполнить переоценку.
//                Если не задан, то для всех.
//
Процедура ВыполнитьПереоценку(Период, Организация = Неопределено, Операция = Неопределено) Экспорт
	
	ХозОперации = Перечисления.ХозяйственныеОперации;
	ПровестиДокументПереоценки(Организация, Период, ХозОперации.ПереоценкаДенежныхСредств);
	ПровестиДокументПереоценки(Организация, Период, ХозОперации.ПереоценкаРасчетовСКлиентами);
	ПровестиДокументПереоценки(Организация, Период, ХозОперации.ПереоценкаРасчетовСПоставщиками);
	ПровестиДокументПереоценки(Организация, Период, ХозОперации.ПереоценкаКредитовИДепозитов);
	
КонецПроцедуры

// Выполняет переоценку остатков денежных средств.
//
// Параметры:
//	Организация - СправочникСсылка.Организации, Массив, Неопределено - Организация (список организаций) по которой необходимо выполнить переоценку.
//                Если не задан, то для всех.
//	Период - Дата - любая дата месяца за который неоходимо провести переоценку
//
Процедура ПереоценитьДенежныеСредства(Организация, Период) Экспорт
	
	ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств);
	
КонецПроцедуры

// Выполняет переоценку остатков наличных денежных средств в заданных кассах организации.
//
// Параметры:
//	Организация - СправочникСсылка.Организации, Массив, Неопределено - Организация (список организаций) по которой необходимо выполнить переоценку.
//                Если не задан, то для всех.
//	АналитикаРасчета - СправочникСсылка.Кассы, Массив, Неопределено - Касса (список касс) по которой необходимо выполнить переоценку.
//	                   Если не задана, то для всех.
//	Период - Дата - любая дата месяца за который неоходимо провести переоценку
//
Процедура ПереоценитьКассыОрганизации(Организация, Период, АналитикаРасчета = Неопределено) Экспорт
	
	ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств, АналитикаРасчета, Истина);
	
КонецПроцедуры

// Выполняет переоценку взаиморасчетов с клиентами.
//
// Параметры:
//	Организация - СправочникСсылка.Организации, Массив, Неопределено - Организация (список организаций) по которой необходимо выполнить переоценку.
//                Если не задан, то для всех.
//	АналитикаРасчета - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам, Массив, Неопределено - АналитикаУчетаПоПартнерам (список аналитик) 
//	                   по которой необходимо выполнить переоценку. Если не задана, то для всех.
//	Период - Дата - любая дата месяца за который неоходимо провести переоценку
//
Процедура ПереоценитьРасчетыСКлиентами(Организация, Период, АналитикаРасчета = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами, АналитикаРасчета);
		
	Иначе
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Организация
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	НЕ Организации.ПометкаУдаления
		|	И (Организации.Ссылка <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
		|		ИЛИ &УчитыватьУпрОрганизацию)");
		Запрос.УстановитьПараметр("УчитыватьУпрОрганизацию", ПолучитьФункциональнуюОпцию("ИспользоватьУправленческуюОрганизацию"));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами, АналитикаРасчета);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет переоценку взаиморасчетов с поставщиками.
//
// Параметры:
//	Организация - СправочникСсылка.Организации, Массив, Неопределено - Организация (список организаций) по которой необходимо выполнить переоценку.
//                Если не задан, то для всех.
//	АналитикаРасчета - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам, Массив, Неопределено - АналитикаУчетаПоПартнерам (список аналитик) 
//	                   по которой необходимо выполнить переоценку. Если не задана, то для всех.
//	Период - Дата - любая дата месяца за который неоходимо провести переоценку
//
Процедура ПереоценитьРасчетыСПоставщиками(Организация, Период, АналитикаРасчета = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками, АналитикаРасчета);
		
	Иначе
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Организация
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	НЕ Организации.ПометкаУдаления
		|	И (Организации.Ссылка <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
		|		ИЛИ &УчитыватьУпрОрганизацию)");
		Запрос.УстановитьПараметр("УчитыватьУпрОрганизацию", ПолучитьФункциональнуюОпцию("ИспользоватьУправленческуюОрганизацию"));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками, АналитикаРасчета);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет переоценку кредитов, депозитов, займов.
//
// Параметры:
//	Организация - СправочникСсылка.Организации, Массив, Неопределено - Организация (список организаций) по которой необходимо выполнить переоценку.
//                Если не задан, то для всех.
//	Период - Дата - любая дата месяца за который неоходимо провести переоценку
//
Процедура ПереоценитьКредитыДепозитыЗаймы(Организация, Период) Экспорт
	
	ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаКредитовИДепозитов);
	
КонецПроцедуры

//++ НЕ УТ
#Область ПроведениеПоРеглУчетуУКР
// Возвращает текст запроса для отражения документа в регламентированном учете.
//
// Возвращаемое значение:
//	Строка - Текст запроса
//
Функция ТекстОтраженияВРеглУчетеУКР() Экспорт

#Область ПрочиеРасходы_БезналичныеДС // (Дт 9X :: Кт 31)
	ТекстПрочиеРасходыБезналичныеДС = "
	|ВЫБРАТЬ // Прочие расходы (Дт 9X :: Кт 31)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ВЫБОР КОГДА (Строки.БанковскийСчет.НеоперационнаяДеятельность) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ВЫБОР КОГДА (Строки.БанковскийСчет.НеоперационнаяДеятельность) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоДт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	Строки.БанковскийСчет.ВалютаДенежныхСредств КАК ВалютаКт,
	|	Строки.БанковскийСчет.Подразделение КАК ПодразделениеКт,
	|	Строки.БанковскийСчет.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	Строки.БанковскийСчет.СчетУчета КАК СчетКт,
	|	Строки.БанковскийСчет КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие расходы от переоценки безналичных ДС"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ДенежныеСредстваБезналичные КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|ГДЕ
	|	Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти

#Область ПрочиеРасходы_НаличныеДС // (Дт 9X :: Кт 30)
	ТекстПрочиеРасходыНаличныеДС = "
	|ВЫБРАТЬ // Прочие расходы (Дт 9X :: Кт 30)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КАК АналитикаУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КАК СубконтоДт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	Строки.Касса.ВалютаДенежныхСредств КАК ВалютаКт,
	|	Строки.Касса.Подразделение КАК ПодразделениеКт,
	|	Строки.Касса.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	Строки.Касса.СчетУчета КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие расходы от переоценки наличных ДС"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ДенежныеСредстваНаличные КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|ГДЕ
	|	Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти

#Область ПрочиеРасходы_Подотчетники // (Дт 9X :: Кт 3722)
	ТекстПрочиеРасходыПодотчетники = "
	|ВЫБРАТЬ // Прочие расходы (Дт 9X :: Кт 3722)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КАК АналитикаУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КАК СубконтоДт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	Строки.Валюта КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВИностраннойВалюте) КАК СчетКт,	
	|	Строки.ПодотчетноеЛицо КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие расходы от переоценки ДС у подотчетников"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|ГДЕ
	|	Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти

#Область ПрочиеРасходы_ДенежныеДокументы // (Дт 9X :: Кт 332)
	ТекстПрочиеРасходыДенежныеДокументы = "
	|ВЫБРАТЬ // Прочие расходы (Дт 9X :: Кт 332)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КАК АналитикаУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КАК СубконтоДт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	Строки.ДенежныйДокумент.Валюта КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеДокументыВИностраннойВалюте) КАК СчетКт,
	|	Строки.ДенежныйДокумент КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие расходы от переоценки денежных документов"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ДенежныеДокументы КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|ГДЕ
	|	Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти

#Область ПрочиеРасходы_ДенежныеСредстваВПути // (Дт 9X :: Кт 33)
	ТекстПрочиеРасходыДенежныеСредстваВПути = "
	|ВЫБРАТЬ // Прочие расходы (Дт 9X :: Кт 33)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КАК АналитикаУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КАК СубконтоДт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	Строки.Валюта КАК ВалютаКт,
	|	Строки.Получатель.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ВЫБОР
	|		КОГДА Строки.ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПриобретениеВалюты)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПриобретениеИностраннойВалюты)
	|		КОГДА Строки.ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.РеализацияВалюты)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РеализацияИностраннойВалюты)
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВПутиВИностраннойВалюте)	
	|	КОНЕЦ КАК СчетКт,
	|
	|	ВЫБОР
	|		КОГДА Строки.ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПриобретениеВалюты)
	|			ИЛИ Строки.ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.РеализацияВалюты)
	|			ТОГДА Строки.Контрагент
	|		ИНАЧЕ
	|			Строки.СтатьяДвиженияДенежныхСредств
	|	КОНЕЦ КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие расходы от переоценки ДС в пути"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ДенежныеСредстваВПути КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|ГДЕ
	|	Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти
// Кредиты, депозиты, займы
#Область ПрочиеРасходы_КредитыИЗаймы_ОсновнойДолг // (Дт 9X :: Кт 50, 60, 61)
	ТекстПрочиеРасходыКредитыИЗаймыДолг = "
	|ВЫБРАТЬ // Прочие расходы (Дт 9X :: Кт 50, 60, 61)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоДт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ДанныеДоговора.ВалютаВзаиморасчетов КАК ВалютаКт,
	|	ДанныеДоговора.Подразделение КАК ПодразделениеКт,
	|	ДанныеДоговора.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ВЫБОР КОГДА ДанныеДоговора.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета ТОГДА
	// Кредиты, займы в валюте регл. учета
	|		ВЫБОР
			// краткосрочный
	|			КОГДА ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.Краткосрочный)
	|				ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеКредитыБанковВНациональнойВалюте)
			// долгосрочный
	|			КОГДА  ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.Долгосрочный)
	|				ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеКредитыБанковВНациональнойВалюте)
			// долгосрочный истекающий 
	|			КОГДА  ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.ДолгосрочныйИстекающий)		
	|				ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТекущаяЗадолженностьПоДолгосрочнымОбязательствамВНациональнойВалюте)
	|		КОНЕЦ
	|	ИНАЧЕ 
	// Кредиты, займы в иностранной валюте
	|		ВЫБОР
			// краткосрочный
	|			КОГДА ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.Краткосрочный)
	|				ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеКредитыБанковВИностраннойВалюте)
			// Кредит, долгосрочный
	|			КОГДА ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.Долгосрочный)
	|				ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеКредитыБанковВИностраннойВалюте)
			// долгосрочный истекающий 
	|			КОГДА  ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.ДолгосрочныйИстекающий)
	|				ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТекущаяЗадолженностьПоДолгосрочнымОбязательствамВИностраннойВалюте)
	|		КОНЕЦ
	|	КОНЕЦ КАК СчетКт,
	|
	|	ДанныеДоговора.Контрагент КАК СубконтоКт1,
	|	ДанныеДоговора.Ссылка КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие расходы от переоценки кредитов, займов полученных"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.ДоговорыКредитовИДепозитов КАК ДанныеДоговора
	|	ПО
	|		ДанныеДоговора.Ссылка = Строки.Договор
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Константы КАК Константы
	|	ПО 
	|		Истина
	|ГДЕ
	|	ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.КредитИлиЗайм)
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Строки.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти

#Область ПрочиеРасходы_КредитыИЗаймы_Проценты // (Дт 9X :: Кт 50, 60, 61)
	ТекстПрочиеРасходыКредитыИЗаймыПроценты = "
	|ВЫБРАТЬ // Прочие расходы (Дт 9X :: Кт 50, 60, 61)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоДт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ДанныеДоговора.ВалютаВзаиморасчетов КАК ВалютаКт,
	|	ДанныеДоговора.Подразделение КАК ПодразделениеКт,
	|	ДанныеДоговора.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ВЫБОР КОГДА ДанныеДоговора.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета ТОГДА
	// Кредиты, займы в валюте регл. учета
	|		ВЫБОР
			// краткосрочный
	|			КОГДА ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.Краткосрочный)
	|				ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеКредитыБанковВНациональнойВалюте)
			// долгосрочный
	|			КОГДА  ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.Долгосрочный)
	|				ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеКредитыБанковВНациональнойВалюте)
			// долгосрочный истекающий
	|			КОГДА  ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.ДолгосрочныйИстекающий)		
	|				ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТекущаяЗадолженностьПоДолгосрочнымОбязательствамВНациональнойВалюте)
	|		КОНЕЦ
	|	ИНАЧЕ 
	// Кредиты, займы в иностранной валюте
	|		ВЫБОР
			// краткосрочный
	|			КОГДА ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.Краткосрочный)
	|				ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеКредитыБанковВИностраннойВалюте)
			// Кредит, долгосрочный
	|			КОГДА ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.Долгосрочный)
	|				ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеКредитыБанковВИностраннойВалюте)
			// долгосрочный истекающий
	|			КОГДА  ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.ДолгосрочныйИстекающий)
	|				ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТекущаяЗадолженностьПоДолгосрочнымОбязательствамВИностраннойВалюте)
	|		КОНЕЦ
	|	КОНЕЦ КАК СчетКт,
	|
	|	ДанныеДоговора.Контрагент КАК СубконтоКт1,
	|	ДанныеДоговора.Ссылка КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие расходы от переоценки процентов по кредитам, займам полученным"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.ДоговорыКредитовИДепозитов КАК ДанныеДоговора
	|	ПО
	|		ДанныеДоговора.Ссылка = Строки.Договор
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Константы КАК Константы
	|	ПО 
	|		Истина
	|ГДЕ
	|	ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.КредитИлиЗайм)
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Строки.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти

#Область ПрочиеРасходы_КредитыИЗаймы_Комиссия // (Дт 9X :: Кт 36)
	ТекстПрочиеРасходыКредитыИЗаймыКомиссия = "
	|ВЫБРАТЬ // Прочие расходы (Дт 9X :: Кт 36)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоДт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами) КАК ВидСчетаКт,
	|	ДанныеДоговора.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ДанныеДоговора.ВалютаВзаиморасчетов КАК ВалютаКт,
	|	ДанныеДоговора.Подразделение КАК ПодразделениеКт,
	|	ДанныеДоговора.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ДанныеДоговора.Контрагент КАК СубконтоКт1,
	|	ДанныеДоговора.Ссылка КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие расходы от переоценки комиссии по кредитам, займам полученным"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.ДоговорыКредитовИДепозитов КАК ДанныеДоговора
	|	ПО
	|		ДанныеДоговора.Ссылка = Строки.Договор
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Константы КАК Константы
	|	ПО 
	|		Истина
	|ГДЕ
	|	ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.КредитИлиЗайм)
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Строки.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Комиссия)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти

#Область ПрочиеРасходы_Депозиты // (Дт 9X :: Кт 313, 314)
	ТекстПрочиеРасходыДепозиты = "
	|ВЫБРАТЬ // Прочие расходы (Дт 9X :: Кт 313, 314)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоДт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ДанныеДоговора.ВалютаВзаиморасчетов КАК ВалютаКт,
	|	ДанныеДоговора.Подразделение КАК ПодразделениеКт,
	|	ДанныеДоговора.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ВЫБОР
	|		КОГДА ДанныеДоговора.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеСчетаВБанкеВНациональнойВалюте)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеСчетаВБанкеВИностраннойВалюте)
	|	КОНЕЦ КАК СчетКт,
	|
	|	ДанныеДоговора.БанковскийСчетКонтрагента КАК СубконтоКт1,
	|	ВЫБОР 
	|		КОГДА Строки.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|			ТОГДА ДанныеДоговора.СтатьяДДСПоступленияВыдачи
	|			ИНАЧЕ ДанныеДоговора.СтатьяДДСПроцентов 
	|	КОНЕЦ КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	ВЫБОР 
	|		КОГДА Строки.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|			ТОГДА ""Прочие расходы от переоценки депозитов""
	|			ИНАЧЕ ""Прочие расходы от переоценки процентов по депозитам"" 
	|	КОНЕЦ КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.ДоговорыКредитовИДепозитов КАК ДанныеДоговора
	|	ПО
	|		ДанныеДоговора.Ссылка = Строки.Договор
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Константы КАК Константы
	|	ПО 
	|		Истина
	|ГДЕ
	|	ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.Депозит)
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И (Строки.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|		ИЛИ Строки.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты)
	|			И ДанныеДоговора.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговораКредитовИДепозитов.ДепозитВБанкеСКапитализацией)
	|	)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти

#Область ПрочиеРасходы_ДепозитыПроценты  // (Дт 9X :: Кт 36)
	ТекстПрочиеРасходыДепозитыПроценты = "
	|ВЫБРАТЬ // Прочие расходы (Дт 9X :: Кт 36)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоДт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами) КАК ВидСчетаКт,
	|	ДанныеДоговора.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ВЫБОР КОГДА ДанныеДоговора.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|		ИНАЧЕ ДанныеДоговора.ВалютаВзаиморасчетов
	|	КОНЕЦ КАК ВалютаКт,
	|	ДанныеДоговора.Подразделение КАК ПодразделениеКт,
	|	ДанныеДоговора.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ДанныеДоговора.Контрагент КАК СубконтоКт1,
	|	Строки.Договор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	ВЫБОР 
	|		КОГДА Строки.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|			ТОГДА ""Прочие расходы от переоценки депозитов""
	|			ИНАЧЕ ""Прочие расходы от переоценки процентов по депозитам"" 
	|	КОНЕЦ КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.ДоговорыКредитовИДепозитов КАК ДанныеДоговора
	|	ПО
	|		ДанныеДоговора.Ссылка = Строки.Договор
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Константы КАК Константы
	|	ПО 
	|		Истина
	|ГДЕ
	|	ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.Депозит)
	|	И ДанныеДоговора.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговораКредитовИДепозитов.ДепозитВБанке)
	|	И Строки.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты)
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти

#Область ПрочиеРасходы_ЗаймыВыданные_ОсновнойДолг // (Дт 9X :: Кт 3771)
	ТекстПрочиеРасходыЗаймыВыданныеДолг = "
	|ВЫБРАТЬ // Прочие расходы (Дт 9X :: Кт 3771)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоДт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ДанныеДоговора.ВалютаВзаиморасчетов КАК ВалютаКт,
	|	ДанныеДоговора.Подразделение КАК ПодразделениеКт,
	|	ДанныеДоговора.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСДругимиДебиторамиВНациональнойВалюте) КАК СчетКт,	
	|	ДанныеДоговора.Контрагент КАК СубконтоКт1,
	|	Строки.Договор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие расходы от переоценки займов выданных"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.ДоговорыКредитовИДепозитов КАК ДанныеДоговора
	|	ПО
	|		ДанныеДоговора.Ссылка = Строки.Договор
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Константы КАК Константы
	|	ПО 
	|		Истина
	|ГДЕ
	|	ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.ЗаймВыданный)
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Строки.ТипСуммы  = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти

#Область ПрочиеРасходы_ЗаймыВыданные_Проценты // (Дт 9X :: Кт 36)
	ТекстПрочиеРасходыЗаймыВыданныеПроценты = "
	|ВЫБРАТЬ // Прочие расходы (Дт 9X :: Кт 36)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоДт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами) КАК ВидСчетаКт,
	|	ДанныеДоговора.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ВЫБОР КОГДА ДанныеДоговора.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|		ИНАЧЕ ДанныеДоговора.ВалютаВзаиморасчетов
	|	КОНЕЦ КАК ВалютаКт,
	|	ДанныеДоговора.Подразделение КАК ПодразделениеКт,
	|	ДанныеДоговора.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ДанныеДоговора.Контрагент КАК СубконтоКт1,
	|	Строки.Договор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие расходы от переоценки процентов по займам выданным"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.ДоговорыКредитовИДепозитов КАК ДанныеДоговора
	|	ПО
	|		ДанныеДоговора.Ссылка = Строки.Договор
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Константы КАК Константы
	|	ПО
	|		Истина
	|ГДЕ
	|	ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.ЗаймВыданный)
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Строки.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти
// Расчеты с клиентами
#Область ПрочиеРасходы_РасчетыСКлиентами // (Дт 9X :: Кт 36)
	ТекстПрочиеРасходыРасчетыСКлиентами = "
	|ВЫБРАТЬ // Прочие расходы (Дт 9X :: Кт 36)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	-Строки.ДолгРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ВЫБОР КОГДА (Строки.АналитикаУчетаПоПартнерам.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ВЫБОР КОГДА (Строки.АналитикаУчетаПоПартнерам.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоДт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами) КАК ВидСчетаКт,
	|	ЕСТЬNULL(Строки.ЗаказКлиента.ГруппаФинансовогоУчета, 
	|		ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка)) КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	Строки.Валюта КАК ВалютаКт,
	|	Строки.ЗаказКлиента.Подразделение КАК ПодразделениеКт,
	|	ЕСТЬNULL(Строки.ЗаказКлиента.НаправлениеДеятельности, 
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.АналитикаУчетаПоПартнерам.Контрагент КАК СубконтоКт1,
	|	Строки.АналитикаУчетаПоПартнерам.Договор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие расходы от переоценки расчетов с клиентами"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСКлиентамиПоДокументам КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|ГДЕ
	|	Строки.ДолгРегл < 0
	|";
#КонецОбласти
// Ошибки округления, возврат авансов
#Область ПрочиеРасходы_РасчетыСКлиентами_Предоплата // (Дт 9X :: Кт 681)
	ТекстПрочиеРасходыРасчетыСКлиентамиПредоплата = "
	|ВЫБРАТЬ // Прочие расходы (Дт 9X :: Кт 681)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	-Строки.ПредоплатаРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ВЫБОР КОГДА (Строки.АналитикаУчетаПоПартнерам.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ВЫБОР КОГДА (Строки.АналитикаУчетаПоПартнерам.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоДт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыПолученные) КАК ВидСчетаКт,
	|	ЕСТЬNULL(Строки.ЗаказКлиента.ГруппаФинансовогоУчета, 
	|		ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка)) КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	Строки.Валюта КАК ВалютаКт,
	|	Строки.ЗаказКлиента.Подразделение КАК ПодразделениеКт,
	|	ЕСТЬNULL(Строки.ЗаказКлиента.НаправлениеДеятельности, 
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.АналитикаУчетаПоПартнерам.Контрагент КАК СубконтоКт1,
	|	Строки.АналитикаУчетаПоПартнерам.Договор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие расходы от переоценки авансов полученных"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСКлиентамиПоДокументам КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|ГДЕ
	|	Строки.ПредоплатаРегл < 0
	|";
#КонецОбласти
// Расчеты с поставщиками
#Область ПрочиеРасходы_РасчетыСПоставщиками // (Дт 9X :: Кт 63)
	ТекстПрочиеРасходыРасчетыСПоставщиками = "
	|ВЫБРАТЬ // Прочие расходы (Дт 9X :: Кт 63)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	-Строки.ДолгРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ВЫБОР КОГДА (Строки.АналитикаУчетаПоПартнерам.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ВЫБОР КОГДА (Строки.АналитикаУчетаПоПартнерам.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоДт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками) КАК ВидСчетаКт,
	|	ЕСТЬNULL(Строки.ЗаказПоставщику.ГруппаФинансовогоУчета, 
	|		ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка)) КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	Строки.Валюта КАК ВалютаКт,
	|	Строки.ЗаказПоставщику.Подразделение КАК ПодразделениеКт,
	|	ЕСТЬNULL(Строки.ЗаказПоставщику.НаправлениеДеятельности, 
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.АналитикаУчетаПоПартнерам.Контрагент КАК СубконтоКт1,
	|	Строки.АналитикаУчетаПоПартнерам.Договор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие расходы от переоценки расчетов с поставщиками"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСПоставщикамиПоДокументам КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|ГДЕ
	|	Строки.ДолгРегл < 0
	|";
#КонецОбласти
// Ошибки округления, возврат авансов
#Область ПрочиеРасходы_РасчетыСПоставщиками_Предоплата // (Дт 9X :: Кт 371)
	ТекстПрочиеРасходыРасчетыСПоставщикамиПредоплата = "
	|ВЫБРАТЬ // Прочие расходы (Дт 9X :: Кт 371)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	-Строки.ПредоплатаРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ВЫБОР КОГДА (Строки.АналитикаУчетаПоПартнерам.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ВЫБОР КОГДА (Строки.АналитикаУчетаПоПартнерам.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоДт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыВыданные) КАК ВидСчетаКт,
	|	ЕСТЬNULL(Строки.ЗаказПоставщику.ГруппаФинансовогоУчета, 
	|		ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка)) КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	Строки.Валюта КАК ВалютаКт,
	|	Строки.ЗаказПоставщику.Подразделение КАК ПодразделениеКт,
	|	ЕСТЬNULL(Строки.ЗаказПоставщику.НаправлениеДеятельности, 
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.АналитикаУчетаПоПартнерам.Контрагент КАК СубконтоКт1,
	|	Строки.АналитикаУчетаПоПартнерам.Договор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие расходы от переоценки авансов выданных"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСПоставщикамиПоДокументам КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|ГДЕ
	|	Строки.ПредоплатаРегл < 0
	|";
#КонецОбласти



#Область ПрочиеДоходы_БезналичныеДС // (Дт 31 :: Кт 7X)
	ТекстПрочиеДоходыБезналичныеДС = "
	|ВЫБРАТЬ // Прочие доходы (Дт 31 :: Кт 7X)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	Строки.БанковскийСчет.ВалютаДенежныхСредств КАК ВалютаДт,
	|	Строки.БанковскийСчет.Подразделение КАК ПодразделениеДт,
	|	Строки.БанковскийСчет.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	Строки.БанковскийСчет.СчетУчета КАК СчетДт,
	|	Строки.БанковскийСчет КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ВЫБОР КОГДА (Строки.БанковскийСчет.НеоперационнаяДеятельность) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ВЫБОР КОГДА (Строки.БанковскийСчет.НеоперационнаяДеятельность) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие доходы от переоценки безналичных ДС"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ДенежныеСредстваБезналичные КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|ГДЕ
	|	Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти

#Область ПрочиеДоходы_НаличныеДС // (Дт 30 :: Кт 7X)
	ТекстПрочиеДоходыНаличныеДС = "
	|ВЫБРАТЬ // Прочие доходы (Дт 30 :: Кт 7X)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	Строки.Касса.ВалютаДенежныхСредств КАК ВалютаДт,
	|	Строки.Касса.Подразделение КАК ПодразделениеДт,
	|	Строки.Касса.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	Строки.Касса.СчетУчета КАК СчетДт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КАК АналитикаУчетаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие доходы от переоценки наличных ДС"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ДенежныеСредстваНаличные КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|ГДЕ
	|	Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти

#Область ПрочиеДоходы_Подотчетники // (Дт 3722 :: Кт 7X) 
	ТекстПрочиеДоходыПодотчетники = "
	|ВЫБРАТЬ // Прочие доходы (Дт 3722 :: Кт 7X)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	Строки.Валюта КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВИностраннойВалюте) КАК СчетДт,	
	|	Строки.ПодотчетноеЛицо КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КАК АналитикаУчетаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие доходы от переоценки ДС у подотчетников"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|ГДЕ
	|	Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти

#Область ПрочиеДоходы_ДенежныеДокументы // (Дт 332 :: Кт 7X)
	ТекстПрочиеДоходыДенежныеДокументы = "
	|ВЫБРАТЬ // Прочие доходы Дт (Дт 332 :: Кт 7X)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	Строки.ДенежныйДокумент.Валюта КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеДокументыВИностраннойВалюте) КАК СчетДт,
	|	Строки.ДенежныйДокумент КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КАК АналитикаУчетаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие доходы от переоценки денежных документов"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ДенежныеДокументы КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|ГДЕ
	|	Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти

#Область ПрочиеДоходы_ДенежныеСредстваВПути // (Дт 33 :: Кт 7X)
	ТекстПрочиеДоходыДенежныеСредстваВПути = "
	|ВЫБРАТЬ // Прочие доходы (Дт 33 :: Кт 7X)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	Строки.Валюта КАК ВалютаДт,
	|	Строки.Получатель.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ВЫБОР
	|		КОГДА Строки.ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПриобретениеВалюты)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПриобретениеИностраннойВалюты)
	|		КОГДА Строки.ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.РеализацияВалюты)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РеализацияИностраннойВалюты)
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВПутиВИностраннойВалюте)	
	|	КОНЕЦ КАК СчетДт,
	|
	|	ВЫБОР
	|		КОГДА Строки.ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПриобретениеВалюты)
	|			ИЛИ Строки.ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.РеализацияВалюты)
	|			ТОГДА Строки.Контрагент
	|		ИНАЧЕ
	|			Строки.СтатьяДвиженияДенежныхСредств
	|	КОНЕЦ КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КАК АналитикаУчетаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие доходы от переоценки ДС в пути"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ДенежныеСредстваВПути КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|ГДЕ
	|	Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти
// Кредиты, депозиты, займы
#Область ПрочиеДоходы_КредитыИЗаймы_ОсновнойДолг // (Дт 50, 60, 61 :: Кт 7X)
	ТекстПрочиеДоходыКредитыИЗаймыДолг = "
	|ВЫБРАТЬ // Прочие доходы (Дт 50, 60, 61 :: Кт 7X)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ДанныеДоговора.ВалютаВзаиморасчетов КАК ВалютаДт,
	|	ДанныеДоговора.Подразделение КАК ПодразделениеДт,
	|	ДанныеДоговора.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ВЫБОР КОГДА ДанныеДоговора.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета ТОГДА
	// Кредиты, займы в валюте регл. учета
	|		ВЫБОР
			// краткосрочный
	|			КОГДА ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.Краткосрочный)
	|				ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеКредитыБанковВНациональнойВалюте)
			// долгосрочный
	|			КОГДА  ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.Долгосрочный)
	|				ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеКредитыБанковВНациональнойВалюте)
			// долгосрочный истекающий
	|			КОГДА  ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.ДолгосрочныйИстекающий)		
	|				ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТекущаяЗадолженностьПоДолгосрочнымОбязательствамВНациональнойВалюте)
	|		КОНЕЦ
	|	ИНАЧЕ 
	// Кредиты, займы в иностранной валюте
	|		ВЫБОР
			// краткосрочный
	|			КОГДА ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.Краткосрочный)
	|				ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеКредитыБанковВИностраннойВалюте)
			// Кредит, долгосрочный
	|			КОГДА ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.Долгосрочный)
	|				ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеКредитыБанковВИностраннойВалюте)
			// долгосрочный истекающий
	|			КОГДА  ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.ДолгосрочныйИстекающий)
	|				ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТекущаяЗадолженностьПоДолгосрочнымОбязательствамВИностраннойВалюте)
	|		КОНЕЦ
	|	КОНЕЦ КАК СчетДт,
	|
	|	ДанныеДоговора.Контрагент КАК СубконтоДт1,
	|	ДанныеДоговора.Ссылка КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоКт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие доходы от переоценки кредитов, займов полученных"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.ДоговорыКредитовИДепозитов КАК ДанныеДоговора
	|	ПО
	|		ДанныеДоговора.Ссылка = Строки.Договор
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Константы КАК Константы
	|	ПО 
	|		Истина
	|ГДЕ
	|	ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.КредитИлиЗайм)
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Строки.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти

#Область ПрочиеДоходы_КредитыИЗаймы_Проценты // (Дт 50, 60, 61 :: Кт 7X)
	ТекстПрочиеДоходыКредитыИЗаймыПроценты = "
	|ВЫБРАТЬ // Прочие доходы (Дт 50, 60, 61 :: Кт 7X)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ДанныеДоговора.ВалютаВзаиморасчетов КАК ВалютаДт,
	|	ДанныеДоговора.Подразделение КАК ПодразделениеДт,
	|	ДанныеДоговора.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ВЫБОР КОГДА ДанныеДоговора.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета
	|		ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоНачисленнымПроцентамВНациональнойВалюте)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоНачисленнымПроцентамВИностраннойВалюте) 
	|	КОНЕЦ КАК СчетДт,
	|
	|	ДанныеДоговора.Контрагент КАК СубконтоДт1,
	|	ДанныеДоговора.Ссылка КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КАК СубконтоКт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие доходы от переоценки процентов по кредитам, займам полученным"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.ДоговорыКредитовИДепозитов КАК ДанныеДоговора
	|	ПО
	|		ДанныеДоговора.Ссылка = Строки.Договор
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Константы КАК Константы
	|	ПО 
	|		Истина
	|ГДЕ
	|	ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.КредитИлиЗайм)
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Строки.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти

#Область ПрочиеДоходы_КредитыИЗаймы_Комиссия // (Дт 36 :: Кт 7X)
	ТекстПрочиеДоходыКредитыИЗаймыКомиссия = "
	|ВЫБРАТЬ // Прочие доходы (Дт 36 :: Кт 7X)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами) КАК ВидСчетаДт,
	|	ДанныеДоговора.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ДанныеДоговора.ВалютаВзаиморасчетов КАК ВалютаДт,
	|	ДанныеДоговора.Подразделение КАК ПодразделениеДт,
	|	ДанныеДоговора.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ДанныеДоговора.Контрагент КАК СубконтоДт1,
	|	ДанныеДоговора.Ссылка КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоКт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие доходы от переоценки комиссии по кредитам, займам полученным"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.ДоговорыКредитовИДепозитов КАК ДанныеДоговора
	|	ПО
	|		ДанныеДоговора.Ссылка = Строки.Договор
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Константы КАК Константы
	|	ПО 
	|		Истина
	|ГДЕ
	|	ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.КредитИлиЗайм)
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Строки.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Комиссия)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти

#Область ПрочиеДоходы_Депозиты // (Дт 313, 314 :: Кт 7X)
	ТекстПрочиеДоходыДепозиты = "
	|ВЫБРАТЬ // Прочие доходы (Дт 313, 314 :: Кт 7X)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ДанныеДоговора.ВалютаВзаиморасчетов КАК ВалютаДт,
	|	ДанныеДоговора.Подразделение КАК ПодразделениеДт,
	|	ДанныеДоговора.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ВЫБОР КОГДА ДанныеДоговора.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета
	|		ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеСчетаВБанкеВНациональнойВалюте)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеСчетаВБанкеВИностраннойВалюте)
	|	КОНЕЦ КАК СчетДт,
	|
	|	ДанныеДоговора.БанковскийСчетКонтрагента КАК СубконтоДт1,
	|	ВЫБОР 
	|		КОГДА Строки.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|			ТОГДА ДанныеДоговора.СтатьяДДСПоступленияВыдачи
	|			ИНАЧЕ ДанныеДоговора.СтатьяДДСПроцентов 
	|	КОНЕЦ КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоКт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	ВЫБОР 
	|		КОГДА Строки.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|			ТОГДА ""Прочие доходы от переоценки депозитов""
	|			ИНАЧЕ ""Прочие доходы от переоценки процентов по депозитам"" 
	|	КОНЕЦ КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.ДоговорыКредитовИДепозитов КАК ДанныеДоговора
	|	ПО
	|		ДанныеДоговора.Ссылка = Строки.Договор
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Константы КАК Константы
	|	ПО 
	|		Истина
	|ГДЕ
	|	ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.Депозит)
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И (Строки.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|		ИЛИ Строки.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты)
	|			И ДанныеДоговора.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговораКредитовИДепозитов.ДепозитВБанкеСКапитализацией)
	|	)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти

#Область ПрочиеДоходы_ДепозитыПроценты // (Дт 36 :: Кт 7X)
	ТекстПрочиеДоходыДепозитыПроценты = "
	|ВЫБРАТЬ // Прочие доходы (Дт 36 :: Кт 7X)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами) КАК ВидСчетаДт,
	|	ДанныеДоговора.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ВЫБОР КОГДА ДанныеДоговора.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|		ИНАЧЕ ДанныеДоговора.ВалютаВзаиморасчетов
	|	КОНЕЦ КАК ВалютаДт,
	|	ДанныеДоговора.Подразделение КАК ПодразделениеДт,
	|	ДанныеДоговора.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ДанныеДоговора.Контрагент КАК СубконтоДт1,
	|	Строки.Договор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоКт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	ВЫБОР 
	|		КОГДА Строки.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|			ТОГДА ""Прочие доходы от переоценки депозитов""
	|			ИНАЧЕ ""Прочие доходы от переоценки процентов по депозитам"" 
	|	КОНЕЦ КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.ДоговорыКредитовИДепозитов КАК ДанныеДоговора
	|	ПО
	|		ДанныеДоговора.Ссылка = Строки.Договор
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Константы КАК Константы
	|	ПО 
	|		Истина
	|ГДЕ
	|	ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.Депозит)
	|	И ДанныеДоговора.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговораКредитовИДепозитов.ДепозитВБанке)
	|	И Строки.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты)
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти

#Область ПрочиеДоходы_ЗаймыВыданные_ОсновнойДолг // (Дт 3771 :: Кт 7X)
	ТекстПрочиеДоходыЗаймыВыданныеДолг = "
	|ВЫБРАТЬ // Прочие доходы (Дт 3771 :: Кт 7X)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ДанныеДоговора.ВалютаВзаиморасчетов КАК ВалютаДт,
	|	ДанныеДоговора.Подразделение КАК ПодразделениеДт,
	|	ДанныеДоговора.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСДругимиДебиторамиВНациональнойВалюте) КАК СчетДт,
	|	ДанныеДоговора.Контрагент КАК СубконтоДт1,
	|	Строки.Договор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоКт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие доходы от переоценки займов выданных"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.ДоговорыКредитовИДепозитов КАК ДанныеДоговора
	|	ПО
	|		ДанныеДоговора.Ссылка = Строки.Договор
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Константы КАК Константы
	|	ПО 
	|		Истина
	|ГДЕ
	|	ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.ЗаймВыданный)
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Строки.ТипСуммы  = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти

#Область ПрочиеДоходы_ЗаймыВыданные_Проценты // (Дт 36 :: Кт 7X)
	ТекстПрочиеДоходыЗаймыВыданныеПроценты = "
	|ВЫБРАТЬ // Прочие доходы (Дт 36 :: Кт 7X)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами) КАК ВидСчетаДт,
	|	ДанныеДоговора.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ВЫБОР КОГДА ДанныеДоговора.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|		ИНАЧЕ ДанныеДоговора.ВалютаВзаиморасчетов
	|	КОНЕЦ КАК ВалютаДт,
	|	ДанныеДоговора.Подразделение КАК ПодразделениеДт,
	|	ДанныеДоговора.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ДанныеДоговора.Контрагент КАК СубконтоДт1,
	|	Строки.Договор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ВЫБОР КОГДА (ДанныеДоговора.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоКт1,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие доходы от переоценки процентов по займам выданным"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.ДоговорыКредитовИДепозитов КАК ДанныеДоговора
	|	ПО
	|		ДанныеДоговора.Ссылка = Строки.Договор
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Константы КАК Константы
	|	ПО
	|		Истина
	|ГДЕ
	|	ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.ЗаймВыданный)
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Строки.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты)
	|	И Строки.СуммаРегл <> 0
	|";
#КонецОбласти
// Расчеты с клиентами
#Область ПрочиеДоходы_РасчетыСКлиентами // (Дт 36 :: Кт 7X)
	ТекстПрочиеДоходыРасчетыСКлиентами = "
	|ВЫБРАТЬ // Прочие доходы (Дт 36 :: Кт 7X)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.ДолгРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами) КАК ВидСчетаДт,
	|	ЕСТЬNULL(Строки.ЗаказКлиента.ГруппаФинансовогоУчета, 
	|		ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка)) КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	Строки.Валюта КАК ВалютаДт,
	|	Строки.ЗаказКлиента.Подразделение КАК ПодразделениеДт,
	|	ЕСТЬNULL(Строки.ЗаказКлиента.НаправлениеДеятельности, 
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.АналитикаУчетаПоПартнерам.Контрагент КАК СубконтоДт1,
	|	Строки.АналитикаУчетаПоПартнерам.Договор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ВЫБОР КОГДА (Строки.АналитикаУчетаПоПартнерам.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ВЫБОР КОГДА (Строки.АналитикаУчетаПоПартнерам.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие доходы от переоценки расчетов с клиентами"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСКлиентамиПоДокументам КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|ГДЕ
	|	Строки.ДолгРегл > 0
	|";
#КонецОбласти
// Ошибки округления, возврат авансов
#Область ПрочиеДоходы_РасчетыСКлиентами_Предоплата // (Дт 681 :: Кт 7X)
	ТекстПрочиеДоходыРасчетыСКлиентамиПредоплата = "
	|ВЫБРАТЬ // Прочие доходы (Дт 681 :: Кт 7X)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.ПредоплатаРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыПолученные) КАК ВидСчетаДт,
	|	ЕСТЬNULL(Строки.ЗаказКлиента.ГруппаФинансовогоУчета, 
	|		ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка)) КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	Строки.Валюта КАК ВалютаДт,
	|	Строки.ЗаказКлиента.Подразделение КАК ПодразделениеДт,
	|	ЕСТЬNULL(Строки.ЗаказКлиента.НаправлениеДеятельности, 
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.АналитикаУчетаПоПартнерам.Контрагент КАК СубконтоДт1,
	|	Строки.АналитикаУчетаПоПартнерам.Договор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ВЫБОР КОГДА (Строки.АналитикаУчетаПоПартнерам.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ВЫБОР КОГДА (Строки.АналитикаУчетаПоПартнерам.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие доходы от переоценки авансов полученных"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСКлиентамиПоДокументам КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|ГДЕ
	|	Строки.ПредоплатаРегл > 0
	|";
#КонецОбласти
// Расчеты с поставщиками
#Область ПрочиеДоходы_РасчетыСПоставщиками // (Дт 63 :: Кт 7X)
	ТекстПрочиеДоходыРасчетыСПоставщиками = "
	|ВЫБРАТЬ // Прочие доходы (Дт 63 :: Кт 7X)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.ДолгРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками) КАК ВидСчетаДт,
	|	ЕСТЬNULL(Строки.ЗаказПоставщику.ГруппаФинансовогоУчета, 
	|		ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка)) КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	Строки.Валюта КАК ВалютаДт,
	|	Строки.ЗаказПоставщику.Подразделение КАК ПодразделениеДт,
	|	ЕСТЬNULL(Строки.ЗаказПоставщику.НаправлениеДеятельности, 
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.АналитикаУчетаПоПартнерам.Контрагент КАК СубконтоДт1,
	|	Строки.АналитикаУчетаПоПартнерам.Договор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ВЫБОР КОГДА (Строки.АналитикаУчетаПоПартнерам.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ВЫБОР КОГДА (Строки.АналитикаУчетаПоПартнерам.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие доходы от переоценки расчетов с поставщиками"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСПоставщикамиПоДокументам КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|ГДЕ
	|	Строки.ДолгРегл > 0
	|";
#КонецОбласти
// Ошибки округления, возврат авансов
#Область ПрочиеДоходы_РасчетыСПоставщиками_Предоплата // (Дт 371 :: Кт 7X)
	ТекстПрочиеДоходыРасчетыСПоставщикамиПредоплата = "
	|ВЫБРАТЬ // Прочие доходы (Дт 371 :: Кт 7X)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.ПредоплатаРегл КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыВыданные) КАК ВидСчетаДт,
	|	ЕСТЬNULL(Строки.ЗаказПоставщику.ГруппаФинансовогоУчета, 
	|		ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка)) КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	Строки.Валюта КАК ВалютаДт,
	|	Строки.ЗаказПоставщику.Подразделение КАК ПодразделениеДт,
	|	ЕСТЬNULL(Строки.ЗаказПоставщику.НаправлениеДеятельности, 
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.АналитикаУчетаПоПартнерам.Контрагент КАК СубконтоДт1,
	|	Строки.АналитикаУчетаПоПартнерам.Договор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ВЫБОР КОГДА (Строки.АналитикаУчетаПоПартнерам.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК АналитикаУчетаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,	
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ВЫБОР КОГДА (Строки.АналитикаУчетаПоПартнерам.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие доходы от переоценки авансов выданных"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПереоценкаВалютныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСПоставщикамиПоДокументам КАК Строки
	|	ПО
	|		Строки.Регистратор = Операция.Ссылка
	|ГДЕ
	|	Строки.ПредоплатаРегл > 0
	|";
#КонецОбласти

	Возврат                    ТекстПрочиеРасходыБезналичныеДС
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеРасходыНаличныеДС
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеРасходыПодотчетники
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеРасходыДенежныеДокументы
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеРасходыДенежныеСредстваВПути
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеРасходыКредитыИЗаймыДолг
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеРасходыКредитыИЗаймыПроценты
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеРасходыКредитыИЗаймыКомиссия
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеРасходыДепозиты
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеРасходыДепозитыПроценты
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеРасходыЗаймыВыданныеДолг
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеРасходыЗаймыВыданныеПроценты
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеРасходыРасчетыСКлиентами
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеРасходыРасчетыСКлиентамиПредоплата
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеРасходыРасчетыСПоставщиками
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеРасходыРасчетыСПоставщикамиПредоплата
		
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеДоходыБезналичныеДС
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеДоходыНаличныеДС
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеДоходыПодотчетники
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеДоходыДенежныеДокументы
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеДоходыДенежныеСредстваВПути
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеДоходыКредитыИЗаймыДолг
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеДоходыКредитыИЗаймыПроценты
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеДоходыКредитыИЗаймыКомиссия
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеДоходыДепозиты
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеДоходыДепозитыПроценты
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеДоходыЗаймыВыданныеДолг
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеДоходыЗаймыВыданныеПроценты
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеДоходыРасчетыСКлиентами
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеДоходыРасчетыСКлиентамиПредоплата
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеДоходыРасчетыСПоставщиками
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстПрочиеДоходыРасчетыСПоставщикамиПредоплата;
	
КонецФункции

// Функция возвращает текст запроса дополнительных временных таблиц, 
// необходимых для отражения в регламетированном учете
//
Функция ТекстЗапросаВТОтраженияВРеглУчетеУКР() Экспорт
	
	ТекстЗапросаПоКлиентам = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.Период,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам,
	|	ДанныеРегистра.ЗаказКлиента,
	|	ДанныеРегистра.Валюта,
	|	ВЫБОР КОГДА ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА -ДанныеРегистра.ДолгРегл
	|		ИНАЧЕ ДанныеРегистра.ДолгРегл
	|	КОНЕЦ ДолгРегл,
	|	ВЫБОР КОГДА ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА -ДанныеРегистра.ПредоплатаРегл
	|		ИНАЧЕ ДанныеРегистра.ПредоплатаРегл
	|	КОНЕЦ ПредоплатаРегл,
	|	ДанныеРегистра.Регистратор
	|
	|ПОМЕСТИТЬ РасчетыСКлиентами
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК ДанныеРегистра
	|		ПО ДокументыКОтражению.Ссылка = ДанныеРегистра.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСКлиентами.Период КАК Период,
	|	РасчетыСКлиентами.Валюта,
	|	СУММА(РасчетыСКлиентами.ДолгРегл) КАК ДолгРегл,
	|	СУММА(РасчетыСКлиентами.ПредоплатаРегл) КАК ПредоплатаРегл,
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентами.ЗаказКлиента КАК ЗаказКлиента,
	|	Аналитика.Контрагент КАК Контрагент,
	|	Аналитика.Договор КАК Договор,
	|	РасчетыСКлиентами.Регистратор
	|
	|ПОМЕСТИТЬ РасчетыСКлиентамиПоДокументам
	|ИЗ 
	|	РасчетыСКлиентами
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО РасчетыСКлиентами.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасчетыСКлиентами.Период,
	|		РасчетыСКлиентами.Валюта,
	|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам,
	|		РасчетыСКлиентами.ЗаказКлиента,
	|		Аналитика.Контрагент,
	|		Аналитика.Договор,
	|		РасчетыСКлиентами.Регистратор
	|;";
	ТекстЗапросаПоПоставщикам = СтрЗаменить(ТекстЗапросаПоКлиентам,"РасчетыСКлиентами","РасчетыСПоставщиками");
	ТекстЗапросаПоПоставщикам = СтрЗаменить(ТекстЗапросаПоПоставщикам,"ЗаказКлиента","ЗаказПоставщику");
	Разделитель = 
	"
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	ТекстЗапроса = ТекстЗапросаПоКлиентам + Разделитель + ТекстЗапросаПоПоставщикам;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти
//-- НЕ УТ

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	Если Регистры = Неопределено И НЕ ДополнительныеСвойства.Свойство("ВыполненРасчет") Тогда
		РассчитатьКурсовыеРазницы(Запрос.Параметры);
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	// Временные таблицы
	ТекстЗапросаВтТаблицаРасчетыСПоставщикамиПоДокументам(ТекстыЗапроса);
	ТекстЗапросаВтТаблицаРасчетыСКлиентамиПоДокументам(ТекстыЗапроса);
	ТекстЗапросаВтТаблицаДенежныеСредстваБезналичные(ТекстыЗапроса);
	ТекстЗапросаВтТаблицаДенежныеСредстваНаличные(ТекстыЗапроса);
	ТекстЗапросаВтТаблицаДенежныеСредстваВКассахККМ(ТекстыЗапроса);
	ТекстЗапросаВтТаблицаДенежныеСредстваВПути(ТекстыЗапроса);
	ТекстЗапросаВтТаблицаДенежныеСредстваУПодотчетныхЛиц(ТекстыЗапроса);
	//++ НЕ УТ
	ТекстЗапросаВтТаблицаДенежныеДокументы(ТекстыЗапроса);
	//-- НЕ УТ
	ТекстЗапросаВтТаблицаКредитыИДепозиты(ТекстыЗапроса);
	
	ТекстЗапросаВтРасчетыСКлиентами(ТекстыЗапроса);
	ТекстЗапросаВтРасчетыСКлиентамиПоОбъектамРасчета(ТекстыЗапроса);
	ТекстЗапросаВтРасчетыСПоставщиками(ТекстыЗапроса);
	ТекстЗапросаВтРасчетыСПоставщикамиПоОбъектамРасчета(ТекстыЗапроса);
	
	// Таблицы on-line движений
	ТекстЗапросаТаблицаПрочиеДоходы(ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаПрочиеРасходы(ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаДвиженияКонтрагентДоходыРасходы(ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаДвиженияДенежныеСредстваДоходыРасходы(ТекстыЗапроса, Регистры);
	//++ НЕ УТ
	ТекстЗапросаТаблицаОтражениеДокументовВРеглУчете(ТекстыЗапроса, Регистры);
	//-- НЕ УТ
	
	////////////////////////////////////////////////////////////////////////////
	// Выполним запрос и поместим результаты запроса в дополнительные свойства
	
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.ХозяйственнаяОперация,
	|	ВЫБОР КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПереоценкаДС,
	|	ВЫБОР КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПереоценкаРасчетовСПоставщиками,
	|	ВЫБОР КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПереоценкаРасчетовСКлиентами,
	|	ВЫБОР КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаКредитовИДепозитов)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПереоценкаКредитовИДепозитов
	|
	|ИЗ
	|	Документ.ПереоценкаВалютныхСредств КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	НачалоПериода = НачалоМесяца(Реквизиты.Дата);
	КонецПериода = КонецМесяца(Реквизиты.Дата);
	Запрос.УстановитьПараметр("НачалоПериода",                         НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",                          КонецПериода);
	Запрос.УстановитьПараметр("ГраницаНачалоПериода",                  Новый Граница(НачалоПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ГраницаКонецПериода",                   Новый Граница(КонецПериода,  ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",                           Реквизиты.Организация);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация",                 Реквизиты.ХозяйственнаяОперация);
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета",            Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета",        Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ПереоценкаПоДням",                      Ложь);
	Запрос.УстановитьПараметр("ИспользоватьУчетПрочихДоходовРасходов", Константы.ИспользоватьУчетПрочихДоходовРасходов.Получить());
	Запрос.УстановитьПараметр("ПереоценкаДС",                          Реквизиты.ПереоценкаДС);
	Запрос.УстановитьПараметр("ПереоценкаКасс",                        Ложь);
	Запрос.УстановитьПараметр("ПоВсемКассам",                          Истина);
	Запрос.УстановитьПараметр("КассыОрганизации",                      Неопределено);
	Запрос.УстановитьПараметр("ПереоценкаРасчетовСПоставщиками",       Реквизиты.ПереоценкаРасчетовСПоставщиками);
	Запрос.УстановитьПараметр("ПереоценкаРасчетовСКлиентами",          Реквизиты.ПереоценкаРасчетовСКлиентами);
	Запрос.УстановитьПараметр("ПереоценкаКредитовИДепозитов",          Реквизиты.ПереоценкаКредитовИДепозитов);
	Запрос.УстановитьПараметр("АналитикаРасчета",
		РегистрыСведений.АналитикаУчетаПоПартнерам.ПолучитьМассивКлючейАналитикиПоОрганизации(Реквизиты.Организация));
		

	Запрос.УстановитьПараметр("НалоговоеНазначениеОрганизации",  		Справочники.Организации.НалоговоеНазначениеНДС(Реквизиты.Организация, Реквизиты.Дата));
		
КонецПроцедуры

Функция ТекстЗапросаВтТаблицаРасчетыСПоставщикамиПоДокументам(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаРасчетыСПоставщиками";

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РасчетыПоДокументам.ВидДвижения,
	|	РасчетыПоДокументам.Валюта КАК Валюта,
	|	РасчетыПоДокументам.Период КАК Период,
	|	РасчетыПоДокументам.АналитикаУчетаПоПартнерам,
	|	РасчетыПоДокументам.ЗаказПоставщику КАК Заказ,
	|	РасчетыПоДокументам.РасчетныйДокумент,
	|	РасчетыПоДокументам.ДолгУпр КАК СуммаУпр,
	|	РасчетыПоДокументам.ДолгРегл КАК СуммаРегл,
	|	РасчетыПоДокументам.ПредоплатаРегл КАК ПредоплатаРегл,
	|	РасчетыПоДокументам.ПредоплатаУпр КАК ПредоплатаУпр,
	|	РасчетыПоДокументам.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|
	|ПОМЕСТИТЬ ТаблицаРасчетыСПоставщиками
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыПоДокументам
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками)
	|	И РасчетыПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасчетыПоДокументам.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|	И РасчетыПоДокументам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаРасчетыСКлиентамиПоДокументам(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаРасчетыСКлиентами";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РасчетыПоДокументам.ВидДвижения,
	|	РасчетыПоДокументам.Валюта КАК Валюта,
	|	РасчетыПоДокументам.Период КАК Период,
	|	РасчетыПоДокументам.АналитикаУчетаПоПартнерам,
	|	РасчетыПоДокументам.ЗаказКлиента КАК Заказ,
	|	РасчетыПоДокументам.РасчетныйДокумент,
	|	РасчетыПоДокументам.ДатаПлатежа,
	|	РасчетыПоДокументам.ДолгРегл КАК СуммаРегл,
	|	РасчетыПоДокументам.ДолгУпр КАК СуммаУпр,
	|	РасчетыПоДокументам.ПредоплатаРегл КАК ПредоплатаРегл,
	|	РасчетыПоДокументам.ПредоплатаУпр КАК ПредоплатаУпр,
	|	РасчетыПоДокументам.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|
	|ПОМЕСТИТЬ ТаблицаРасчетыСКлиентами
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыПоДокументам
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами)
	|	И РасчетыПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасчетыПоДокументам.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|	И РасчетыПоДокументам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаДенежныеСредстваБезналичные(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаДенежныеСредстваБезналичные";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДенежныеСредства.ВидДвижения,
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.Организация,
	|	ДенежныеСредства.БанковскийСчет КАК БанковскийСчет,
	|	ДенежныеСредства.СуммаУпр КАК СуммаУпр,
	|	ДенежныеСредства.СуммаРегл КАК СуммаРегл,
	|	ДенежныеСредства.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДенежныеСредства.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств
	|ПОМЕСТИТЬ ТаблицаДенежныеСредстваБезналичные
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные КАК ДенежныеСредства
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)
	|	И ДенежныеСредства.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДенежныеСредства.Организация = &Организация
	|	И ДенежныеСредства.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаДенежныеСредстваНаличные(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаДенежныеСредстваНаличные";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДенежныеСредства.ВидДвижения,
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.Организация,
	|	ДенежныеСредства.Касса КАК Касса,
	|	ДенежныеСредства.СуммаУпр КАК СуммаУпр,
	|	ДенежныеСредства.СуммаРегл КАК СуммаРегл,
	|	ДенежныеСредства.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДенежныеСредства.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств
	|ПОМЕСТИТЬ ТаблицаДенежныеСредстваНаличные
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные КАК ДенежныеСредства
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)
	|	И ДенежныеСредства.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДенежныеСредства.Организация = &Организация
	|	И ДенежныеСредства.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаДенежныеСредстваВКассахККМ(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаДенежныеСредстваВКассахККМ";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДенежныеСредства.ВидДвижения,
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.Организация,
	|	ДенежныеСредства.КассаККМ КАК КассаККМ,
	|	ДенежныеСредства.СуммаУпр КАК СуммаУпр,
	|	ДенежныеСредства.СуммаРегл КАК СуммаРегл
	|ПОМЕСТИТЬ ТаблицаДенежныеСредстваВКассахККМ
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ КАК ДенежныеСредства
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)
	|	И ДенежныеСредства.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДенежныеСредства.Организация = &Организация
	|	И ТИПЗНАЧЕНИЯ(ДенежныеСредства.Регистратор) = ТИП(Документ.ПереоценкаВалютныхСредств)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаДенежныеСредстваУПодотчетныхЛиц(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаДенежныеСредстваУПодотчетныхЛиц";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДенежныеСредства.ВидДвижения,
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.Организация,
	|	ДенежныеСредства.ПодотчетноеЛицо КАК ПодотчетноеЛицо,
	|	ДенежныеСредства.ЦельВыдачи КАК ЦельВыдачи,
	|	ДенежныеСредства.Валюта КАК Валюта,
	|	ДенежныеСредства.СуммаУпр КАК СуммаУпр,
	|	ДенежныеСредства.СуммаРегл КАК СуммаРегл,
	|	ДенежныеСредства.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДенежныеСредства.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств
	|ПОМЕСТИТЬ ТаблицаДенежныеСредстваУПодотчетныхЛиц
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц КАК ДенежныеСредства
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)
	|	И ДенежныеСредства.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДенежныеСредства.Организация = &Организация
	|	И ДенежныеСредства.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаДенежныеСредстваВПути(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаДенежныеСредстваВПути";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.Организация,
	|	ДенежныеСредства.ВидПереводаДенежныхСредств КАК ВидПереводаДенежныхСредств,
	|	ДенежныеСредства.Контрагент КАК Контрагент,
	|	ДенежныеСредства.Валюта КАК Валюта,
	|	СУММА(ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -ДенежныеСредства.СуммаУпр
	|			ИНАЧЕ ДенежныеСредства.СуммаУпр
	|	КОНЕЦ) КАК СуммаУпр,
	|	СУММА(
	|		ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -ДенежныеСредства.СуммаРегл
	|			ИНАЧЕ ДенежныеСредства.СуммаРегл
	|		КОНЕЦ) КАК СуммаРегл
	|ПОМЕСТИТЬ втДенежныеСредстваВПути
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути КАК ДенежныеСредства
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)
	|	И ДенежныеСредства.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДенежныеСредства.Организация = &Организация
	|	И ТИПЗНАЧЕНИЯ(ДенежныеСредства.Регистратор) = ТИП(Документ.ПереоценкаВалютныхСредств)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДенежныеСредства.Период,
	|	ДенежныеСредства.Организация,
	|	ДенежныеСредства.ВидПереводаДенежныхСредств,
	|	ДенежныеСредства.Контрагент,
	|	ДенежныеСредства.Валюта";
	ТекстыЗапроса.Добавить(ТекстЗапроса, "втДенежныеСредстваВПути");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫБОР КОГДА ДенежныеСредства.СуммаУпр > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.Организация,
	|	НЕОПРЕДЕЛЕНО КАК Получатель,
	|	ДенежныеСредства.ВидПереводаДенежныхСредств КАК ВидПереводаДенежныхСредств,
	|	ДенежныеСредства.Контрагент КАК Контрагент,
	|	ДенежныеСредства.Валюта КАК Валюта,
	|	ВЫБОР КОГДА ДенежныеСредства.СуммаУпр > 0
	|			ТОГДА ДенежныеСредства.СуммаУпр
	|			ИНАЧЕ -ДенежныеСредства.СуммаУпр
	|	КОНЕЦ КАК СуммаУпр,
	|	0 КАК СуммаРегл,
	|	ВЫБОР КОГДА ДенежныеСредства.СуммаУпр > 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств
	|ПОМЕСТИТЬ ТаблицаДенежныеСредстваВПути
	|ИЗ
	|	втДенежныеСредстваВПути КАК ДенежныеСредства
	|ГДЕ
	|	ДенежныеСредства.СуммаУпр <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА ДенежныеСредства.СуммаРегл > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.Организация,
	|	НЕОПРЕДЕЛЕНО КАК Получатель,
	|	ДенежныеСредства.ВидПереводаДенежныхСредств КАК ВидПереводаДенежныхСредств,
	|	ДенежныеСредства.Контрагент КАК Контрагент,
	|	ДенежныеСредства.Валюта КАК Валюта,
	|	0 КАК СуммаУпр,
	|	ВЫБОР КОГДА ДенежныеСредства.СуммаРегл > 0
	|			ТОГДА ДенежныеСредства.СуммаРегл
	|			ИНАЧЕ -ДенежныеСредства.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	ВЫБОР КОГДА ДенежныеСредства.СуммаРегл > 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств
	|
	|ИЗ
	|	втДенежныеСредстваВПути КАК ДенежныеСредства
	|ГДЕ
	|	ДенежныеСредства.СуммаРегл <> 0";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции
//++ НЕ УТ
Функция ТекстЗапросаВтТаблицаДенежныеДокументы(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаДенежныеДокументы";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДенежныеДокументы.ВидДвижения,
	|	ДенежныеДокументы.Период КАК Период,
	|	ДенежныеДокументы.Организация,
	|	ДенежныеДокументы.Подразделение КАК Подразделение,
	|	ДенежныеДокументы.МОЛ КАК МОЛ,
	|	ДенежныеДокументы.ДенежныйДокумент КАК ДенежныйДокумент,
	|	ДенежныеДокументы.СуммаУпр КАК СуммаУпр,
	|	ДенежныеДокументы.СуммаРегл КАК СуммаРегл,
	|	ДенежныеДокументы.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ПОМЕСТИТЬ ТаблицаДенежныеДокументы
	|ИЗ
	|	РегистрНакопления.ДенежныеДокументы КАК ДенежныеДокументы
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)
	|	И ДенежныеДокументы.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДенежныеДокументы.Организация = &Организация
	|	И ДенежныеДокументы.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции
//-- НЕ УТ

Функция ТекстЗапросаВтТаблицаКредитыИДепозиты(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаКредитыИДепозиты";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КредитыИДепозиты.ВидДвижения,
	|	КредитыИДепозиты.Период КАК Период,
	|	КредитыИДепозиты.АналитикаУчетаПоПартнерам,
	|	КредитыИДепозиты.Договор КАК Договор,
	|	КредитыИДепозиты.Договор.ХарактерДоговора КАК ХарактерДоговора,
	|	КредитыИДепозиты.ТипСуммы КАК ТипСуммы,
	|	КредитыИДепозиты.Договор.ВалютаВзаиморасчетов КАК Валюта,
	|	КредитыИДепозиты.СуммаВВалюте КАК СуммаВВалюте,
	|	КредитыИДепозиты.СуммаУпр КАК СуммаУпр,
	|	КредитыИДепозиты.СуммаРегл КАК СуммаРегл
	|ПОМЕСТИТЬ ТаблицаКредитыИДепозиты
	|ИЗ
	|	РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов КАК КредитыИДепозиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО КредитыИДепозиты.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаКредитовИДепозитов)
	|	И КредитыИДепозиты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Аналитика.Организация = &Организация
	|	И ТИПЗНАЧЕНИЯ(КредитыИДепозиты.Регистратор) = ТИП(Документ.ПереоценкаВалютныхСредств)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтРасчетыСКлиентами(ТекстыЗапроса = Неопределено)

	ИмяРегистра = "РасчетыСКлиентами";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.Период,
	|	ДанныеРегистра.Валюта,
	|	ВЫБОР КОГДА ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА -ДанныеРегистра.СуммаРегл
	|		ИНАЧЕ ДанныеРегистра.СуммаРегл
	|	КОНЕЦ ДолгРегл,
	|	ВЫБОР КОГДА ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА -ДанныеРегистра.СуммаУпр
	|		ИНАЧЕ ДанныеРегистра.СуммаУпр
	|	КОНЕЦ ДолгУпр,
	|	ВЫБОР КОГДА ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА -ДанныеРегистра.ПредоплатаРегл
	|		ИНАЧЕ ДанныеРегистра.ПредоплатаРегл
	|	КОНЕЦ ПредоплатаРегл,
	|	ВЫБОР КОГДА ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА -ДанныеРегистра.ПредоплатаУпр
	|		ИНАЧЕ ДанныеРегистра.ПредоплатаУпр
	|	КОНЕЦ ПредоплатаУпр,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам,
	|	ДанныеРегистра.Заказ,
	|	ДанныеРегистра.ХозяйственнаяОперация
	|
	|ПОМЕСТИТЬ РасчетыСКлиентами
	|ИЗ
	|	ТаблицаРасчетыСКлиентами КАК ДанныеРегистра";
	
	Если ТекстыЗапроса <> Неопределено Тогда
		ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтРасчетыСКлиентамиПоОбъектамРасчета(ТекстыЗапроса = Неопределено)

	ИмяРегистра = "РасчетыСКлиентамиПоОбъектамРасчета";
	
	Если ТекстыЗапроса <> Неопределено Тогда
		Если Не ПроведениеСервер.ЕстьТаблицаЗапроса("ТаблицаРасчетыСКлиентами", ТекстыЗапроса) Тогда
			ТекстЗапросаВтТаблицаРасчетыСКлиентамиПоДокументам(ТекстыЗапроса);
		КонецЕсли;

		Если Не ПроведениеСервер.ЕстьТаблицаЗапроса("РасчетыСКлиентами", ТекстыЗапроса) Тогда
			ТекстЗапросаВтРасчетыСКлиентами(ТекстыЗапроса);
		КонецЕсли;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РасчетыСКлиентами.Период КАК Период,
	|	РасчетыСКлиентами.Валюта,
	|	СУММА(РасчетыСКлиентами.ДолгРегл) КАК СуммаРегл,
	|	СУММА(РасчетыСКлиентами.ДолгУпр) КАК СуммаУпр,
	|	СУММА(РасчетыСКлиентами.ПредоплатаРегл) КАК ПредоплатаРегл,
	|	СУММА(РасчетыСКлиентами.ПредоплатаУпр) КАК ПредоплатаУпр,
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентами.Заказ КАК Заказ,
	|	Аналитика.Контрагент КАК Контрагент,
	|	Аналитика.Договор КАК Договор,
	|	РасчетыСКлиентами.ХозяйственнаяОперация
	|
	|ПОМЕСТИТЬ РасчетыСКлиентамиПоОбъектамРасчета
	|ИЗ
	|	РасчетыСКлиентами
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО РасчетыСКлиентами.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасчетыСКлиентами.Период,
	|		РасчетыСКлиентами.Валюта,
	|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам,
	|		РасчетыСКлиентами.Заказ,
	|		Аналитика.Контрагент,
	|		Аналитика.Договор,
	|		РасчетыСКлиентами.ХозяйственнаяОперация";
	
	Если ТекстыЗапроса <> Неопределено Тогда
		ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтРасчетыСПоставщиками(ТекстыЗапроса = Неопределено)

	ИмяРегистра = "РасчетыСПоставщиками";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапросаВтРасчетыСКлиентами(),"РасчетыСКлиентами","РасчетыСПоставщиками");
	
	Если ТекстыЗапроса <> Неопределено Тогда
		ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтРасчетыСПоставщикамиПоОбъектамРасчета(ТекстыЗапроса)

	ИмяРегистра = "РасчетыСПоставщикамиПоОбъектамРасчета";

	Если Не ПроведениеСервер.ЕстьТаблицаЗапроса("ТаблицаРасчетыСПоставщиками", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаРасчетыСПоставщикамиПоДокументам(ТекстыЗапроса);
	КонецЕсли;

	Если Не ПроведениеСервер.ЕстьТаблицаЗапроса("РасчетыСПоставщиками", ТекстыЗапроса) Тогда
		ТекстЗапросаВтРасчетыСПоставщиками(ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапросаВтРасчетыСКлиентамиПоОбъектамРасчета(),"РасчетыСКлиентами","РасчетыСПоставщиками");
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ДобавитьВременныеТаблицы(ТекстыЗапроса, ГруппаТаблиц = "")
	
	Если ГруппаТаблиц = "ДенежныеСредства" ИЛИ ПустаяСтрока(ГруппаТаблиц) Тогда
		Если Не ПроведениеСервер.ЕстьТаблицаЗапроса("ТаблицаДенежныеСредстваБезналичные", ТекстыЗапроса) Тогда
			ТекстЗапросаВтТаблицаДенежныеСредстваБезналичные(ТекстыЗапроса);
		КонецЕсли;

		Если Не ПроведениеСервер.ЕстьТаблицаЗапроса("ТаблицаДенежныеСредстваНаличные", ТекстыЗапроса) Тогда
			ТекстЗапросаВтТаблицаДенежныеСредстваНаличные(ТекстыЗапроса);
		КонецЕсли;

		Если Не ПроведениеСервер.ЕстьТаблицаЗапроса("ТаблицаДенежныеСредстваВКассахККМ", ТекстыЗапроса) Тогда
			ТекстЗапросаВтТаблицаДенежныеСредстваВКассахККМ(ТекстыЗапроса);
		КонецЕсли;

		Если Не ПроведениеСервер.ЕстьТаблицаЗапроса("ТаблицаДенежныеСредстваУПодотчетныхЛиц", ТекстыЗапроса) Тогда
			ТекстЗапросаВтТаблицаДенежныеСредстваУПодотчетныхЛиц(ТекстыЗапроса);
		КонецЕсли;
		//++ НЕ УТ
		Если Не ПроведениеСервер.ЕстьТаблицаЗапроса("ТаблицаДенежныеДокументы", ТекстыЗапроса) Тогда
			ТекстЗапросаВтТаблицаДенежныеДокументы(ТекстыЗапроса);
		КонецЕсли;
		//-- НЕ УТ

		Если Не ПроведениеСервер.ЕстьТаблицаЗапроса("ТаблицаДенежныеСредстваВПути", ТекстыЗапроса) Тогда
			ТекстЗапросаВтТаблицаДенежныеСредстваВПути(ТекстыЗапроса);
		КонецЕсли;
	КонецЕсли;

	Если Не ПроведениеСервер.ЕстьТаблицаЗапроса("ТаблицаКредитыИДепозиты", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаКредитыИДепозиты(ТекстыЗапроса);
	КонецЕсли;
	
	Если ГруппаТаблиц = "РасчетыСПартнерами" ИЛИ ПустаяСтрока(ГруппаТаблиц) Тогда
		Если Не ПроведениеСервер.ЕстьТаблицаЗапроса("РасчетыСКлиентамиПоОбъектамРасчета", ТекстыЗапроса) Тогда
			ТекстЗапросаВтРасчетыСКлиентамиПоОбъектамРасчета(ТекстыЗапроса);
		КонецЕсли;

		Если Не ПроведениеСервер.ЕстьТаблицаЗапроса("РасчетыСПоставщикамиПоОбъектамРасчета", ТекстыЗапроса) Тогда
			ТекстЗапросаВтРасчетыСПоставщикамиПоОбъектамРасчета(ТекстыЗапроса);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаПрочиеДоходы(ТекстыЗапроса, Регистры = Неопределено)

	ИмяРегистра = "ПрочиеДоходы";
	
	Если Не ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	ДобавитьВременныеТаблицы(ТекстыЗапроса);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	&Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	ВЫБОР КОГДА ВложенныйЗапрос.Неоперационная ТОГДА 
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КОНЕЦ КАК СтатьяДоходов,
	|	ВложенныйЗапрос.АналитикаДоходов КАК АналитикаДоходов,
	|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
	|	СУММА(ВложенныйЗапрос.СуммаРегл) КАК СуммаРегл,
	|	ВложенныйЗапрос.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|
	|ИЗ (
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.БанковскийСчет.НеоперационнаяДеятельность КАК Неоперационная,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		ТаблицаДенежныеСредстваБезналичные КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаУпр <> 0
	|		И Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ЛОЖЬ КАК Неоперационная,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		ТаблицаДенежныеСредстваНаличные КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаУпр <> 0
	|		И Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ЛОЖЬ КАК Неоперационная,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		ТаблицаДенежныеСредстваВКассахККМ КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаУпр <> 0
	|		И Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ЛОЖЬ КАК Неоперационная,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		ТаблицаДенежныеСредстваУПодотчетныхЛиц КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаУпр <> 0
	|		И Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//++ НЕ УТ
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ЛОЖЬ КАК Неоперационная,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		ТаблицаДенежныеДокументы КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаУпр <> 0
	|		И Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//-- НЕ УТ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ЛОЖЬ КАК Неоперационная,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		ТаблицаДенежныеСредстваВПути КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаУпр <> 0
	|		И Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА (Таблица.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) 
	|			ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК Неоперационная,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.КредитыИДепозиты) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		ТаблицаКредитыИДепозиты КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаУпр <> 0
	|		И Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	// Курсовые разницы от расчетов с клиентами
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА (Таблица.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) 
	|			ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК Неоперационная,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаУпр > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	// Курсовые разницы от расчетов с клиентами: ошибки округления, возврат авансов
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА (Таблица.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) 
	|			ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК Неоперационная,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами) КАК АналитикаДоходов,
	|		Таблица.ПредоплатаУпр КАК Сумма,
	|		Таблица.ПредоплатаРегл КАК СуммаРегл,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ПредоплатаУпр > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	// Курсовые разницы от расчетов с поставщиками
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА (Таблица.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) 
	|			ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК Неоперационная,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаУпр > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	// Курсовые разницы от расчетов с поставщиками: ошибки округления, возврат авансов
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА (Таблица.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) 
	|			ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК Неоперационная,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками) КАК АналитикаДоходов,
	|		Таблица.ПредоплатаУпр КАК Сумма,
	|		Таблица.ПредоплатаРегл КАК СуммаРегл,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ПредоплатаУпр > 0
	|
	|	) КАК ВложенныйЗапрос
	|
	|ГДЕ
	|	&ИспользоватьУчетПрочихДоходовРасходов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Неоперационная,
	|	ВложенныйЗапрос.АналитикаДоходов,
	|	ВложенныйЗапрос.ХозяйственнаяОперация
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Период";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПрочиеРасходы(ТекстыЗапроса, Регистры = Неопределено)

	ИмяРегистра = "ПрочиеРасходы";
	
	Если Не ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	ДобавитьВременныеТаблицы(ТекстыЗапроса);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	&Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	ВЫБОР КОГДА ВложенныйЗапрос.Неоперационная ТОГДА 
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КОНЕЦ КАК СтатьяРасходов,
	|	ВложенныйЗапрос.АналитикаРасходов КАК АналитикаРасходов,
	|	СУММА(ВложенныйЗапрос.СуммаУпр) КАК Сумма,
    //++ НЕ УТ
	|	СУММА(ВложенныйЗапрос.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ВложенныйЗапрос.СуммаРегл) КАК СуммаРеглБезНДС,
	|	0 КАК НДСРегл,
	|	&НалоговоеНазначениеОрганизации КАК НалоговоеНазначение,
    //-- НЕ УТ
	|	ВложенныйЗапрос.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|
	|ИЗ (
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.БанковскийСчет.НеоперационнаяДеятельность КАК Неоперационная,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		ТаблицаДенежныеСредстваБезналичные КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ЛОЖЬ КАК Неоперационная,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		ТаблицаДенежныеСредстваНаличные КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ЛОЖЬ КАК Неоперационная,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		ТаблицаДенежныеСредстваВКассахККМ КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ЛОЖЬ КАК Неоперационная,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		ТаблицаДенежныеСредстваУПодотчетныхЛиц КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//++ НЕ УТ
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ЛОЖЬ КАК Неоперационная,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		ТаблицаДенежныеДокументы КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//-- НЕ УТ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ЛОЖЬ КАК Неоперационная,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		ТаблицаДенежныеСредстваВПути КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА (Таблица.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) 
	|			ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК Неоперационная,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.КредитыИДепозиты) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		ТаблицаКредитыИДепозиты КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	//Курсовые разницы от расчетов с клиентами
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА (Таблица.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) 
	|			ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК Неоперационная,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами) КАК АналитикаРасходов,
	|		ВЫБОР КОГДА Таблица.СуммаУпр < 0
	|			ТОГДА -Таблица.СуммаУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаУпр,
	|		ВЫБОР КОГДА Таблица.СуммаРегл < 0
	|			ТОГДА -Таблица.СуммаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаРегл,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаРегл < 0 ИЛИ Таблица.СуммаУпр < 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	//Курсовые разницы от расчетов с клиентами: ошибки округления, возврат авансов
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА (Таблица.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) 
	|			ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК Неоперационная,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами) КАК АналитикаРасходов,
	|		ВЫБОР КОГДА Таблица.ПредоплатаУпр < 0
	|			ТОГДА -Таблица.ПредоплатаУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаУпр,
	|		ВЫБОР КОГДА Таблица.ПредоплатаРегл < 0
	|			ТОГДА -Таблица.ПредоплатаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаРегл,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ПредоплатаРегл < 0 ИЛИ Таблица.ПредоплатаУпр < 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	//Курсовые разницы от расчетов с поставщиками
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА (Таблица.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) 
	|			ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК Неоперационная,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками) КАК АналитикаРасходов,
	|		ВЫБОР КОГДА Таблица.СуммаУпр < 0
	|			ТОГДА -Таблица.СуммаУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаУпр,
	|		ВЫБОР КОГДА Таблица.СуммаРегл < 0
	|			ТОГДА -Таблица.СуммаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаРегл,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаРегл < 0 ИЛИ Таблица.СуммаУпр < 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	//Курсовые разницы от расчетов с поставщиками: ошибки округления, возврат авансов
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА (Таблица.Договор.ВидДеятельностиДляДДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Финансовая),ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляДДС.Инвестиционная))) 
	|			ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК Неоперационная,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками) КАК АналитикаРасходов,
	|		ВЫБОР КОГДА Таблица.ПредоплатаУпр < 0
	|			ТОГДА -Таблица.ПредоплатаУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаУпр,
	|		ВЫБОР КОГДА Таблица.ПредоплатаРегл < 0
	|			ТОГДА -Таблица.ПредоплатаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаРегл,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ПредоплатаРегл < 0 ИЛИ Таблица.ПредоплатаУпр < 0
	|
	|	) КАК ВложенныйЗапрос
	|
	|ГДЕ
	|	&ИспользоватьУчетПрочихДоходовРасходов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Неоперационная,
	|	ВложенныйЗапрос.АналитикаРасходов,
	|	ВложенныйЗапрос.ХозяйственнаяОперация
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Период";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДвиженияКонтрагентДоходыРасходы(ТекстыЗапроса, Регистры = Неопределено)

	ИмяРегистра = "ДвиженияКонтрагентДоходыРасходы";
	
	Если Не ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	ДобавитьВременныеТаблицы(ТекстыЗапроса, "РасчетыСПартнерами");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	&Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|
	|	РегистрАналитики.Партнер КАК Партнер,
	|	РегистрАналитики.Контрагент КАК Контрагент,
	|
	|	ВложенныйЗапрос.Договор КАК Договор,
	|	ВложенныйЗапрос.Заказ КАК ОбъектРасчетов,
	|	ВложенныйЗапрос.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	ВложенныйЗапрос.АналитикаДоходов КАК АналитикаДоходов,
	|	ВложенныйЗапрос.АналитикаРасходов КАК АналитикаРасходов,
	|	ВложенныйЗапрос.Валюта КАК Валюта,
	|	ВложенныйЗапрос.Валюта КАК ВалютаВзаиморасчетов,
	|
	|	СУММА(ВложенныйЗапрос.СуммаУпр) КАК Сумма,
	|	СУММА(ВложенныйЗапрос.СуммаУпр) КАК СуммаБезНДС,
	|	СУММА(ВложенныйЗапрос.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ВложенныйЗапрос.СуммаРегл) КАК СуммаРеглБезНДС,
	|
	|	ВложенныйЗапрос.Заказ КАК ИсточникГФУРасчетов
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР
	|			КОГДА Таблица.СуммаРегл > 0 ИЛИ Таблица.СуммаУпр > 0
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль)
	|			КОГДА Таблица.СуммаРегл < 0 ИЛИ Таблица.СуммаУпр < 0
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток)
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		НЕОПРЕДЕЛЕНО КАК Договор,
	|		Таблица.Заказ КАК Заказ,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА Таблица.СуммаУпр > 0 ИЛИ Таблица.СуммаРегл > 0
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками) 
	|			КОГДА Таблица.СуммаУпр < 0 ИЛИ Таблица.СуммаРегл < 0
	|				ТОГДА НЕОПРЕДЕЛЕНО 
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР
	|			КОГДА Таблица.СуммаУпр > 0 ИЛИ Таблица.СуммаРегл > 0
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|			КОГДА Таблица.СуммаУпр < 0 ИЛИ Таблица.СуммаРегл < 0
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками) 
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР 
	|			КОГДА Таблица.СуммаУпр > 0 ИЛИ Таблица.СуммаРегл > 0
	|				ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) 
	|			КОГДА Таблица.СуммаУпр < 0 ИЛИ Таблица.СуммаРегл < 0
	|				ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) 
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.СуммаУпр < 0
	|			ТОГДА -Таблица.СуммаУпр
	|			ИНАЧЕ Таблица.СуммаУпр
	|		КОНЕЦ КАК СуммаУпр,
	|		ВЫБОР КОГДА Таблица.СуммаРегл < 0
	|			ТОГДА -Таблица.СуммаРегл
	|			ИНАЧЕ Таблица.СуммаРегл
	|		КОНЕЦ КАК СуммаРегл
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаРегл <> 0 ИЛИ Таблица.СуммаУпр <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаРегл > 0 ИЛИ Таблица.ПредоплатаУпр > 0
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль)
	|			КОГДА Таблица.ПредоплатаРегл < 0 ИЛИ Таблица.ПредоплатаУпр < 0
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		НЕОПРЕДЕЛЕНО КАК Договор,
	|		Таблица.Заказ КАК Заказ,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаРегл > 0 ИЛИ Таблица.ПредоплатаУпр > 0
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками)
	|			КОГДА Таблица.ПредоплатаРегл < 0 ИЛИ Таблица.ПредоплатаУпр < 0
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаРегл > 0 ИЛИ Таблица.ПредоплатаУпр > 0
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|			КОГДА Таблица.ПредоплатаРегл < 0 ИЛИ Таблица.ПредоплатаУпр < 0
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками)
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаРегл > 0 ИЛИ Таблица.ПредоплатаУпр > 0
	|				ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			КОГДА Таблица.ПредоплатаРегл < 0 ИЛИ Таблица.ПредоплатаУпр < 0
	|				ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ПредоплатаУпр < 0
	|			ТОГДА -Таблица.ПредоплатаУпр
	|			ИНАЧЕ Таблица.ПредоплатаУпр
	|		КОНЕЦ КАК СуммаУпр,
	|		ВЫБОР КОГДА Таблица.ПредоплатаРегл < 0
	|			ТОГДА -Таблица.ПредоплатаРегл
	|			ИНАЧЕ Таблица.ПредоплатаРегл
	|		КОНЕЦ КАК СуммаРегл
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ПредоплатаРегл <> 0 ИЛИ Таблица.ПредоплатаУпр <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР
	|			КОГДА Таблица.СуммаРегл > 0 ИЛИ Таблица.СуммаУпр > 0
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль)
	|			КОГДА Таблица.СуммаРегл < 0 ИЛИ Таблица.СуммаУпр < 0
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		НЕОПРЕДЕЛЕНО КАК Договор,
	|		Таблица.Заказ КАК Заказ,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА Таблица.СуммаРегл > 0 ИЛИ Таблица.СуммаУпр > 0
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами)
	|			КОГДА Таблица.СуммаРегл < 0 ИЛИ Таблица.СуммаУпр < 0
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР
	|			КОГДА Таблица.СуммаРегл > 0 ИЛИ Таблица.СуммаУпр > 0
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|			КОГДА Таблица.СуммаРегл < 0 ИЛИ Таблица.СуммаУпр < 0
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами)
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР
	|			КОГДА Таблица.СуммаРегл > 0 ИЛИ Таблица.СуммаУпр > 0
	|				ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) 
	|			КОГДА Таблица.СуммаРегл < 0 ИЛИ Таблица.СуммаУпр < 0
	|				ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) 
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.СуммаУпр < 0
	|			ТОГДА -Таблица.СуммаУпр
	|			ИНАЧЕ Таблица.СуммаУпр
	|		КОНЕЦ КАК СуммаУпр,
	|		ВЫБОР КОГДА Таблица.СуммаРегл < 0
	|			ТОГДА -Таблица.СуммаРегл
	|			ИНАЧЕ Таблица.СуммаРегл
	|		КОНЕЦ КАК СуммаРегл
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаРегл <> 0 ИЛИ Таблица.СуммаУпр <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаРегл > 0 ИЛИ Таблица.ПредоплатаУпр > 0
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль)
	|			КОГДА Таблица.ПредоплатаРегл < 0 ИЛИ Таблица.ПредоплатаУпр < 0
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		НЕОПРЕДЕЛЕНО КАК Договор,
	|		Таблица.Заказ КАК Заказ,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаРегл > 0 ИЛИ Таблица.ПредоплатаУпр > 0
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами)
	|			КОГДА Таблица.ПредоплатаРегл < 0 ИЛИ Таблица.ПредоплатаУпр < 0
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаРегл > 0 ИЛИ Таблица.ПредоплатаУпр > 0
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|			КОГДА Таблица.ПредоплатаРегл < 0 ИЛИ Таблица.ПредоплатаУпр < 0
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами)
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаРегл > 0 ИЛИ Таблица.ПредоплатаУпр > 0
	|				ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			КОГДА Таблица.ПредоплатаРегл < 0 ИЛИ Таблица.ПредоплатаУпр < 0
	|				ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ПредоплатаУпр < 0
	|			ТОГДА -Таблица.ПредоплатаУпр
	|			ИНАЧЕ Таблица.ПредоплатаУпр
	|		КОНЕЦ КАК СуммаУпр,
	|		ВЫБОР КОГДА Таблица.ПредоплатаРегл < 0
	|			ТОГДА -Таблица.ПредоплатаРегл
	|			ИНАЧЕ Таблица.ПредоплатаРегл
	|		КОНЕЦ КАК СуммаРегл
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ПредоплатаРегл <> 0 ИЛИ Таблица.ПредоплатаУпр <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКредитыИЗаймыПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКредитыИЗаймыУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		НЕОПРЕДЕЛЕНО КАК Заказ,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.КредитыИДепозиты) 
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.КредитыИДепозиты) 
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) 
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл
	|	ИЗ
	|		ТаблицаКредитыИДепозиты КАК Таблица
	|	ГДЕ
	|		Таблица.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.КредитИлиЗайм)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыЗаймыВыданныеПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыЗаймыВыданныеУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		НЕОПРЕДЕЛЕНО КАК Заказ,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.КредитыИДепозиты) 
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.КредитыИДепозиты) 
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) 
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл
	|	ИЗ
	|		ТаблицаКредитыИДепозиты КАК Таблица
	|	ГДЕ
	|		Таблица.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.ЗаймВыданный)
	|	) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитики
	|		ПО ВложенныйЗапрос.АналитикаУчетаПоПартнерам = РегистрАналитики.КлючАналитики
	|ГДЕ
	|	&ИспользоватьУчетПрочихДоходовРасходов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период,
	|	РегистрАналитики.Контрагент,
	|	РегистрАналитики.Партнер,
	|	ВложенныйЗапрос.СтатьяДоходовРасходов,
	|	ВложенныйЗапрос.ХозяйственнаяОперация,
	|	ВложенныйЗапрос.АналитикаДоходов,
	|	ВложенныйЗапрос.АналитикаРасходов,
	|	ВложенныйЗапрос.Договор,
	|	ВложенныйЗапрос.Заказ,
	|	ВложенныйЗапрос.Валюта
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Период";
	
	ПолеДоговор = ДенежныеСредстваПовтИсп.ТекстЗапросаРеквизитаОбъектаРасчетов("ВложенныйЗапрос.Заказ","Договор");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВложенныйЗапрос.Договор", ПолеДоговор);
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДвиженияДенежныеСредстваДоходыРасходы(ТекстыЗапроса, Регистры = Неопределено)

	ИмяРегистра = "ДвиженияДенежныеСредстваДоходыРасходы";
	
	Если Не ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	ДобавитьВременныеТаблицы(ТекстыЗапроса, "ДенежныеСредства");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	&Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|
	|	ВложенныйЗапрос.ДенежныеСредства КАК ДенежныеСредства,
	|	ВложенныйЗапрос.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ВложенныйЗапрос.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ВложенныйЗапрос.Валюта КАК Валюта,
	|
	|	ВложенныйЗапрос.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	ВложенныйЗапрос.АналитикаДоходов КАК АналитикаДоходов,
	|	ВложенныйЗапрос.АналитикаРасходов КАК АналитикаРасходов,
	|
	|	СУММА(ВложенныйЗапрос.СуммаУпр) КАК Сумма,
	|	СУММА(ВложенныйЗапрос.СуммаРегл) КАК СуммаРегл,
	|	0 КАК СуммаВВалюте,
	|	
	|	ВложенныйЗапрос.ИсточникГФУДенежныхСредств КАК ИсточникГФУДенежныхСредств,
	|	ВложенныйЗапрос.ИсточникГФУДоходовРасходов КАК ИсточникГФУДоходовРасходов
	|
	|ИЗ (
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		Таблица.СтатьяДвиженияДенежныхСредств,
	|
	|		Таблица.БанковскийСчет КАК ДенежныеСредства,
	|		Значение(Перечисление.ТипыДенежныхСредств.Безналичные) КАК ТипДенежныхСредств,
	|		Таблица.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|		КОНЕЦ КАК АналитикаРасходов,
	|
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|
	|		Таблица.БанковскийСчет КАК ИсточникГФУДенежныхСредств,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК ИсточникГФУДоходовРасходов
	|	
	|	ИЗ
	|		ТаблицаДенежныеСредстваБезналичные КАК Таблица
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		Таблица.СтатьяДвиженияДенежныхСредств,
	|
	|		Таблица.Касса КАК ДенежныеСредства,
	|		Значение(Перечисление.ТипыДенежныхСредств.Наличные) КАК ТипДенежныхСредств,
	|		Таблица.Касса.ВалютаДенежныхСредств КАК Валюта,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|		КОНЕЦ КАК АналитикаРасходов,
	|
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|
	|		Таблица.Касса КАК ИсточникГФУДенежныхСредств,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК ИсточникГФУДоходовРасходов
	|	
	|	ИЗ
	|		ТаблицаДенежныеСредстваНаличные КАК Таблица
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток) 
	|		КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|
	|		Таблица.КассаККМ КАК ДенежныеСредства,
	|		Значение(Перечисление.ТипыДенежныхСредств.Наличные) КАК ТипДенежныхСредств,
	|		Таблица.КассаККМ.ВалютаДенежныхСредств КАК Валюта,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|		КОНЕЦ КАК АналитикаРасходов,
	|
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|
	|		Таблица.КассаККМ КАК ИсточникГФУДенежныхСредств,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК ИсточникГФУДоходовРасходов
	|	
	|	ИЗ
	|		ТаблицаДенежныеСредстваВКассахККМ КАК Таблица
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		Таблица.СтатьяДвиженияДенежныхСредств,
	|
	|		Таблица.ПодотчетноеЛицо КАК ДенежныеСредства,
	|		Значение(Перечисление.ТипыДенежныхСредств.ДенежныеСредстваУПодотчетногоЛица) КАК ТипДенежныхСредств,
	|		Таблица.Валюта КАК Валюта,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|		КОНЕЦ КАК АналитикаРасходов,
	|
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|
	|		Таблица.ПодотчетноеЛицо КАК ИсточникГФУДенежныхСредств,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК ИсточникГФУДоходовРасходов
	|	
	|	ИЗ
	|		ТаблицаДенежныеСредстваУПодотчетныхЛиц КАК Таблица
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		Таблица.СтатьяДвиженияДенежныхСредств,
	|
	|		Таблица.Контрагент КАК ДенежныеСредства,
	|		Значение(Перечисление.ТипыДенежныхСредств.ДенежныеСредстваВПути) КАК ТипДенежныхСредств,
	|		Таблица.Валюта КАК Валюта,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|		КОНЕЦ КАК АналитикаРасходов,
	|
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|
	|		Таблица.Получатель КАК ИсточникГФУДенежныхСредств,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК ИсточникГФУДоходовРасходов
	|	
	|	ИЗ
	|		ТаблицаДенежныеСредстваВПути КАК Таблица
	//++ НЕ УТ
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток) 
	|		КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|
	|		Таблица.ДенежныйДокумент КАК ДенежныеСредства,
	|		Значение(Перечисление.ТипыДенежныхСредств.ДенежныеДокументы) КАК ТипДенежныхСредств,
	|		Таблица.ДенежныйДокумент.Валюта КАК Валюта,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|		КОНЕЦ КАК АналитикаРасходов,
	|
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|
	|		Таблица.ДенежныйДокумент КАК ИсточникГФУДенежныхСредств,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК ИсточникГФУДоходовРасходов
	|	
	|	ИЗ
	|		ТаблицаДенежныеДокументы КАК Таблица
	//-- НЕ УТ
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДепозитыПрибыль)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДепозитыУбыток)
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток) 
	|		КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|
	|		Таблица.Договор КАК ДенежныеСредства,
	|		Значение(Перечисление.ТипыДенежныхСредств.Депозиты) КАК ТипДенежныхСредств,
	|		Таблица.Валюта КАК Валюта,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.КредитыИДепозиты)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.КредитыИДепозиты)
	|		КОНЕЦ КАК АналитикаРасходов,
	|
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|
	|		Таблица.Договор КАК ИсточникГФУДенежныхСредств,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК ИсточникГФУДоходовРасходов
	|	
	|	ИЗ
	|		ТаблицаКредитыИДепозиты КАК Таблица
	|	ГДЕ
	|		Таблица.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.Депозит)
	|	) КАК ВложенныйЗапрос
	|
	|ГДЕ
	|	&ИспользоватьУчетПрочихДоходовРасходов
	|	И &ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаКредитовИДепозитов))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.ХозяйственнаяОперация,
	|	ВложенныйЗапрос.СтатьяДвиженияДенежныхСредств,
	|	ВложенныйЗапрос.ДенежныеСредства,
	|	ВложенныйЗапрос.ТипДенежныхСредств,
	|	ВложенныйЗапрос.Валюта,
	|	ВложенныйЗапрос.СтатьяДоходовРасходов,
	|	ВложенныйЗапрос.АналитикаДоходов,
	|	ВложенныйЗапрос.АналитикаРасходов,
	|	ВложенныйЗапрос.ИсточникГФУДенежныхСредств,
	|	ВложенныйЗапрос.ИсточникГФУДоходовРасходов
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Период";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции
//++ НЕ УТ
Функция ТекстЗапросаТаблицаОтражениеДокументовВРеглУчете(ТекстыЗапроса, Регистры = Неопределено)

	ИмяРегистра = "ОтражениеДокументовВРеглУчете";
	
	Если Не ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	ДобавитьВременныеТаблицы(ТекстыЗапроса);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&КонецПериода КАК Период,
	|	&Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(ТаблицаПеридов.Период, ДЕНЬ) КАК ДатаОтражения
	|
	|ИЗ (
	|	ВЫБРАТЬ
	|		&КонецПериода КАК Период
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Таблица.Период КАК Период
	|	ИЗ
	|		ТаблицаДенежныеСредстваБезналичные КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаРегл <> 0
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Таблица.Период КАК Период
	|	ИЗ
	|		ТаблицаДенежныеСредстваНаличные КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаРегл <> 0
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Таблица.Период КАК Период
	|	ИЗ
	|		ТаблицаДенежныеСредстваВКассахККМ КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаРегл <> 0
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Таблица.Период КАК Период
	|	ИЗ
	|		ТаблицаДенежныеСредстваУПодотчетныхЛиц КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаРегл <> 0
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Таблица.Период КАК Период
	|	ИЗ
	|		ТаблицаКредитыИДепозиты КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаРегл <> 0
	|
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Таблица.Период КАК Период
	|	ИЗ
	|		ТаблицаДенежныеДокументы КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаРегл <> 0
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	// Курсовые разницы от расчетов с клиентами
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Таблица.Период КАК Период
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаРегл <> 0
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	// Курсовые разницы от расчетов с поставщиками
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Таблица.Период КАК Период
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаРегл <> 0
	|
	|	) КАК ТаблицаПеридов";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции
//-- НЕ УТ

#КонецОбласти

#Область РасчетКурсовыхРазниц

Процедура ВыполнитьРасчетКурсовыхРазниц(ДокументОбъект, АналитикаРасчета = Неопределено, ТолькоКассы = Ложь)
	
	ХозОперации = Перечисления.ХозяйственныеОперации;
	ИменаРегистров = Новый Массив;
	Если ДокументОбъект.ХозяйственнаяОперация = ХозОперации.ПереоценкаРасчетовСПоставщиками Тогда
		ИменаРегистров.Добавить("РасчетыСПоставщикамиПоДокументам");
		
	ИначеЕсли ДокументОбъект.ХозяйственнаяОперация = ХозОперации.ПереоценкаРасчетовСКлиентами Тогда
		ИменаРегистров.Добавить("РасчетыСКлиентамиПоДокументам");
		
	ИначеЕсли ТолькоКассы Тогда
		ИменаРегистров.Добавить("ДенежныеСредстваНаличные");
		
	ИначеЕсли ДокументОбъект.ХозяйственнаяОперация = ХозОперации.ПереоценкаДенежныхСредств Тогда
		ИменаРегистров.Добавить("ДенежныеСредстваБезналичные");
		ИменаРегистров.Добавить("ДенежныеСредстваНаличные");
		ИменаРегистров.Добавить("ДенежныеСредстваВКассахККМ");
		ИменаРегистров.Добавить("ДенежныеСредстваУПодотчетныхЛиц");
		ИменаРегистров.Добавить("ДенежныеСредстваВПути");
		//++ НЕ УТ
		ИменаРегистров.Добавить("ДенежныеДокументы");
		//-- НЕ УТ
		
	ИначеЕсли ДокументОбъект.ХозяйственнаяОперация = ХозОперации.ПереоценкаКредитовИДепозитов Тогда
		ИменаРегистров.Добавить("РасчетыПоДоговорамКредитовИДепозитов");
		
	КонецЕсли;

	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументОбъект.Ссылка);
	Если ЗначениеЗаполнено(АналитикаРасчета) Тогда
		КлючиОрганизации = КлючиОрганизации(ДокументОбъект.Организация, АналитикаРасчета);
		Запрос.УстановитьПараметр("АналитикаРасчета", КлючиОрганизации);
	КонецЕсли;
	Если ТолькоКассы Тогда
		Запрос.УстановитьПараметр("ПереоценкаКасс", Истина);
		Запрос.УстановитьПараметр("КассыОрганизации", АналитикаРасчета);// в АналитикеРасчета могут быть переданы Кассы
		Запрос.УстановитьПараметр("ПоВсемКассам", НЕ ЗначениеЗаполнено(АналитикаРасчета));
	КонецЕсли;
	
	Попытка
		НачатьТранзакцию();
		
		ПодготовитьНаборыЗаписейКРасчету(ДокументОбъект, ИменаРегистров, АналитикаРасчета);
		РассчитатьКурсовыеРазницы(Запрос.Параметры);
		ДокументОбъект.ДополнительныеСвойства.Вставить("ВыполненРасчет", Истина);
		
		ЗафиксироватьТранзакцию();
	Исключение
		
		ТекстСообщения = НСтр("ru='Не удалось выполнить расчет курсовых разниц по причине: %Причина%';uk='Не вдалося виконати розрахунок курсових різниць по причині: %Причина%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(
			НСтр("ru='Расчет курсовых разниц';uk='Розрахунок курсових різниць'"),
			УровеньЖурналаРегистрации.Ошибка,
			ДокументОбъект.Ссылка.Метаданные(),
			ДокументОбъект.Ссылка,
			ТекстСообщения);
			
		ОтменитьТранзакцию();
	КонецПопытки;
	
КонецПроцедуры

Процедура РассчитатьКурсовыеРазницы(Параметры)
	
	ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(НСтр("ru='Расчет курсовых разниц';uk='Розрахунок курсових різниць'"), Параметры.ХозяйственнаяОперация, Параметры.ПереоценкаКасс);
	
	НачалоРасчета = ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремениТехнологический("РасчетКурсовыхРазниц");
	
	Запрос = ИнициализироватьЗапросКурсовыхРазниц(Параметры);
	
	// Определим дни в которые необходимо переоценить остатки
	Начало = ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремениТехнологический("ПолучениеДнейПереоценки");
	ДниПереоценки = ДниПереоценки(Параметры);
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремениТехнологический("ПолучениеДнейПереоценки",Начало);
	
	НачалоЦикла = ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремениТехнологический("ЦиклПоДнямПереоценки");
	Для Каждого День Из ДниПереоценки Цикл
		
		Запрос.УстановитьПараметр("НачалоПериода", День.Дата);
		Запрос.УстановитьПараметр("КонецПериода" , КонецДня(День.Дата));
		Запрос.УстановитьПараметр("ГраницаНачалоПериода", Новый Граница(День.Дата, ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ГраницаКонецПериода" , Новый Граница(КонецДня(День.Дата), ВидГраницы.Включая));
		Начало = ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремениТехнологический("ВыполнениеЗапросаКурсовыхРазниц");
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремениТехнологический("ВыполнениеЗапросаКурсовыхРазниц",Начало);
		
		Если Параметры.ПереоценкаКасс Тогда
			
			Начало = ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремениТехнологический("ЗаписьКурсовыхРазницПоДенежнымСредствам");
			ЗаписатьДвижения(Параметры.Ссылка, РезультатЗапроса, "ДенежныеСредстваНаличные",        3);
			ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремениТехнологический("ЗаписьКурсовыхРазницПоДенежнымСредствам",Начало);
		
		ИначеЕсли Параметры.ПереоценкаДС Тогда
			
			Начало = ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремениТехнологический("ЗаписьКурсовыхРазницПоДенежнымСредствам");
			ЗаписатьДвижения(Параметры.Ссылка, РезультатЗапроса, "ДенежныеСредстваБезналичные",     3);
			ЗаписатьДвижения(Параметры.Ссылка, РезультатЗапроса, "ДенежныеСредстваНаличные",        7);
			ЗаписатьДвижения(Параметры.Ссылка, РезультатЗапроса, "ДенежныеСредстваВКассахККМ",      11);
			ЗаписатьДвижения(Параметры.Ссылка, РезультатЗапроса, "ДенежныеСредстваВПути",           15);
			ЗаписатьДвижения(Параметры.Ссылка, РезультатЗапроса, "ДенежныеСредстваУПодотчетныхЛиц", 19);
			//++ НЕ УТ
			ЗаписатьДвижения(Параметры.Ссылка, РезультатЗапроса, "ДенежныеДокументы",               23);
			//-- НЕ УТ
			ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремениТехнологический("ЗаписьКурсовыхРазницПоДенежнымСредствам",Начало);
			
		ИначеЕсли Параметры.ПереоценкаКредитовИДепозитов Тогда
			Начало = ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремениТехнологический("ЗаписьКурсовыхРазницПоКредитамДепозитамЗаймам");
			ЗаписатьДвижения(Параметры.Ссылка, РезультатЗапроса, "РасчетыПоДоговорамКредитовИДепозитов", 3);
			ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремениТехнологический("ЗаписьКурсовыхРазницПоКредитамДепозитамЗаймам",Начало);
			
		ИначеЕсли Параметры.ПереоценкаРасчетовСПоставщиками Тогда
			Начало = ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремениТехнологический("ЗаписьКурсовыхРазницПоРасчетамСПоставщиками");
			ЗаписатьДвижения(Параметры.Ссылка, РезультатЗапроса, "РасчетыСПоставщикамиПоДокументам");
			ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремениТехнологический("ЗаписьКурсовыхРазницПоРасчетамСПоставщиками",Начало);
			
		ИначеЕсли Параметры.ПереоценкаРасчетовСКлиентами Тогда
			Начало = ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремениТехнологический("ЗаписьКурсовыхРазницПоРасчетамСКлиентами");
			ЗаписатьДвижения(Параметры.Ссылка, РезультатЗапроса, "РасчетыСКлиентамиПоДокументам");
			ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремениТехнологический("ЗаписьКурсовыхРазницПоРасчетамСКлиентами",Начало);
			
		КонецЕсли;
		
	КонецЦикла;
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремениТехнологический("ЦиклПоДнямПереоценки",НачалоЦикла);
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремениТехнологический("РасчетКурсовыхРазниц",НачалоРасчета);
	
КонецПроцедуры

// определяет дни в которые необходимо переоценить текущие остатки для заданной хоз. операции:
// - для переоценки "На дату оплаты и на конец месяца" - дни в которые были оплаты в валюте и последнее число месяца
// - для переоценки "На каждый день месяца" - дни в которые были оплаты в валюте и дни в которые менялся курс
//
// Параметры:
//  <Параметры>  - структура с обязательными ключами:
//                 НачалоПериода - <Дата> - задает начало периода поиска дат переоценки
//                 КонецПериода - <Дата> - задает конец периода поиска дат переоценки
//                 Организация - <Справочник.Организации> - организация по которой необходимо переоценивать остатки
//                 ХозяйственнаяОперация - <Перечисление.ХозяйственныеОперации> - задает регистр накопления о которому определяются даты оплаты
//                 АналитикаРасчета - <Массив> - ключи аналитики организации по которой необходимо переоценивать остатки
//
// Возвращаемое значение:
//   <ТаблицаЗначений> - с одной колонкой "Дата" типа <Дата>
//
Функция ДниПереоценки(Параметры)
	
	ОбъединитьВсе = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|";
	
	ТекстЗапроса = "";
	Если Параметры.ПереоценкаРасчетовСПоставщиками Тогда
		ТекстЗапроса = ТекстЗапроса +
		"// Операции с поставщиками в валюте
		|ВЫБРАТЬ
		|	Расчеты.Валюта,
		|	Расчеты.Период
		|ПОМЕСТИТЬ втОборотыВалюты
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК Расчеты
		|ГДЕ
		|	Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (Расчеты.Валюта <> &ВалютаУправленческогоУчета ИЛИ Расчеты.Валюта <> &ВалютаРегламентированногоУчета)
		|	И Расчеты.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
		|	И Расчеты.Долг <> 0
		|";
	КонецЕсли;
		
	Если Параметры.ПереоценкаРасчетовСКлиентами Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"// Операции с клиентами в валюте
		|ВЫБРАТЬ
		|	Расчеты.Валюта,
		|	Расчеты.Период
		|//ПОМЕСТИТЬ втОборотыВалюты
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК Расчеты
		|ГДЕ
		|	Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (Расчеты.Валюта <> &ВалютаУправленческогоУчета ИЛИ Расчеты.Валюта <> &ВалютаРегламентированногоУчета)
		|	И Расчеты.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
		|	И Расчеты.Долг <> 0
		|";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//ПОМЕСТИТЬ втОборотыВалюты",?(ПервыйЗапрос,"ПОМЕСТИТЬ втОборотыВалюты",""));
	КонецЕсли;
	
	Если Параметры.ПереоценкаДС И НЕ Параметры.ПереоценкаКасс Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"ВЫБРАТЬ
		|	БезналичныеДС.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта,
		|	БезналичныеДС.Период
		|//ПОМЕСТИТЬ втОборотыВалюты
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваБезналичные.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			Организация = &Организация
		|				И (БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
		|					ИЛИ БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
		|	) КАК БезналичныеДС
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НаличныеДС.Касса.ВалютаДенежныхСредств КАК Валюта,
		|	НаличныеДС.Период
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваНаличные.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			Организация = &Организация
		|				И (Касса.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
		|					ИЛИ Касса.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
		|	) КАК НаличныеДС
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДСвКассахККМ.КассаККМ.ВалютаДенежныхСредств КАК Валюта,
		|	ДСвКассахККМ.Период
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			Организация = &Организация
		|				И (КассаККМ.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
		|					ИЛИ КассаККМ.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
		|	) КАК ДСвКассахККМ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДСвПути.Валюта КАК Валюта,
		|	ДСвПути.Период
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВПути.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			Организация = &Организация
		|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
		|	) КАК ДСвПути
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДСуПодотчетныхЛиц.Валюта КАК Валюта,
		|	ДСуПодотчетныхЛиц.Период
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			Организация = &Организация
		|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
		|	) КАК ДСуПодотчетныхЛиц
		//++ НЕ УТ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДенежныеДокументы.ДенежныйДокумент.Валюта КАК Валюта,
		|	ДенежныеДокументы.Период
		|ИЗ
		|	РегистрНакопления.ДенежныеДокументы.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			Организация = &Организация
		|				И (ДенежныйДокумент.Валюта <> &ВалютаУправленческогоУчета
		|					ИЛИ ДенежныйДокумент.Валюта <> &ВалютаРегламентированногоУчета)
		|	) КАК ДенежныеДокументы
		//-- НЕ УТ
		|";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//ПОМЕСТИТЬ втОборотыВалюты",?(ПервыйЗапрос,"ПОМЕСТИТЬ втОборотыВалюты",""));
	КонецЕсли;
	
	Если Параметры.ПереоценкаКасс Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"ВЫБРАТЬ
		|	НаличныеДС.Касса.ВалютаДенежныхСредств КАК Валюта,
		|	НаличныеДС.Период
		|//ПОМЕСТИТЬ втОборотыВалюты
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваНаличные.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			Организация = &Организация
		|				И Касса В (&АналитикаРасчета)
		|				И (Касса.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
		|					ИЛИ Касса.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
		|	) КАК НаличныеДС
		|";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//ПОМЕСТИТЬ втОборотыВалюты",?(ПервыйЗапрос,"ПОМЕСТИТЬ втОборотыВалюты",""));
	КонецЕсли;
	
	Если Параметры.ПереоценкаКредитовИДепозитов Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"ВЫБРАТЬ
		|	РасчетыПоКредитамДепозитам.Договор.ВалютаВзаиморасчетов КАК Валюта,
		|	РасчетыПоКредитамДепозитам.Период
		|//ПОМЕСТИТЬ втОборотыВалюты
		|ИЗ
		|	РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			АналитикаУчетаПоПартнерам.Организация = &Организация
		|				И (Договор.ВалютаВзаиморасчетов <> &ВалютаУправленческогоУчета
		|					ИЛИ Договор.ВалютаВзаиморасчетов <> &ВалютаРегламентированногоУчета)
		|				И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаКредитовИДепозитов)
		|	) КАК РасчетыПоКредитамДепозитам";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//ПОМЕСТИТЬ втОборотыВалюты",?(ПервыйЗапрос,"ПОМЕСТИТЬ втОборотыВалюты",""));
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + 
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(втОборотыВалюты.Период, ДЕНЬ) КАК Дата
	|ИЗ
	|	втОборотыВалюты КАК втОборотыВалюты
	|
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Для Каждого Параметр Из Параметры Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	Запрос.УстановитьПараметр("ГраницаНачалоПериода", Новый Граница(Параметры.НачалоПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ГраницаКонецПериода",  Новый Граница(Параметры.КонецПериода,  ВидГраницы.Включая));
	
	Выборка = Запрос.Выполнить().Выгрузить();
	Возврат Выборка;
	
КонецФункции

Функция ИнициализироватьЗапросКурсовыхРазниц(Параметры)
	
	Если Параметры.ПереоценкаКасс Тогда
		ТекстЗапроса = ТекстЗапросаКурсовыеРазницыПоНаличнымДС(Параметры.ХозяйственнаяОперация);
		
	Иначе
		ТекстЗапроса = ТекстЗапросаКурсовыеРазницыРасчетамСПоставщиками(Параметры.ХозяйственнаяОперация)
			+ ТекстЗапросаКурсовыеРазницыПоРасчетамСКлиентами(Параметры.ХозяйственнаяОперация)
			+ ТекстЗапросаКурсовыеРазницыПоБезналичнымДС(Параметры.ХозяйственнаяОперация)
			+ ТекстЗапросаКурсовыеРазницыПоНаличнымДС(Параметры.ХозяйственнаяОперация)
			+ ТекстЗапросаКурсовыеРазницыВКассахККМ(Параметры.ХозяйственнаяОперация)
			+ ТекстЗапросаКурсовыеРазницыВПути(Параметры.ХозяйственнаяОперация)
			+ ТекстЗапросаКурсовыеРазницыПоПодотчетникам(Параметры.ХозяйственнаяОперация)
			+ ТекстЗапросаКурсовыеРазницыПоКредитамИДепозитам(Параметры.ХозяйственнаяОперация);
		//++ НЕ УТ
		ТекстЗапроса = ТекстЗапроса + ТекстЗапросаКурсовыеРазницыПоДенежнымДокументам(Параметры.ХозяйственнаяОперация);
		//-- НЕ УТ
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Для Каждого Параметр Из Параметры Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	Возврат Запрос;
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыРасчетамСПоставщиками(ХозяйственнаяОперация)
	
	Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"// Оплаты поставщикам в валюте за день
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.АналитикаУчетаПоПартнерам КАК КлючАналитики,
	|	Расчеты.ЗаказПоставщику КАК ОбъектРасчетов
	|ПОМЕСТИТЬ втАналитикаЗаДень
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК Расчеты
	|ГДЕ
	|	Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (Расчеты.Валюта <> &ВалютаУправленческогоУчета ИЛИ Расчеты.Валюта <> &ВалютаРегламентированногоУчета)
	|	И Расчеты.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|	И Расчеты.Долг <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ОстаткиДня.АналитикаУчетаПоПартнерам,
	|	ОстаткиДня.ЗаказПоставщику КАК Заказ,
	|	ОстаткиДня.РасчетныйДокумент,
	|	ОстаткиДня.ДолгОстаток КАК Долг,
	|	ОстаткиДня.ДолгРеглОстаток КАК ДолгРегл,
	|	ОстаткиДня.ДолгУпрОстаток КАК ДолгУпр,
	|	0 КАК ПредоплатаРегл,
	|	0 КАК ПредоплатаУпр,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ПОМЕСТИТЬ втОстакиНаКонецДня
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|	ЛЕВОЕ СОЕДИНЕНИЕ втАналитикаЗаДень КАК АналитикаДня
	|		ПО ОстаткиДня.АналитикаУчетаПоПартнерам = АналитикаДня.КлючАналитики
	|			И ОстаткиДня.ЗаказПоставщику = АналитикаДня.ОбъектРасчетов
	|ГДЕ
	|	ОстаткиДня.ДолгОстаток <> 0
	|	И (НЕ АналитикаДня.КлючАналитики ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта,
	|	&КонецПериода,
	|	ОстаткиДня.АналитикаУчетаПоПартнерам,
	|	ОстаткиДня.ЗаказПоставщику,
	|	ОстаткиДня.РасчетныйДокумент,
	|	ОстаткиДня.ДолгОстаток,
	|	ОстаткиДня.ДолгРеглОстаток,
	|	ОстаткиДня.ДолгУпрОстаток,
	|	0,
	|	0,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|	ЛЕВОЕ СОЕДИНЕНИЕ втАналитикаЗаДень КАК АналитикаДня
	|		ПО ОстаткиДня.АналитикаУчетаПоПартнерам = АналитикаДня.КлючАналитики
	|			И ОстаткиДня.ЗаказПоставщику = АналитикаДня.ОбъектРасчетов
	|ГДЕ
	|	ОстаткиДня.ДолгОстаток = 0
	|	И (ОстаткиДня.ДолгРеглОстаток <> 0 ИЛИ ОстаткиДня.ДолгУпрОстаток <> 0)
	|	И (НЕ АналитикаДня.КлючАналитики ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта,
	|	&КонецПериода,
	|	ОстаткиДня.АналитикаУчетаПоПартнерам,
	|	ОстаткиДня.ЗаказПоставщику,
	|	ОстаткиДня.РасчетныйДокумент,
	|	0,
	|	0,
	|	0,
	|	ОстаткиДня.ПредоплатаРеглОстаток,
	|	ОстаткиДня.ПредоплатаУпрОстаток,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|ГДЕ
	|	ОстаткиДня.КВозвратуОстаток = 0
	|	И ОстаткиДня.ПредоплатаОстаток = 0
	|	И (ОстаткиДня.ПредоплатаРеглОстаток <> 0 ИЛИ ОстаткиДня.ПредоплатаУпрОстаток <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ КАК Заказ,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	(ВЫРАЗИТЬ(Остатки.Долг * КурсВалюты.Курс / КурсВалюты.Кратность КАК ЧИСЛО(15, 2))) - Остатки.ДолгРегл КАК ДолгРегл,
	|	(ВЫРАЗИТЬ(Остатки.Долг * КурсВалюты.Курс / КурсВалюты.Кратность / КурсВалютыУпр.Курс * КурсВалютыУпр.Кратность КАК ЧИСЛО(15, 2))) - Остатки.ДолгУпр КАК ДолгУпр,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|
	|ПОМЕСТИТЬ втНеРеализованныеКР
	|ИЗ
	|	втОстакиНаКонецДня КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, ) КАК КурсВалюты
	|			ПО Остатки.Валюта = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, Валюта = &ВалютаУправленческогоУчета) КАК КурсВалютыУпр
	|			ПО (ИСТИНА)
	|ГДЕ
	|	Остатки.Долг <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.ДолгРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ КАК ЗаказПоставщику,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ВЫБОР КОГДА Остатки.ДолгРегл < 0
	|		ТОГДА -Остатки.ДолгРегл
	|		ИНАЧЕ Остатки.ДолгРегл
	|	КОНЕЦ КАК ДолгРегл,
	|	0 КАК ДолгУпр,
	|	0 КАК ПредоплатаРегл,
	|	0 КАК ПредоплатаУпр,
	|	Остатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ПОМЕСТИТЬ ТаблицаРасчетов
	|ИЗ
	|	втОстакиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.Долг = 0 И Остатки.ДолгРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ДолгУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгУпр < 0
	|		ТОГДА -Остатки.ДолгУпр
	|		ИНАЧЕ Остатки.ДолгУпр
	|	КОНЕЦ,
	|	0,
	|	0,
	|	Остатки.ХозяйственнаяОперация
	|ИЗ
	|	втОстакиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.Долг = 0 И Остатки.ДолгУпр <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ПредоплатаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ПредоплатаРегл < 0
	|		ТОГДА -Остатки.ПредоплатаРегл
	|		ИНАЧЕ Остатки.ПредоплатаРегл
	|	КОНЕЦ,
	|	0,
	|	Остатки.ХозяйственнаяОперация
	|ИЗ
	|	втОстакиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.ПредоплатаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ПредоплатаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ПредоплатаУпр < 0
	|		ТОГДА -Остатки.ПредоплатаУпр
	|		ИНАЧЕ Остатки.ПредоплатаУпр
	|	КОНЕЦ,
	|	Остатки.ХозяйственнаяОперация
	|ИЗ
	|	втОстакиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.ПредоплатаУпр <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР
	|		КОГДА Остатки.ДолгРегл < 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	ВЫБОР КОГДА Остатки.ДолгРегл < 0
	|		ТОГДА -Остатки.ДолгРегл
	|		ИНАЧЕ Остатки.ДолгРегл
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	Остатки.ХозяйственнаяОперация
	|ИЗ
	|	втНеРеализованныеКР КАК Остатки
	|ГДЕ
	|	Остатки.ДолгРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ДолгУпр < 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгУпр < 0
	|		ТОГДА -Остатки.ДолгУпр
	|		ИНАЧЕ Остатки.ДолгУпр
	|	КОНЕЦ,
	|	0,
	|	0,
	|	Остатки.ХозяйственнаяОперация
	|ИЗ
	|	втНеРеализованныеКР КАК Остатки
	|ГДЕ
	|	Остатки.ДолгУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРасчетов.Валюта,
	|	ТаблицаРасчетов.ВидДвижения,
	|	ТаблицаРасчетов.Период КАК Период,
	|	ТаблицаРасчетов.АналитикаУчетаПоПартнерам,
	|	ТаблицаРасчетов.ЗаказПоставщику,
	|	ТаблицаРасчетов.РасчетныйДокумент,
	|	СУММА(ТаблицаРасчетов.ДолгРегл) КАК ДолгРегл,
	|	СУММА(ТаблицаРасчетов.ДолгУпр) КАК ДолгУпр,
	|	СУММА(ТаблицаРасчетов.ПредоплатаРегл) КАК ПредоплатаРегл,
	|	СУММА(ТаблицаРасчетов.ПредоплатаУпр) КАК ПредоплатаУпр,
	|	ТаблицаРасчетов.ХозяйственнаяОперация
	|ИЗ
	|	ТаблицаРасчетов КАК ТаблицаРасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасчетов.Период,
	|	ТаблицаРасчетов.ХозяйственнаяОперация,
	|	ТаблицаРасчетов.АналитикаУчетаПоПартнерам,
	|	ТаблицаРасчетов.РасчетныйДокумент,
	|	ТаблицаРасчетов.ЗаказПоставщику,
	|	ТаблицаРасчетов.Валюта,
	|	ТаблицаРасчетов.ВидДвижения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период"
	+"
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыПоРасчетамСКлиентами(ХозяйственнаяОперация)
	
	Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"// Оплаты клиентов в валюте за день
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.АналитикаУчетаПоПартнерам КАК КлючАналитики,
	|	Расчеты.ЗаказКлиента КАК ОбъектРасчетов
	|ПОМЕСТИТЬ втАналитикаЗаДень
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК Расчеты
	|ГДЕ
	|	Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (Расчеты.Валюта <> &ВалютаУправленческогоУчета ИЛИ Расчеты.Валюта <> &ВалютаРегламентированногоУчета)
	|	И Расчеты.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|	И Расчеты.Долг <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ОстаткиДня.АналитикаУчетаПоПартнерам,
	|	ОстаткиДня.ЗаказКлиента КАК Заказ,
	|	ОстаткиДня.РасчетныйДокумент,
	|	ОстаткиДня.ДолгОстаток КАК Долг,
	|	ОстаткиДня.ДолгРеглОстаток КАК ДолгРегл,
	|	ОстаткиДня.ДолгУпрОстаток КАК ДолгУпр,
	|	0 КАК ПредоплатаРегл,
	|	0 КАК ПредоплатаУпр,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ПОМЕСТИТЬ втОстакиНаКонецДня
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|	ЛЕВОЕ СОЕДИНЕНИЕ втАналитикаЗаДень КАК АналитикаДня
	|		ПО ОстаткиДня.АналитикаУчетаПоПартнерам = АналитикаДня.КлючАналитики
	|		И ОстаткиДня.ЗаказКлиента = АналитикаДня.ОбъектРасчетов
	|ГДЕ
	|	ОстаткиДня.ДолгОстаток <> 0
	|	И (НЕ АналитикаДня.КлючАналитики ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта,
	|	&КонецПериода,
	|	ОстаткиДня.АналитикаУчетаПоПартнерам,
	|	ОстаткиДня.ЗаказКлиента,
	|	ОстаткиДня.РасчетныйДокумент,
	|	ОстаткиДня.ДолгОстаток,
	|	ОстаткиДня.ДолгРеглОстаток,
	|	ОстаткиДня.ДолгУпрОстаток,
	|	0,
	|	0,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|	ЛЕВОЕ СОЕДИНЕНИЕ втАналитикаЗаДень КАК АналитикаДня
	|		ПО ОстаткиДня.АналитикаУчетаПоПартнерам = АналитикаДня.КлючАналитики
	|			И ОстаткиДня.ЗаказКлиента = АналитикаДня.ОбъектРасчетов
	|ГДЕ
	|	ОстаткиДня.ДолгОстаток = 0
	|	И (ОстаткиДня.ДолгРеглОстаток <> 0 ИЛИ ОстаткиДня.ДолгУпрОстаток <> 0)
	|	И (НЕ АналитикаДня.КлючАналитики ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта,
	|	&КонецПериода,
	|	ОстаткиДня.АналитикаУчетаПоПартнерам,
	|	ОстаткиДня.ЗаказКлиента,
	|	ОстаткиДня.РасчетныйДокумент,
	|	0,
	|	0,
	|	0,
	|	ОстаткиДня.ПредоплатаРеглОстаток,
	|	ОстаткиДня.ПредоплатаУпрОстаток,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|ГДЕ
	|	ОстаткиДня.КВозвратуОстаток = 0
	|	И ОстаткиДня.ПредоплатаОстаток = 0
	|	И (ОстаткиДня.ПредоплатаРеглОстаток <> 0 ИЛИ ОстаткиДня.ПредоплатаУпрОстаток <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ КАК Заказ,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	(ВЫРАЗИТЬ(Остатки.Долг * КурсВалюты.Курс / КурсВалюты.Кратность КАК ЧИСЛО(15, 2))) - Остатки.ДолгРегл КАК ДолгРегл,
	|	(ВЫРАЗИТЬ(Остатки.Долг * КурсВалюты.Курс / КурсВалюты.Кратность / КурсВалютыУпр.Курс * КурсВалютыУпр.Кратность КАК ЧИСЛО(15, 2))) - Остатки.ДолгУпр КАК ДолгУпр,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ПОМЕСТИТЬ втНеРеализованныеКР
	|ИЗ
	|	втОстакиНаКонецДня КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, ) КАК КурсВалюты
	|			ПО Остатки.Валюта = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, Валюта = &ВалютаУправленческогоУчета) КАК КурсВалютыУпр
	|			ПО (ИСТИНА)
	|ГДЕ
	|	Остатки.Долг <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.ДолгРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ КАК ЗаказКлиента,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ВЫБОР КОГДА Остатки.ДолгРегл < 0
	|		ТОГДА -Остатки.ДолгРегл
	|		ИНАЧЕ Остатки.ДолгРегл
	|	КОНЕЦ КАК ДолгРегл,
	|	0 КАК ДолгУпр,
	|	0 КАК ПредоплатаРегл,
	|	0 КАК ПредоплатаУпр,
	|	Остатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ПОМЕСТИТЬ ТаблицаРасчетов
	|ИЗ
	|	втОстакиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.Долг = 0 И Остатки.ДолгРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ДолгУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгУпр < 0
	|		ТОГДА -Остатки.ДолгУпр
	|		ИНАЧЕ Остатки.ДолгУпр
	|	КОНЕЦ,
	|	0,
	|	0,
	|	Остатки.ХозяйственнаяОперация
	|ИЗ
	|	втОстакиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.Долг = 0 И Остатки.ДолгУпр <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ПредоплатаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ПредоплатаРегл < 0
	|		ТОГДА -Остатки.ПредоплатаРегл
	|		ИНАЧЕ Остатки.ПредоплатаРегл
	|	КОНЕЦ,
	|	0,
	|	Остатки.ХозяйственнаяОперация
	|ИЗ
	|	втОстакиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.ПредоплатаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ПредоплатаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ПредоплатаУпр < 0
	|		ТОГДА -Остатки.ПредоплатаУпр
	|		ИНАЧЕ Остатки.ПредоплатаУпр
	|	КОНЕЦ,
	|	Остатки.ХозяйственнаяОперация
	|ИЗ
	|	втОстакиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.ПредоплатаУпр <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР
	|		КОГДА Остатки.ДолгРегл < 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	ВЫБОР КОГДА Остатки.ДолгРегл < 0
	|		ТОГДА -Остатки.ДолгРегл
	|		ИНАЧЕ Остатки.ДолгРегл
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	Остатки.ХозяйственнаяОперация
	|ИЗ
	|	втНеРеализованныеКР КАК Остатки
	|ГДЕ
	|	Остатки.ДолгРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ДолгУпр < 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгУпр < 0
	|		ТОГДА -Остатки.ДолгУпр
	|		ИНАЧЕ Остатки.ДолгУпр
	|	КОНЕЦ,
	|	0,
	|	0,
	|	Остатки.ХозяйственнаяОперация
	|ИЗ
	|	втНеРеализованныеКР КАК Остатки
	|ГДЕ
	|	Остатки.ДолгУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРасчетов.Валюта,
	|	ТаблицаРасчетов.ВидДвижения,
	|	ТаблицаРасчетов.Период КАК Период,
	|	ТаблицаРасчетов.АналитикаУчетаПоПартнерам,
	|	ТаблицаРасчетов.ЗаказКлиента,
	|	ТаблицаРасчетов.РасчетныйДокумент,
	|	СУММА(ТаблицаРасчетов.ДолгРегл) КАК ДолгРегл,
	|	СУММА(ТаблицаРасчетов.ДолгУпр) КАК ДолгУпр,
	|	СУММА(ТаблицаРасчетов.ПредоплатаРегл) КАК ПредоплатаРегл,
	|	СУММА(ТаблицаРасчетов.ПредоплатаУпр) КАК ПредоплатаУпр,
	|	ТаблицаРасчетов.ХозяйственнаяОперация
	|ИЗ
	|	ТаблицаРасчетов КАК ТаблицаРасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасчетов.Период,
	|	ТаблицаРасчетов.ХозяйственнаяОперация,
	|	ТаблицаРасчетов.АналитикаУчетаПоПартнерам,
	|	ТаблицаРасчетов.РасчетныйДокумент,
	|	ТаблицаРасчетов.ЗаказКлиента,
	|	ТаблицаРасчетов.Валюта,
	|	ТаблицаРасчетов.ВидДвижения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период"
	+"
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыПоБезналичнымДС(ХозяйственнаяОперация)
	
	Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыЗаДень.БанковскийСчет КАК Счет
	|ПОМЕСТИТЬ СчетаЗаДень
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные.Обороты(
	|			&ГраницаНачалоПериода,
	|			&ГраницаКонецПериода,
	|			,
	|			Организация = &Организация
	|			И (БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|					ИЛИ БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОборотыЗаДень
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.БанковскийСчет КАК БанковскийСчет,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность КАК ЧИСЛО(15, 2))) - ОстаткиНаДень.СуммаРеглОстаток КАК СуммаРегл,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность / КурсВалютыУпр.Курс * КурсВалютыУпр.Кратность КАК ЧИСЛО(15, 2))) - ОстаткиНаДень.СуммаУпрОстаток КАК СуммаУпр,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|
	|ПОМЕСТИТЬ втОстакиБезналичных
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|				И (БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|					ИЛИ БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаЗаДень
	|		ПО ОстаткиНаДень.БанковскийСчет = СчетаЗаДень.Счет
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, ) КАК КурсВалюты
	|		ПО ОстаткиНаДень.БанковскийСчет.ВалютаДенежныхСредств = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, Валюта = &ВалютаУправленческогоУчета) КАК КурсВалютыУпр
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток <> 0
	|	И (НЕ СчетаЗаДень.Счет ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И ((ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность КАК ЧИСЛО(15, 2))) - ОстаткиНаДень.СуммаРеглОстаток <> 0
	|			ИЛИ (ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность / КурсВалютыУпр.Курс * КурсВалютыУпр.Кратность КАК ЧИСЛО(15, 2))) - ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.БанковскийСчет.ВалютаДенежныхСредств,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	|	ОстаткиНаДень.Организация,
	|	ОстаткиНаДень.БанковскийСчет,
	|	-ОстаткиНаДень.СуммаРеглОстаток,
	|	-ОстаткиНаДень.СуммаУпрОстаток,
	|	&ХозяйственнаяОперация
	|
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|				И (БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|					ИЛИ БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаЗаДень
	|		ПО ОстаткиНаДень.БанковскийСчет = СчетаЗаДень.Счет
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток = 0
	|	И (НЕ СчетаЗаДень.Счет ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ОстаткиНаДень.СуммаРеглОстаток <> 0 ИЛИ ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.БанковскийСчет КАК БанковскийСчет,
	|	ВЫБОР КОГДА Остатки.СуммаРегл < 0
	|		ТОГДА -Остатки.СуммаРегл
	|		ИНАЧЕ Остатки.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	Остатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств
	|ПОМЕСТИТЬ ТаблицаБезналичныхДС
	|ИЗ
	|	втОстакиБезналичных КАК Остатки
	|ГДЕ
	|	Остатки.СуммаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.Организация,
	|	Остатки.БанковскийСчет,
	|	0,
	|	ВЫБОР КОГДА Остатки.СуммаУпр < 0
	|		ТОГДА -Остатки.СуммаУпр
	|		ИНАЧЕ Остатки.СуммаУпр
	|	КОНЕЦ,
	|	Остатки.ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ
	|ИЗ
	|	втОстакиБезналичных КАК Остатки
	|ГДЕ
	|	Остатки.СуммаУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаБезналичныхДС.Валюта,
	|	ТаблицаБезналичныхДС.ВидДвижения,
	|	ТаблицаБезналичныхДС.Период КАК Период,
	|	ТаблицаБезналичныхДС.Организация,
	|	ТаблицаБезналичныхДС.БанковскийСчет,
	|	СУММА(ТаблицаБезналичныхДС.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаБезналичныхДС.СуммаУпр) КАК СуммаУпр,
	|	ТаблицаБезналичныхДС.ХозяйственнаяОперация,
	|	ТаблицаБезналичныхДС.СтатьяДвиженияДенежныхСредств
	|ИЗ
	|	ТаблицаБезналичныхДС КАК ТаблицаБезналичныхДС
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаБезналичныхДС.Валюта,
	|	ТаблицаБезналичныхДС.Период,
	|	ТаблицаБезналичныхДС.Организация,
	|	ТаблицаБезналичныхДС.БанковскийСчет,
	|	ТаблицаБезналичныхДС.ХозяйственнаяОперация,
	|	ТаблицаБезналичныхДС.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаБезналичныхДС.ВидДвижения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период"
	+"
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыПоНаличнымДС(ХозяйственнаяОперация)
	
	Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыЗаДень.Касса КАК Касса
	|ПОМЕСТИТЬ КассыЗаДень
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные.Обороты(
	|			&ГраницаНачалоПериода,
	|			&ГраницаКонецПериода,
	|			,
	|			Организация = &Организация
	|			И (Касса В (&КассыОрганизации) ИЛИ &ПоВсемКассам)
	|			И (Касса.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|					ИЛИ Касса.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОборотыЗаДень
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Касса.ВалютаДенежныхСредств КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.Касса КАК Касса,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность КАК ЧИСЛО(15, 2))) - ОстаткиНаДень.СуммаРеглОстаток КАК СуммаРегл,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность / КурсВалютыУпр.Курс * КурсВалютыУпр.Кратность КАК ЧИСЛО(15, 2))) - ОстаткиНаДень.СуммаУпрОстаток КАК СуммаУпр,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|
	|ПОМЕСТИТЬ втОстакиНаличных
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|			И (Касса В (&КассыОрганизации) ИЛИ &ПоВсемКассам)
	|			И (Касса.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|				ИЛИ Касса.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ КассыЗаДень
	|		ПО ОстаткиНаДень.Касса = КассыЗаДень.Касса
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, ) КАК КурсВалюты
	|		ПО ОстаткиНаДень.Касса.ВалютаДенежныхСредств = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, Валюта = &ВалютаУправленческогоУчета) КАК КурсВалютыУпр
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток <> 0
	|	И (НЕ КассыЗаДень.Касса ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И ((ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность КАК ЧИСЛО(15, 2))) - ОстаткиНаДень.СуммаРеглОстаток <> 0
	|			ИЛИ (ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность / КурсВалютыУпр.Курс * КурсВалютыУпр.Кратность КАК ЧИСЛО(15, 2))) - ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Касса.ВалютаДенежныхСредств,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	|	ОстаткиНаДень.Организация,
	|	ОстаткиНаДень.Касса,
	|	-ОстаткиНаДень.СуммаРеглОстаток,
	|	-ОстаткиНаДень.СуммаУпрОстаток,
	|	&ХозяйственнаяОперация
	|
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|			И (Касса В (&КассыОрганизации) ИЛИ &ПоВсемКассам)
	|			И (Касса.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|				ИЛИ Касса.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ КассыЗаДень
	|		ПО ОстаткиНаДень.Касса = КассыЗаДень.Касса
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток = 0
	|	И (НЕ КассыЗаДень.Касса ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ОстаткиНаДень.СуммаРеглОстаток <> 0 ИЛИ ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.Касса КАК Касса,
	|	ВЫБОР КОГДА Остатки.СуммаРегл < 0
	|		ТОГДА -Остатки.СуммаРегл
	|		ИНАЧЕ Остатки.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	Остатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств
	|ПОМЕСТИТЬ ТаблицаНаличныхДС
	|ИЗ
	|	втОстакиНаличных КАК Остатки
	|ГДЕ
	|	Остатки.СуммаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.Организация,
	|	Остатки.Касса,
	|	0,
	|	ВЫБОР КОГДА Остатки.СуммаУпр < 0
	|		ТОГДА -Остатки.СуммаУпр
	|		ИНАЧЕ Остатки.СуммаУпр
	|	КОНЕЦ,
	|	Остатки.ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ
	|ИЗ
	|	втОстакиНаличных КАК Остатки
	|ГДЕ
	|	Остатки.СуммаУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНаличныхДС.Валюта,
	|	ТаблицаНаличныхДС.ВидДвижения,
	|	ТаблицаНаличныхДС.Период КАК Период,
	|	ТаблицаНаличныхДС.Организация,
	|	ТаблицаНаличныхДС.Касса,
	|	СУММА(ТаблицаНаличныхДС.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаНаличныхДС.СуммаУпр) КАК СуммаУпр,
	|	ТаблицаНаличныхДС.ХозяйственнаяОперация,
	|	ТаблицаНаличныхДС.СтатьяДвиженияДенежныхСредств
	|ИЗ
	|	ТаблицаНаличныхДС КАК ТаблицаНаличныхДС
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНаличныхДС.Валюта,
	|	ТаблицаНаличныхДС.Период,
	|	ТаблицаНаличныхДС.Организация,
	|	ТаблицаНаличныхДС.Касса,
	|	ТаблицаНаличныхДС.ХозяйственнаяОперация,
	|	ТаблицаНаличныхДС.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаНаличныхДС.ВидДвижения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период"
	+"
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыВКассахККМ(ХозяйственнаяОперация)
	
	Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыЗаДень.КассаККМ КАК КассаККМ
	|ПОМЕСТИТЬ КассыККМЗаДень
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Обороты(
	|			&ГраницаНачалоПериода,
	|			&ГраницаКонецПериода,
	|			,
	|			Организация = &Организация
	|			И (КассаККМ.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|					ИЛИ КассаККМ.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОборотыЗаДень
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.КассаККМ.ВалютаДенежныхСредств КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.КассаККМ КАК Касса,
	|	ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность КАК ЧИСЛО(15,2)) - ОстаткиНаДень.СуммаРеглОстаток КАК СуммаРегл,
	|	ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность / КурсВалютыУпр.Курс * КурсВалютыУпр.Кратность КАК ЧИСЛО(15,2)) - ОстаткиНаДень.СуммаУпрОстаток КАК СуммаУпр,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|
	|ПОМЕСТИТЬ втОстакиВКассахККМ
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(
	|		&ГраницаКонецПериода,
	|		Организация = &Организация
	|			И (КассаККМ.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета 
	|				ИЛИ КассаККМ.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ КассыККМЗаДень
	|		ПО ОстаткиНаДень.КассаККМ = КассыККМЗаДень.КассаККМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, ) КАК КурсВалюты
	|		ПО ОстаткиНаДень.КассаККМ.ВалютаДенежныхСредств = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, Валюта = &ВалютаУправленческогоУчета) КАК КурсВалютыУпр
	|		ПО ИСТИНА
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток <> 0
	|	И (НЕ КассыККМЗаДень.КассаККМ ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность КАК ЧИСЛО(15,2)) - ОстаткиНаДень.СуммаРеглОстаток <> 0
	|		ИЛИ ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность / КурсВалютыУпр.Курс * КурсВалютыУпр.Кратность КАК ЧИСЛО(15,2)) - ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.КассаККМ.ВалютаДенежныхСредств,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	|	ОстаткиНаДень.Организация,
	|	ОстаткиНаДень.КассаККМ,
	|	-ОстаткиНаДень.СуммаРеглОстаток,
	|	-ОстаткиНаДень.СуммаУпрОстаток,
	|	&ХозяйственнаяОперация
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|				И (КассаККМ.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|					ИЛИ КассаККМ.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ КассыККМЗаДень
	|		ПО ОстаткиНаДень.КассаККМ = КассыККМЗаДень.КассаККМ
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток = 0
	|	И (НЕ КассыККМЗаДень.КассаККМ ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ОстаткиНаДень.СуммаРеглОстаток <> 0 ИЛИ ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.Касса КАК Касса,
	|	ВЫБОР КОГДА Остатки.СуммаРегл < 0
	|		ТОГДА -Остатки.СуммаРегл
	|		ИНАЧЕ Остатки.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	Остатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|
	|ПОМЕСТИТЬ ТаблицаДСВКассахККМ
	|ИЗ
	|	втОстакиВКассахККМ КАК Остатки
	|ГДЕ
	|	Остатки.СуммаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.Организация,
	|	Остатки.Касса,
	|	0,
	|	ВЫБОР КОГДА Остатки.СуммаУпр < 0
	|		ТОГДА -Остатки.СуммаУпр
	|		ИНАЧЕ Остатки.СуммаУпр
	|	КОНЕЦ,
	|	Остатки.ХозяйственнаяОперация
	|ИЗ
	|	втОстакиВКассахККМ КАК Остатки
	|ГДЕ
	|	Остатки.СуммаУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДСВКассахККМ.Валюта,
	|	ТаблицаДСВКассахККМ.ВидДвижения,
	|	ТаблицаДСВКассахККМ.Период КАК Период,
	|	ТаблицаДСВКассахККМ.Организация,
	|	ТаблицаДСВКассахККМ.Касса КАК КассаККМ,
	|	СУММА(ТаблицаДСВКассахККМ.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаДСВКассахККМ.СуммаУпр) КАК СуммаУпр,
	|	ТаблицаДСВКассахККМ.ХозяйственнаяОперация
	|ИЗ
	|	ТаблицаДСВКассахККМ КАК ТаблицаДСВКассахККМ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДСВКассахККМ.Валюта,
	|	ТаблицаДСВКассахККМ.Период,
	|	ТаблицаДСВКассахККМ.Организация,
	|	ТаблицаДСВКассахККМ.Касса,
	|	ТаблицаДСВКассахККМ.ХозяйственнаяОперация,
	|	ТаблицаДСВКассахККМ.ВидДвижения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период"
	+"
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыПоПодотчетникам(ХозяйственнаяОперация)
	
	Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыЗаДень.Валюта КАК Валюта,
	|	ОборотыЗаДень.Организация КАК Организация,
	|	ОборотыЗаДень.ПодотчетноеЛицо КАК ПодотчетноеЛицо,
	|	ОборотыЗаДень.ЦельВыдачи КАК ЦельВыдачи
	|
	|ПОМЕСТИТЬ ПодотчетникиЗаДень
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Обороты(
	|			&ГраницаНачалоПериода,
	|			&ГраницаКонецПериода,
	|			,
	|			Организация = &Организация
	|			И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОборотыЗаДень
	|ГДЕ
	|	ОборотыЗаДень.СуммаОборот <> 0
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.ПодотчетноеЛицо КАК ПодотчетноеЛицо,
	|	ОстаткиНаДень.ЦельВыдачи КАК ЦельВыдачи,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность КАК ЧИСЛО(15, 2))) - ОстаткиНаДень.СуммаРеглОстаток КАК СуммаРегл,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность / КурсВалютыУпр.Курс * КурсВалютыУпр.Кратность КАК ЧИСЛО(15, 2))) - ОстаткиНаДень.СуммаУпрОстаток КАК СуммаУпр,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|
	|ПОМЕСТИТЬ втОстакиУПодотчетныхЛиц
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПодотчетникиЗаДень
	|		ПО ОстаткиНаДень.Валюта = ПодотчетникиЗаДень.Валюта
	|			И ОстаткиНаДень.Валюта = ПодотчетникиЗаДень.Валюта
	|			И ОстаткиНаДень.Организация = ПодотчетникиЗаДень.Организация
	|			И ОстаткиНаДень.ПодотчетноеЛицо = ПодотчетникиЗаДень.ПодотчетноеЛицо
	|			И ОстаткиНаДень.ЦельВыдачи = ПодотчетникиЗаДень.ЦельВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, ) КАК КурсВалюты
	|		ПО ОстаткиНаДень.Валюта = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, Валюта = &ВалютаУправленческогоУчета) КАК КурсВалютыУпр
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток < 0
	|	И (НЕ ПодотчетникиЗаДень.ПодотчетноеЛицо ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И ((ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность КАК ЧИСЛО(15, 2))) - ОстаткиНаДень.СуммаРеглОстаток <> 0
	|			ИЛИ (ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность / КурсВалютыУпр.Курс * КурсВалютыУпр.Кратность КАК ЧИСЛО(15, 2))) - ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	|	ОстаткиНаДень.Организация,
	|	ОстаткиНаДень.ПодотчетноеЛицо,
	|	ОстаткиНаДень.ЦельВыдачи,
	|	-ОстаткиНаДень.СуммаРеглОстаток,
	|	-ОстаткиНаДень.СуммаУпрОстаток,
	|	&ХозяйственнаяОперация
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПодотчетникиЗаДень
	|		ПО ОстаткиНаДень.Валюта = ПодотчетникиЗаДень.Валюта
	|			И ОстаткиНаДень.Валюта = ПодотчетникиЗаДень.Валюта
	|			И ОстаткиНаДень.Организация = ПодотчетникиЗаДень.Организация
	|			И ОстаткиНаДень.ПодотчетноеЛицо = ПодотчетникиЗаДень.ПодотчетноеЛицо
	|			И ОстаткиНаДень.ЦельВыдачи = ПодотчетникиЗаДень.ЦельВыдачи
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток = 0
	|	И (НЕ ПодотчетникиЗаДень.ПодотчетноеЛицо ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ОстаткиНаДень.СуммаРеглОстаток <> 0 ИЛИ ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.ПодотчетноеЛицо КАК ПодотчетноеЛицо,
	|	Остатки.ЦельВыдачи КАК ЦельВыдачи,
	|	ВЫБОР КОГДА Остатки.СуммаРегл < 0
	|		ТОГДА -Остатки.СуммаРегл
	|		ИНАЧЕ Остатки.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	Остатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств
	|ПОМЕСТИТЬ ТаблицаДСУПодотчетныхЛиц
	|ИЗ
	|	втОстакиУПодотчетныхЛиц КАК Остатки
	|ГДЕ
	|	Остатки.СуммаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.Организация,
	|	Остатки.ПодотчетноеЛицо,
	|	Остатки.ЦельВыдачи,
	|	0,
	|	ВЫБОР КОГДА Остатки.СуммаУпр < 0
	|		ТОГДА -Остатки.СуммаУпр
	|		ИНАЧЕ Остатки.СуммаУпр
	|	КОНЕЦ,
	|	Остатки.ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ
	|ИЗ
	|	втОстакиУПодотчетныхЛиц КАК Остатки
	|ГДЕ
	|	Остатки.СуммаУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДСУПодотчетныхЛиц.Валюта,
	|	ТаблицаДСУПодотчетныхЛиц.ВидДвижения,
	|	ТаблицаДСУПодотчетныхЛиц.Период КАК Период,
	|	ТаблицаДСУПодотчетныхЛиц.Организация,
	|	ТаблицаДСУПодотчетныхЛиц.ПодотчетноеЛицо,
	|	ТаблицаДСУПодотчетныхЛиц.ЦельВыдачи,
	|	СУММА(ТаблицаДСУПодотчетныхЛиц.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаДСУПодотчетныхЛиц.СуммаУпр) КАК СуммаУпр,
	|	ТаблицаДСУПодотчетныхЛиц.ХозяйственнаяОперация,
	|	ТаблицаДСУПодотчетныхЛиц.СтатьяДвиженияДенежныхСредств
	|ИЗ
	|	ТаблицаДСУПодотчетныхЛиц КАК ТаблицаДСУПодотчетныхЛиц
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДСУПодотчетныхЛиц.Валюта,
	|	ТаблицаДСУПодотчетныхЛиц.Период,
	|	ТаблицаДСУПодотчетныхЛиц.Организация,
	|	ТаблицаДСУПодотчетныхЛиц.ПодотчетноеЛицо,
	|	ТаблицаДСУПодотчетныхЛиц.ЦельВыдачи,
	|	ТаблицаДСУПодотчетныхЛиц.ХозяйственнаяОперация,
	|	ТаблицаДСУПодотчетныхЛиц.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаДСУПодотчетныхЛиц.ВидДвижения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период"
	+"
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыВПути(ХозяйственнаяОперация)
	
	Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыЗаДень.Валюта КАК Валюта,
	|	ОборотыЗаДень.Организация КАК Организация,
	|	ОборотыЗаДень.Получатель КАК Получатель,
	|	ОборотыЗаДень.Отправитель КАК Отправитель,
	|	ОборотыЗаДень.ВидПереводаДенежныхСредств КАК ВидПеревода,
	|	ОборотыЗаДень.Контрагент КАК Контрагент
	|
	|ПОМЕСТИТЬ ДеньгиВПутиЗаДень
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути.Обороты(
	|			&ГраницаНачалоПериода,
	|			&ГраницаКонецПериода,
	|			,
	|			Организация = &Организация
	|			И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОборотыЗаДень
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.Получатель КАК Получатель,
	|	ОстаткиНаДень.Отправитель КАК Отправитель,
	|	ОстаткиНаДень.ВидПереводаДенежныхСредств КАК ВидПереводаДенежныхСредств,
	|	ОстаткиНаДень.Контрагент КАК Контрагент,
	|	ОстаткиНаДень.СуммаОстаток КАК Сумма,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность КАК ЧИСЛО(15, 2))) - ОстаткиНаДень.СуммаРеглОстаток КАК СуммаРегл,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность / КурсВалютыУпр.Курс * КурсВалютыУпр.Кратность КАК ЧИСЛО(15, 2))) - ОстаткиНаДень.СуммаУпрОстаток КАК СуммаУпр,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|
	|ПОМЕСТИТЬ втОстакиВПути
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДеньгиВПутиЗаДень
	|		ПО ОстаткиНаДень.Валюта = ДеньгиВПутиЗаДень.Валюта
	|			И ОстаткиНаДень.Валюта = ДеньгиВПутиЗаДень.Валюта
	|			И ОстаткиНаДень.Организация = ДеньгиВПутиЗаДень.Организация
	|			И ОстаткиНаДень.Получатель = ДеньгиВПутиЗаДень.Получатель
	|			И ОстаткиНаДень.Отправитель = ДеньгиВПутиЗаДень.Отправитель
	|			И ОстаткиНаДень.ВидПереводаДенежныхСредств = ДеньгиВПутиЗаДень.ВидПеревода
	|			И ОстаткиНаДень.Контрагент = ДеньгиВПутиЗаДень.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, ) КАК КурсВалюты
	|		ПО ОстаткиНаДень.Валюта = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, Валюта = &ВалютаУправленческогоУчета) КАК КурсВалютыУпр
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток <> 0
	|	И (НЕ ДеньгиВПутиЗаДень.Валюта ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И ((ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность КАК ЧИСЛО(15, 2))) - ОстаткиНаДень.СуммаРеглОстаток <> 0
	|			ИЛИ (ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность / КурсВалютыУпр.Курс * КурсВалютыУпр.Кратность КАК ЧИСЛО(15, 2))) - ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	|	ОстаткиНаДень.Организация,
	|	ОстаткиНаДень.Получатель,
	|	ОстаткиНаДень.Отправитель,
	|	ОстаткиНаДень.ВидПереводаДенежныхСредств,
	|	ОстаткиНаДень.Контрагент,
	|	-ОстаткиНаДень.СуммаОстаток,
	|	-ОстаткиНаДень.СуммаРеглОстаток,
	|	-ОстаткиНаДень.СуммаУпрОстаток,
	|	&ХозяйственнаяОперация
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДеньгиВПутиЗаДень
	|		ПО ОстаткиНаДень.Валюта = ДеньгиВПутиЗаДень.Валюта
	|			И ОстаткиНаДень.Валюта = ДеньгиВПутиЗаДень.Валюта
	|			И ОстаткиНаДень.Организация = ДеньгиВПутиЗаДень.Организация
	|			И ОстаткиНаДень.Получатель = ДеньгиВПутиЗаДень.Получатель
	|			И ОстаткиНаДень.ВидПереводаДенежныхСредств = ДеньгиВПутиЗаДень.ВидПеревода
	|			И ОстаткиНаДень.Контрагент = ДеньгиВПутиЗаДень.Контрагент
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток = 0
	|	И (НЕ ДеньгиВПутиЗаДень.Валюта ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ОстаткиНаДень.СуммаРеглОстаток <> 0 ИЛИ ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.Получатель КАК Получатель,
	|	Остатки.Отправитель КАК Отправитель,
	|	Остатки.ВидПереводаДенежныхСредств КАК ВидПереводаДенежныхСредств,
	|	Остатки.Контрагент КАК Контрагент,
	|	ВЫБОР КОГДА Остатки.СуммаРегл < 0
	|		ТОГДА -Остатки.СуммаРегл
	|		ИНАЧЕ Остатки.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	Остатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств
	|ПОМЕСТИТЬ ТаблицаДСвПути
	|ИЗ
	|	втОстакиВПути КАК Остатки
	|ГДЕ
	|	Остатки.СуммаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.Организация,
	|	Остатки.Получатель,
	|	Остатки.Отправитель,
	|	Остатки.ВидПереводаДенежныхСредств,
	|	Остатки.Контрагент,
	|	0,
	|	ВЫБОР КОГДА Остатки.СуммаУпр < 0
	|		ТОГДА -Остатки.СуммаУпр
	|		ИНАЧЕ Остатки.СуммаУпр
	|	КОНЕЦ,
	|	Остатки.ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ
	|ИЗ
	|	втОстакиВПути КАК Остатки
	|ГДЕ
	|	Остатки.СуммаУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДСвПути.Валюта,
	|	ТаблицаДСвПути.ВидДвижения,
	|	ТаблицаДСвПути.Период КАК Период,
	|	ТаблицаДСвПути.Организация,
	|	ТаблицаДСвПути.Получатель,
	|	ТаблицаДСвПути.Отправитель КАК Отправитель,
	|	ТаблицаДСвПути.ВидПереводаДенежныхСредств,
	|	ТаблицаДСвПути.Контрагент,
	|	СУММА(ТаблицаДСвПути.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаДСвПути.СуммаУпр) КАК СуммаУпр,
	|	ТаблицаДСвПути.ХозяйственнаяОперация,
	|	ТаблицаДСвПути.СтатьяДвиженияДенежныхСредств
	|ИЗ
	|	ТаблицаДСвПути КАК ТаблицаДСвПути
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДСвПути.Валюта,
	|	ТаблицаДСвПути.Период,
	|	ТаблицаДСвПути.Организация,
	|	ТаблицаДСвПути.Получатель,
	|	ТаблицаДСвПути.Отправитель,
	|	ТаблицаДСвПути.ВидПереводаДенежныхСредств,
	|	ТаблицаДСвПути.Контрагент,
	|	ТаблицаДСвПути.ХозяйственнаяОперация,
	|	ТаблицаДСвПути.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаДСвПути.ВидДвижения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период"
	+"
	|;
	|";
	
КонецФункции
//++ НЕ УТ
Функция ТекстЗапросаКурсовыеРазницыПоДенежнымДокументам(ХозяйственнаяОперация)
	
	Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыЗаДень.Организация КАК Организация,
	|	ОборотыЗаДень.Подразделение КАК Подразделение,
	|	ОборотыЗаДень.МОЛ КАК МОЛ,
	|	ОборотыЗаДень.ДенежныйДокумент КАК ДенежныйДокумент
	|ПОМЕСТИТЬ ДокументыЗаДень
	|ИЗ
	|	РегистрНакопления.ДенежныеДокументы.Обороты(
	|			&ГраницаНачалоПериода,
	|			&ГраницаКонецПериода,
	|			,
	|			Организация = &Организация
	|			И (ДенежныйДокумент.Валюта <> &ВалютаУправленческогоУчета 
	|				ИЛИ ДенежныйДокумент.Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОборотыЗаДень
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.ДенежныйДокумент.Валюта КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.Подразделение КАК Подразделение,
	|	ОстаткиНаДень.МОЛ КАК МОЛ,
	|	ОстаткиНаДень.ДенежныйДокумент КАК ДенежныйДокумент,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность КАК ЧИСЛО(15, 2))) - ОстаткиНаДень.СуммаРеглОстаток КАК СуммаРегл,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность / КурсВалютыУпр.Курс * КурсВалютыУпр.Кратность КАК ЧИСЛО(15, 2))) - ОстаткиНаДень.СуммаУпрОстаток КАК СуммаУпр,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|
	|ПОМЕСТИТЬ втОстакиДенежныхДокументов
	|ИЗ
	|	РегистрНакопления.ДенежныеДокументы.Остатки(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И (ДенежныйДокумент.Валюта <> &ВалютаУправленческогоУчета
	|					ИЛИ ДенежныйДокумент.Валюта <> &ВалютаРегламентированногоУчета)
	|		) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыЗаДень
	|		ПО ОстаткиНаДень.Организация = ДокументыЗаДень.Организация
	|			И ОстаткиНаДень.Подразделение = ДокументыЗаДень.Подразделение
	|			И ОстаткиНаДень.МОЛ = ДокументыЗаДень.МОЛ
	|			И ОстаткиНаДень.ДенежныйДокумент = ДокументыЗаДень.ДенежныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, ) КАК КурсВалюты
	|		ПО ОстаткиНаДень.ДенежныйДокумент.Валюта = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, Валюта = &ВалютаУправленческогоУчета) КАК КурсВалютыУпр
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток <> 0
	|	И (НЕ ДокументыЗаДень.ДенежныйДокумент ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И ((ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность КАК ЧИСЛО(15, 2))) - ОстаткиНаДень.СуммаРеглОстаток <> 0
	|			ИЛИ (ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.Курс / КурсВалюты.Кратность / КурсВалютыУпр.Курс * КурсВалютыУпр.Кратность КАК ЧИСЛО(15, 2))) - ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.ДенежныйДокумент.Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	|	ОстаткиНаДень.Организация,
	|	ОстаткиНаДень.Подразделение,
	|	ОстаткиНаДень.МОЛ,
	|	ОстаткиНаДень.ДенежныйДокумент,
	|	-ОстаткиНаДень.СуммаРеглОстаток,
	|	-ОстаткиНаДень.СуммаУпрОстаток,
	|	&ХозяйственнаяОперация
	|ИЗ
	|	РегистрНакопления.ДенежныеДокументы.Остатки(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И (ДенежныйДокумент.Валюта <> &ВалютаУправленческогоУчета
	|					ИЛИ ДенежныйДокумент.Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыЗаДень
	|		ПО ОстаткиНаДень.Организация = ДокументыЗаДень.Организация
	|			И ОстаткиНаДень.Подразделение = ДокументыЗаДень.Подразделение
	|			И ОстаткиНаДень.МОЛ = ДокументыЗаДень.МОЛ
	|			И ОстаткиНаДень.ДенежныйДокумент = ДокументыЗаДень.ДенежныйДокумент
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток = 0
	|	И (НЕ ДокументыЗаДень.ДенежныйДокумент ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ОстаткиНаДень.СуммаРеглОстаток <> 0 ИЛИ ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.Подразделение КАК Подразделение,
	|	Остатки.МОЛ КАК МОЛ,
	|	Остатки.ДенежныйДокумент КАК ДенежныйДокумент,
	|	ВЫБОР КОГДА Остатки.СуммаРегл < 0
	|		ТОГДА -Остатки.СуммаРегл
	|		ИНАЧЕ Остатки.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	Остатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|
	|ПОМЕСТИТЬ ТаблицаДенежныхДокументов
	|ИЗ
	|	втОстакиДенежныхДокументов КАК Остатки
	|ГДЕ
	|	Остатки.СуммаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.Организация,
	|	Остатки.Подразделение,
	|	Остатки.МОЛ,
	|	Остатки.ДенежныйДокумент,
	|	0,
	|	ВЫБОР КОГДА Остатки.СуммаУпр < 0
	|		ТОГДА -Остатки.СуммаУпр
	|		ИНАЧЕ Остатки.СуммаУпр
	|	КОНЕЦ,
	|	Остатки.ХозяйственнаяОперация
	|ИЗ
	|	втОстакиДенежныхДокументов КАК Остатки
	|ГДЕ
	|	Остатки.СуммаУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДенежныхДокументов.Валюта,
	|	ТаблицаДенежныхДокументов.ВидДвижения,
	|	ТаблицаДенежныхДокументов.Период КАК Период,
	|	ТаблицаДенежныхДокументов.Организация,
	|	ТаблицаДенежныхДокументов.Подразделение,
	|	ТаблицаДенежныхДокументов.МОЛ,
	|	ТаблицаДенежныхДокументов.ДенежныйДокумент,
	|	СУММА(ТаблицаДенежныхДокументов.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаДенежныхДокументов.СуммаУпр) КАК СуммаУпр,
	|	ТаблицаДенежныхДокументов.ХозяйственнаяОперация
	|ИЗ
	|	ТаблицаДенежныхДокументов КАК ТаблицаДенежныхДокументов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДенежныхДокументов.Валюта,
	|	ТаблицаДенежныхДокументов.Период,
	|	ТаблицаДенежныхДокументов.Организация,
	|	ТаблицаДенежныхДокументов.Подразделение,
	|	ТаблицаДенежныхДокументов.МОЛ,
	|	ТаблицаДенежныхДокументов.ДенежныйДокумент,
	|	ТаблицаДенежныхДокументов.ХозяйственнаяОперация,
	|	ТаблицаДенежныхДокументов.ВидДвижения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период"
	+"
	|;
	|";
	
КонецФункции
//-- НЕ УТ

Функция ТекстЗапросаКурсовыеРазницыПоКредитамИДепозитам(ХозяйственнаяОперация)
	
	Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереоценкаКредитовИДепозитов Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыЗаДень.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОборотыЗаДень.Договор КАК Договор,
	|	ОборотыЗаДень.ТипСуммы КАК ТипСуммы
	|ПОМЕСТИТЬ ДоговораЗаДень
	|ИЗ
	|	РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов.Обороты(
	|			&ГраницаНачалоПериода,
	|			&ГраницаКонецПериода,
	|			,
	|			(Договор.ВалютаВзаиморасчетов <> &ВалютаУправленческогоУчета 
	|				ИЛИ Договор.ВалютаВзаиморасчетов <> &ВалютаРегламентированногоУчета)
	|	) КАК ОборотыЗаДень
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.СуммаВВалюте КАК ОстатокВалюты,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаВВалюте * КурсВалюты.Курс / КурсВалюты.Кратность КАК ЧИСЛО(15, 2))) - ОстаткиНаДень.СуммаРегл КАК СуммаРегл,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаВВалюте * КурсВалюты.Курс / КурсВалюты.Кратность / КурсВалютыУпр.Курс * КурсВалютыУпр.Кратность КАК ЧИСЛО(15, 2))) - ОстаткиНаДень.СуммаУпр КАК СуммаУпр,
	|	ОстаткиНаДень.ТипСуммы КАК ТипСуммы,
	|	ОстаткиНаДень.Договор КАК Договор,
	|	ОстаткиНаДень.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиНаДень.ХарактерДоговора КАК ХарактерДоговора,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|
	|ПОМЕСТИТЬ втОстакиКредитовДепозитов
	|ИЗ
	|	(ВЫБРАТЬ
	|		Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Остатки.Договор КАК Договор,
	|		Остатки.Договор.ХарактерДоговора КАК ХарактерДоговора,
	|		Остатки.ТипСуммы КАК ТипСуммы,
	|		Остатки.Договор.ВалютаВзаиморасчетов КАК Валюта,
	|		Остатки.СуммаВВалютеОстаток КАК СуммаВВалюте,
	|		Остатки.СуммаРеглОстаток КАК СуммаРегл,
	|		Остатки.СуммаУпрОстаток КАК СуммаУпр
	|	ИЗ
	|		РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов.Остатки(
	|				&ГраницаКонецПериода,
	|				АналитикаУчетаПоПартнерам.Организация = &Организация
	|					И (Договор.ВалютаВзаиморасчетов <> &ВалютаУправленческогоУчета
	|						ИЛИ Договор.ВалютаВзаиморасчетов <> &ВалютаРегламентированногоУчета)
	|		) КАК Остатки
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоговораЗаДень
	|		ПО ОстаткиНаДень.АналитикаУчетаПоПартнерам = ДоговораЗаДень.АналитикаУчетаПоПартнерам
	|			И ОстаткиНаДень.Договор = ДоговораЗаДень.Договор
	|			И ОстаткиНаДень.ТипСуммы = ДоговораЗаДень.ТипСуммы
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, ) КАК КурсВалюты
	|		ПО ОстаткиНаДень.Договор.ВалютаВзаиморасчетов = КурсВалюты.Валюта
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, Валюта = &ВалютаУправленческогоУчета) КАК КурсВалютыУпр
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОстаткиНаДень.СуммаВВалюте <> 0
	|	И (НЕ ДоговораЗаДень.Договор ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И ((ВЫРАЗИТЬ(ОстаткиНаДень.СуммаВВалюте * КурсВалюты.Курс / КурсВалюты.Кратность КАК ЧИСЛО(15, 2))) <> ОстаткиНаДень.СуммаРегл
	|			ИЛИ (ВЫРАЗИТЬ(ОстаткиНаДень.СуммаВВалюте * КурсВалюты.Курс / КурсВалюты.Кратность / КурсВалютыУпр.Курс * КурсВалютыУпр.Кратность КАК ЧИСЛО(15, 2))) <> ОстаткиНаДень.СуммаУпр)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Договор.ВалютаВзаиморасчетов,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	|	0,
	|	-ОстаткиНаДень.СуммаРеглОстаток,
	|	-ОстаткиНаДень.СуммаУпрОстаток,
	|	ОстаткиНаДень.ТипСуммы,
	|	ОстаткиНаДень.Договор,
	|	ОстаткиНаДень.АналитикаУчетаПоПартнерам,
	|	ОстаткиНаДень.Договор.ХарактерДоговора,
	|	&ХозяйственнаяОперация
	|ИЗ
	|	РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам.Организация = &Организация
	|				И (Договор.ВалютаВзаиморасчетов <> &ВалютаУправленческогоУчета
	|					ИЛИ Договор.ВалютаВзаиморасчетов <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоговораЗаДень
	|		ПО ОстаткиНаДень.АналитикаУчетаПоПартнерам = ДоговораЗаДень.АналитикаУчетаПоПартнерам
	|			И ОстаткиНаДень.Договор = ДоговораЗаДень.Договор
	|			И ОстаткиНаДень.ТипСуммы = ДоговораЗаДень.ТипСуммы
	|ГДЕ
	|	ОстаткиНаДень.СуммаВВалютеОстаток = 0
	|	И (НЕ ДоговораЗаДень.Договор ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ОстаткиНаДень.СуммаРеглОстаток <> 0 ИЛИ ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0 
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
	|	КОНЕЦ КАК ВидДвижения,
	|	ВЫБОР КОГДА Остатки.СуммаРегл < 0
	|		ТОГДА -Остатки.СуммаРегл
	|		ИНАЧЕ Остатки.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	Остатки.СуммаРегл КАК СуммаРеглРег,
	|	0 КАК СуммаУпрРег,
	|	Остатки.ТипСуммы КАК ТипСуммы,
	|	Остатки.Договор КАК Договор,
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Остатки.ХарактерДоговора КАК ХарактерДоговора,
	|	Остатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|
	|ПОМЕСТИТЬ ТаблицаКредитовДепозитов
	|ИЗ
	|	втОстакиКредитовДепозитов КАК Остатки
	|ГДЕ
	|	Остатки.СуммаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	&КонецПериода,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0 
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР КОГДА Остатки.СуммаУпр < 0
	|		ТОГДА -Остатки.СуммаУпр
	|		ИНАЧЕ Остатки.СуммаУпр
	|	КОНЕЦ,
	|	0,
	|	Остатки.СуммаУпр КАК СуммаУпрРег,
	|	Остатки.ТипСуммы,
	|	Остатки.Договор,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.ХарактерДоговора КАК ХарактерДоговора,
	|	Остатки.ХозяйственнаяОперация
	|ИЗ
	|	втОстакиКредитовДепозитов КАК Остатки
	|ГДЕ
	|	Остатки.СуммаУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаКредитовДепозитов.Валюта,
	|	ТаблицаКредитовДепозитов.Период КАК Период,
	|	ТаблицаКредитовДепозитов.ВидДвижения,
	|	СУММА(ТаблицаКредитовДепозитов.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаКредитовДепозитов.СуммаУпр) КАК СуммаУпр,
	|	СУММА(ТаблицаКредитовДепозитов.СуммаРеглРег) КАК СуммаРеглРег,
	|	СУММА(ТаблицаКредитовДепозитов.СуммаУпрРег) КАК СуммаУпрРег,
	|	ТаблицаКредитовДепозитов.ТипСуммы,
	|	ТаблицаКредитовДепозитов.Договор,
	|	ТаблицаКредитовДепозитов.АналитикаУчетаПоПартнерам,
	|	ТаблицаКредитовДепозитов.ХарактерДоговора КАК ХарактерДоговора,
	|	ТаблицаКредитовДепозитов.ХозяйственнаяОперация
	|ИЗ
	|	ТаблицаКредитовДепозитов КАК ТаблицаКредитовДепозитов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаКредитовДепозитов.Валюта,
	|	ТаблицаКредитовДепозитов.Период,
	|	ТаблицаКредитовДепозитов.АналитикаУчетаПоПартнерам,
	|	ТаблицаКредитовДепозитов.Договор,
	|	ТаблицаКредитовДепозитов.ХарактерДоговора,
	|	ТаблицаКредитовДепозитов.ТипСуммы,
	|	ТаблицаКредитовДепозитов.ХозяйственнаяОперация,
	|	ТаблицаКредитовДепозитов.ВидДвижения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период"
	+"
	|;
	|";
	
КонецФункции

#КонецОбласти

#Область БлокировкаПриОбновленииИБ

Процедура ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(ПредставлениеОперации, Операция, ТолькоКассы)
	
	ВходящиеДанные = Новый Соответствие;
	
	ВходящиеДанные.Вставить(Метаданные.Документы.ПереоценкаВалютныхСредств);
	Если Операция = Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств ИЛИ НЕ ЗначениеЗаполнено(Операция) Тогда
		Если НЕ ТолькоКассы Тогда
			ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваБезналичные);
			ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваВКассахККМ);
			ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваВПути);
			ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваУПодотчетныхЛиц); 
			//++ НЕ УТ
			ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ДенежныеДокументы);
			//-- НЕ УТ
		КонецЕсли;
		ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваНаличные);
	КонецЕсли;
	Если Операция = Перечисления.ХозяйственныеОперации.ПереоценкаКредитовИДепозитов ИЛИ НЕ ЗначениеЗаполнено(Операция) Тогда
		ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.РасчетыПоДоговорамКредитовИДепозитов);
	КонецЕсли;
	Если Операция = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами ИЛИ НЕ ЗначениеЗаполнено(Операция) Тогда
		ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоДокументам);
	КонецЕсли;
	Если Операция = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками ИЛИ НЕ ЗначениеЗаполнено(Операция) Тогда
		ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоДокументам);
	КонецЕсли;
	ВходящиеДанные.Вставить(Метаданные.РегистрыСведений.АналитикаУчетаПоПартнерам);
	ВходящиеДанные.Вставить(Метаданные.РегистрыСведений.КурсыВалют);
	
	ЗакрытиеМесяцаУТВызовСервера.ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(ВходящиеДанные, ПредставлениеОперации);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура ЗаписатьДвижения(ДокументСсылка, РезультатЗапроса, ИмяРегистра, Индекс = 4)
	
	КурсовыеРазницы = РезультатЗапроса[Индекс].Выгрузить();
	Если КурсовыеРазницы.Количество() > 0 Тогда
		Набор = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументСсылка);
		Набор.Загрузить(КурсовыеРазницы);
		Набор.Записать(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПровестиДокументПереоценки(Организация, Период, Операция, АналитикаРасчета = Неопределено, ТолькоКассы = Ложь)
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВалют") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПланыОбмена.ГлавныйУзел()) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТребуетсяПереоценка(Организация, Период, Операция, АналитикаРасчета, ТолькоКассы) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Организация КАК Организация
	|ПОМЕСТИТЬ втДокументПереоценки
	|ИЗ
	|	Документ.ПереоценкаВалютныхСредств КАК Документ
	|ГДЕ
	|	Документ.ХозяйственнаяОперация = &Операция
	|	И НЕ Документ.ПометкаУдаления
	|	И Документ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (Документ.Организация В (&Организация) ИЛИ &ВсеОрганизации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация,
	|	ЕСТЬNULL(Документ.Ссылка, НЕОПРЕДЕЛЕНО) КАК Документ
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДокументПереоценки КАК Документ
	|		ПО Организации.Ссылка = Документ.Организация
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления
	|	И (Организации.Ссылка В (&Организация) ИЛИ &ВсеОрганизации)
	|	И (Организации.Ссылка <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|		ИЛИ &УчитыватьУпрОрганизацию)");
	
	Запрос.УстановитьПараметр("Операция",       Операция);
	Запрос.УстановитьПараметр("НачалоПериода",  НачалоМесяца(Период));
	Запрос.УстановитьПараметр("КонецПериода",   КонецМесяца(Период));
	Запрос.УстановитьПараметр("Организация",    Организация);
	Запрос.УстановитьПараметр("ВсеОрганизации", НЕ ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("УчитыватьУпрОрганизацию", ПолучитьФункциональнуюОпцию("ИспользоватьУправленческуюОрганизацию"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Документ) Тогда
			
			ДокументОбъект = Выборка.Документ.ПолучитьОбъект();
			ДокументОбъект.ПометкаУдаления = Ложь;
			ВыполнитьРасчетКурсовыхРазниц(ДокументОбъект, АналитикаРасчета, ТолькоКассы);
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		Иначе
			
			ДокументОбъект = Документы.ПереоценкаВалютныхСредств.СоздатьДокумент();
			ДокументОбъект.Дата = КонецМесяца(Период);
			ДокументОбъект.Организация = Выборка.Организация;
			ДокументОбъект.ХозяйственнаяОперация = Операция;
			ДокументОбъект.Записать();
			ВыполнитьРасчетКурсовыхРазниц(ДокументОбъект, АналитикаРасчета, ТолькоКассы);
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЕсли;
		
	КонецЦикла;// По организациям
	
КонецПроцедуры

Функция ЕстьВалютныеОстатки(Организация, Период, Операция = Неопределено, АналитикаРасчета = Неопределено, ТолькоКассы = Ложь) Экспорт
	
	ТекстЗапросаВТ =
	"ВЫБРАТЬ
	|	АналитикаУчетаПоПартнерам.КлючАналитики КАК КлючАналитики
	|ПОМЕСТИТЬ втКлючиАналитикиПоПартнерам
	|ИЗ
	|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|ГДЕ
	|	(АналитикаУчетаПоПартнерам.Организация В (&Организация) ИЛИ &ВсеОрганизации)
	|	И (АналитикаУчетаПоПартнерам.КлючАналитики В (&АналитикаРасчета) ИЛИ &ПоВсемАналитикам)"
	+"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	МассивОпераций = Новый Массив;
	Если ТипЗнч(Операция) = Тип("Массив") Тогда
		МассивОпераций = Операция;
	Иначе
		МассивОпераций.Добавить(Операция);
	КонецЕсли;
	ПоВсемОперациям = НЕ ЗначениеЗаполнено(Операция);
	Разделитель = Символы.ПС+Символы.ПС;
	ОБЪЕДИНИТЬ = Разделитель+"ОБЪЕДИНИТЬ ВСЕ"+Разделитель;
	ХЗ = Перечисления.ХозяйственныеОперации;
	ТекстЗапроса = "";
	Если МассивОпераций.Найти(ХЗ.ПереоценкаРасчетовСПоставщиками) <> Неопределено ИЛИ ПоВсемОперациям Тогда
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыСПоставщикамиПоДокументам"" КАК ПредметПереоценки,
		|	Остатки.Валюта КАК Валюта
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(
		|		&ГраницаКонецПериода,
		|		АналитикаУчетаПоПартнерам В (ВЫБРАТЬ Т.КлючАналитики ИЗ втКлючиАналитикиПоПартнерам КАК Т)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> &ВалютаРеглУчета)
		|			И (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками) В (&СписокОпераций) ИЛИ &ПоВсемОперациям)
		|	) КАК Остатки";
	КонецЕсли;
	
	Если МассивОпераций.Найти(ХЗ.ПереоценкаРасчетовСКлиентами) <> Неопределено ИЛИ ПоВсемОперациям Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыСКлиентамиПоДокументам"" КАК ПредметПереоценки,
		|	Остатки.Валюта КАК Валюта
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(
		|		&ГраницаКонецПериода,
		|		АналитикаУчетаПоПартнерам В (ВЫБРАТЬ Т.КлючАналитики ИЗ втКлючиАналитикиПоПартнерам КАК Т)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> &ВалютаРеглУчета)
		|			И (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами) В (&СписокОпераций) ИЛИ &ПоВсемОперациям)
		|	) КАК Остатки"
	КонецЕсли;
	
	Если МассивОпераций.Найти(ХЗ.ПереоценкаДенежныхСредств) <> Неопределено И НЕ ТолькоКассы ИЛИ ПоВсемОперациям Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваБезналичные"" КАК ПредметПереоценки,
		|	Остатки.БанковскийСчет КАК ДенежныеСредства
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваБезналичные.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаУпрУчета
		|				ИЛИ БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаРеглУчета)
		|			И (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств) В (&СписокОпераций) ИЛИ &ПоВсемОперациям)
		|	) КАК Остатки
		|	
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваНаличные"" КАК ПредметПереоценки,
		|	Остатки.Касса КАК ДенежныеСредства
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваНаличные.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Касса.ВалютаДенежныхСредств <> &ВалютаУпрУчета
		|				ИЛИ Касса.ВалютаДенежныхСредств <> &ВалютаРеглУчета)
		|			И (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств) В (&СписокОпераций) ИЛИ &ПоВсемОперациям)
		|	) КАК Остатки
		|	
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваВКассахККМ"" КАК ПредметПереоценки,
		|	Остатки.КассаККМ КАК ДенежныеСредства
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (КассаККМ.ВалютаДенежныхСредств <> &ВалютаУпрУчета
		|			ИЛИ КассаККМ.ВалютаДенежныхСредств <> &ВалютаРеглУчета)
		|			И (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств) В (&СписокОпераций) ИЛИ &ПоВсемОперациям)
		|	) КАК Остатки
		|	
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваУПодотчетныхЛиц"" КАК ПредметПереоценки,
		|	Остатки.ПодотчетноеЛицо КАК ДенежныеСредства
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> &ВалютаРеглУчета)
		|			И (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств) В (&СписокОпераций) ИЛИ &ПоВсемОперациям)
		|	) КАК Остатки
		|	
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваВПути"" КАК ПредметПереоценки,
		|	Остатки.ВидПереводаДенежныхСредств КАК ДенежныеСредства
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВПути.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> &ВалютаРеглУчета)
		|			И (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств) В (&СписокОпераций) ИЛИ &ПоВсемОперациям)
		|	) КАК Остатки
		//++ НЕ УТ
		|	
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеДокументы"" КАК ПредметПереоценки,
		|	Остатки.ДенежныйДокумент КАК ДенежныеСредства
		|ИЗ
		|	РегистрНакопления.ДенежныеДокументы.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (ДенежныйДокумент.Валюта <> &ВалютаУпрУчета 
		|				ИЛИ ДенежныйДокумент.Валюта <> &ВалютаРеглУчета)
		|			И (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств) В (&СписокОпераций) ИЛИ &ПоВсемОперациям)
		|	) КАК Остатки
		//-- НЕ УТ
		|";
	КонецЕсли;
	
	Если ТолькоКассы Тогда
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваНаличные"" КАК ПредметПереоценки,
		|	Остатки.Касса КАК ДенежныеСредства
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваНаличные.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Касса В (&АналитикаРасчета) ИЛИ &ПоВсемАналитикам)
		|			И (Касса.ВалютаДенежныхСредств <> &ВалютаУпрУчета
		|				ИЛИ Касса.ВалютаДенежныхСредств <> &ВалютаРеглУчета)
		|			И ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств) В (&СписокОпераций)
		|	) КАК Остатки";
	КонецЕсли;
	
	Если МассивОпераций.Найти(ХЗ.ПереоценкаКредитовИДепозитов) <> Неопределено ИЛИ ПоВсемОперациям Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыПоДоговорамКредитовИДепозитов"" КАК ПредметПереоценки,
		|	Остатки.Договор КАК Валюта
		|ИЗ
		|	РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов.Остатки(
		|		&ГраницаКонецПериода,
		|		(АналитикаУчетаПоПартнерам.Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Договор.ВалютаВзаиморасчетов <> &ВалютаУпрУчета
		|				ИЛИ Договор.ВалютаВзаиморасчетов <> &ВалютаРеглУчета)
		|			И (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаКредитовИДепозитов) В (&СписокОпераций) ИЛИ &ПоВсемОперациям)
		|	) КАК Остатки";
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапросаВТ + ТекстЗапроса);
	Запрос.УстановитьПараметр("ГраницаКонецПериода", Новый Граница(КонецМесяца(Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ВалютаРеглУчета",     Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаУпрУчета",      Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("СписокОпераций",      МассивОпераций);
	Запрос.УстановитьПараметр("ПоВсемОперациям",     ПоВсемОперациям);
	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.УстановитьПараметр("ВсеОрганизации",      НЕ ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("АналитикаРасчета",    АналитикаРасчета);
	Запрос.УстановитьПараметр("ПоВсемАналитикам",    НЕ ЗначениеЗаполнено(АналитикаРасчета));
	
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции

Функция ТребуетсяПереоценка(Организация, Период, Операция = Неопределено, АналитикаРасчета = Неопределено, ТолькоКассы = Ложь) Экспорт
	
	ТекстЗапросаВТ =
	"ВЫБРАТЬ
	|	АналитикаУчетаПоПартнерам.КлючАналитики КАК КлючАналитики
	|ПОМЕСТИТЬ втКлючиАналитикиПоПартнерам
	|ИЗ
	|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|ГДЕ
	|	(АналитикаУчетаПоПартнерам.Организация В (&Организация) ИЛИ &ВсеОрганизации)
	|	И (АналитикаУчетаПоПартнерам.КлючАналитики В (&АналитикаРасчета) ИЛИ &ПоВсемАналитикам)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Период,
	|	КурсыВалютСрезПоследних.Валюта,
	|	КурсыВалютСрезПоследних.Курс,
	|	КурсыВалютСрезПоследних.Кратность
	|ПОМЕСТИТЬ втКурсы
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&НаДату,) КАК КурсыВалютСрезПоследних"
	+"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	МассивОпераций = Новый Массив;
	Если ТипЗнч(Операция) = Тип("Массив") Тогда
		МассивОпераций = Операция;
	Иначе
		МассивОпераций.Добавить(Операция);
	КонецЕсли;
	ПоВсемОперациям = НЕ ЗначениеЗаполнено(Операция);
	Разделитель = Символы.ПС+Символы.ПС;
	ОБЪЕДИНИТЬ = Разделитель+"ОБЪЕДИНИТЬ ВСЕ"+Разделитель;
	ХЗ = Перечисления.ХозяйственныеОперации;
	ТекстЗапроса = "";
	Если МассивОпераций.Найти(ХЗ.ПереоценкаРасчетовСПоставщиками) <> Неопределено ИЛИ ПоВсемОперациям Тогда
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыСПоставщикамиПоДокументам"" КАК РегистрНакопления,
		|	Остатки.Валюта КАК Валюта,
		|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Остатки.ЗаказПоставщику КАК Объект,
		|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(
		|		&ГраницаКонецПериода,
		|		АналитикаУчетаПоПартнерам В (ВЫБРАТЬ Т.КлючАналитики ИЗ втКлючиАналитикиПоПартнерам КАК Т)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> &ВалютаРеглУчета)
		|			И (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками) В (&СписокОпераций) ИЛИ &ПоВсемОперациям)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Валюта = КурсРегл.Валюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|ГДЕ
		|	ВЫРАЗИТЬ(Остатки.ДолгОстаток * КурсРегл.Курс / КурсРегл.Кратность / КурсУпр.Курс * КурсУпр.Кратность КАК ЧИСЛО(15,2)) <> Остатки.ДолгУпрОстаток
		|	ИЛИ ВЫРАЗИТЬ(Остатки.ДолгОстаток * КурсРегл.Курс / КурсРегл.Кратность КАК ЧИСЛО(15,2)) <> Остатки.ДолгРеглОстаток
		|	ИЛИ (Остатки.ПредоплатаОстаток = 0 И Остатки.КВозвратуОстаток = 0
		|		И (ВЫРАЗИТЬ(Остатки.ПредоплатаОстаток * КурсРегл.Курс / КурсРегл.Кратность КАК ЧИСЛО(15,2)) <> Остатки.ПредоплатаРеглОстаток
		|			ИЛИ ВЫРАЗИТЬ(Остатки.ПредоплатаОстаток * КурсРегл.Курс / КурсРегл.Кратность / КурсУпр.Курс * КурсУпр.Кратность КАК ЧИСЛО(15,2)) <> Остатки.ПредоплатаУпрОстаток
		|			)
		|		)";
	КонецЕсли;
	
	Если МассивОпераций.Найти(ХЗ.ПереоценкаРасчетовСКлиентами) <> Неопределено ИЛИ ПоВсемОперациям Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыСКлиентамиПоДокументам"" КАК РегистрНакопления,
		|	Остатки.Валюта КАК Валюта,
		|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Остатки.ЗаказКлиента КАК Объект,
		|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(
		|		&ГраницаКонецПериода,
		|		АналитикаУчетаПоПартнерам В (ВЫБРАТЬ Т.КлючАналитики ИЗ втКлючиАналитикиПоПартнерам КАК Т)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> &ВалютаРеглУчета)
		|			И (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами) В (&СписокОпераций) ИЛИ &ПоВсемОперациям)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Валюта = КурсРегл.Валюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|ГДЕ
		|	ВЫРАЗИТЬ(Остатки.ДолгОстаток * КурсРегл.Курс / КурсРегл.Кратность / КурсУпр.Курс * КурсУпр.Кратность КАК ЧИСЛО(15,2)) <> Остатки.ДолгУпрОстаток
		|	ИЛИ ВЫРАЗИТЬ(Остатки.ДолгОстаток * КурсРегл.Курс / КурсРегл.Кратность КАК ЧИСЛО(15,2)) <> Остатки.ДолгРеглОстаток
		|	ИЛИ (Остатки.ПредоплатаОстаток = 0 И Остатки.КВозвратуОстаток = 0
		|		И (ВЫРАЗИТЬ(Остатки.ПредоплатаОстаток * КурсРегл.Курс / КурсРегл.Кратность КАК ЧИСЛО(15,2)) <> Остатки.ПредоплатаРеглОстаток
		|			ИЛИ ВЫРАЗИТЬ(Остатки.ПредоплатаОстаток * КурсРегл.Курс / КурсРегл.Кратность / КурсУпр.Курс * КурсУпр.Кратность КАК ЧИСЛО(15,2)) <> Остатки.ПредоплатаУпрОстаток
		|			)
		|		)";
	КонецЕсли;
	
	Если МассивОпераций.Найти(ХЗ.ПереоценкаДенежныхСредств) <> Неопределено И НЕ ТолькоКассы ИЛИ ПоВсемОперациям Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваБезналичные"" КАК РегистрНакопления,
		|	НЕОПРЕДЕЛЕНО КАК Валюта,
		|	НЕОПРЕДЕЛЕНО КАК ЦельВыдачи,
		|	Остатки.БанковскийСчет КАК ДенежныеСредства,
		|	НЕОПРЕДЕЛЕНО КАК РасчетныйДокумент
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваБезналичные.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаУпрУчета
		|				ИЛИ БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаРеглУчета)
		|			И (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств) В (&СписокОпераций) ИЛИ &ПоВсемОперациям)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.БанковскийСчет.ВалютаДенежныхСредств = КурсРегл.Валюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|ГДЕ
		|	ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.Курс / КурсРегл.Кратность / КурсУпр.Курс * КурсУпр.Кратность КАК ЧИСЛО(15,2)) <> Остатки.СуммаУпрОстаток
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.Курс / КурсРегл.Кратность КАК ЧИСЛО(15,2)) <> Остатки.СуммаРеглОстаток
		|	
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваНаличные"" КАК РегистрНакопления,
		|	НЕОПРЕДЕЛЕНО КАК Валюта,
		|	НЕОПРЕДЕЛЕНО КАК ЦельВыдачи,
		|	Остатки.Касса КАК ДенежныеСредства,
		|	НЕОПРЕДЕЛЕНО КАК РасчетныйДокумент
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваНаличные.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Касса.ВалютаДенежныхСредств <> &ВалютаУпрУчета
		|				ИЛИ Касса.ВалютаДенежныхСредств <> &ВалютаРеглУчета)
		|			И (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств) В (&СписокОпераций) ИЛИ &ПоВсемОперациям)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Касса.ВалютаДенежныхСредств = КурсРегл.Валюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|ГДЕ
		|	ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.Курс / КурсРегл.Кратность / КурсУпр.Курс * КурсУпр.Кратность КАК ЧИСЛО(15,2)) <> Остатки.СуммаУпрОстаток
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.Курс / КурсРегл.Кратность КАК ЧИСЛО(15,2)) <> Остатки.СуммаРеглОстаток
		|	
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваВКассахККМ"" КАК РегистрНакопления,
		|	НЕОПРЕДЕЛЕНО КАК Валюта,
		|	НЕОПРЕДЕЛЕНО КАК ЦельВыдачи,
		|	Остатки.КассаККМ КАК ДенежныеСредства,
		|	НЕОПРЕДЕЛЕНО КАК РасчетныйДокумент
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (КассаККМ.ВалютаДенежныхСредств <> &ВалютаУпрУчета
		|				ИЛИ КассаККМ.ВалютаДенежныхСредств <> &ВалютаРеглУчета)
		|			И (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств) В (&СписокОпераций) ИЛИ &ПоВсемОперациям)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.КассаККМ.ВалютаДенежныхСредств = КурсРегл.Валюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|ГДЕ
		|	ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.Курс / КурсРегл.Кратность / КурсУпр.Курс * КурсУпр.Кратность КАК ЧИСЛО(15,2)) <> Остатки.СуммаУпрОстаток
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.Курс / КурсРегл.Кратность КАК ЧИСЛО(15,2)) <> Остатки.СуммаРеглОстаток
		|	
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваУПодотчетныхЛиц"" КАК РегистрНакопления,
		|	Остатки.Валюта КАК Валюта,
		|	Остатки.ЦельВыдачи КАК ЦельВыдачи,
		|	Остатки.ПодотчетноеЛицо КАК ДенежныеСредства,
		|	НЕОПРЕДЕЛЕНО КАК РасчетныйДокумент
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Валюта <> &ВалютаУпрУчета
		|				ИЛИ Валюта <> &ВалютаРеглУчета)
		|			И (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств) В (&СписокОпераций) ИЛИ &ПоВсемОперациям)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Валюта = КурсРегл.Валюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|ГДЕ
		|	ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.Курс / КурсРегл.Кратность / КурсУпр.Курс * КурсУпр.Кратность КАК ЧИСЛО(15,2)) <> Остатки.СуммаУпрОстаток
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.Курс / КурсРегл.Кратность КАК ЧИСЛО(15,2)) <> Остатки.СуммаРеглОстаток
		//++ НЕ УТ
		|	
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеДокументы"" КАК РегистрНакопления,
		|	НЕОПРЕДЕЛЕНО КАК Валюта,
		|	НЕОПРЕДЕЛЕНО КАК ЦельВыдачи,
		|	Остатки.ДенежныйДокумент КАК ДенежныеСредства,
		|	НЕОПРЕДЕЛЕНО КАК РасчетныйДокумент
		|ИЗ
		|	РегистрНакопления.ДенежныеДокументы.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (ДенежныйДокумент.Валюта <> &ВалютаУпрУчета
		|				ИЛИ ДенежныйДокумент.Валюта <> &ВалютаРеглУчета)
		|			И (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств) В (&СписокОпераций) ИЛИ &ПоВсемОперациям)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.ДенежныйДокумент.Валюта = КурсРегл.Валюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|ГДЕ
		|	ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.Курс / КурсРегл.Кратность / КурсУпр.Курс * КурсУпр.Кратность КАК ЧИСЛО(15,2)) <> Остатки.СуммаУпрОстаток
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.Курс / КурсРегл.Кратность КАК ЧИСЛО(15,2)) <> Остатки.СуммаРеглОстаток
		//-- НЕ УТ
		|";
	КонецЕсли;
	
	Если ТолькоКассы И НЕ ПоВсемОперациям Тогда
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваНаличные"" КАК РегистрНакопления,
		|	Остатки.Касса КАК ДенежныеСредства
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваНаличные.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Касса.ВалютаДенежныхСредств <> &ВалютаУпрУчета
		|				ИЛИ Касса.ВалютаДенежныхСредств <> &ВалютаРеглУчета)
		|			И (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств) В (&СписокОпераций) ИЛИ &ПоВсемОперациям)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Касса.ВалютаДенежныхСредств = КурсРегл.Валюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|ГДЕ
		|	ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.Курс / КурсРегл.Кратность / КурсУпр.Курс * КурсУпр.Кратность КАК ЧИСЛО(15,2)) <> Остатки.СуммаУпрОстаток
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.Курс / КурсРегл.Кратность КАК ЧИСЛО(15,2)) <> Остатки.СуммаРеглОстаток";
	КонецЕсли;
	
	Если МассивОпераций.Найти(ХЗ.ПереоценкаКредитовИДепозитов) <> Неопределено ИЛИ ПоВсемОперациям Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыПоДоговорамКредитовИДепозитов"" КАК РегистрНакопления,
		|	НЕОПРЕДЕЛЕНО КАК Валюта,
		|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Остатки.Договор КАК ДенежныеСредства,
		|	Остатки.ТипСуммы КАК РасчетныйДокумент
		|ИЗ
		|	РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов.Остатки(
		|		&ГраницаКонецПериода,
		|		(АналитикаУчетаПоПартнерам.Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Договор.ВалютаВзаиморасчетов <> &ВалютаУпрУчета
		|				ИЛИ Договор.ВалютаВзаиморасчетов <> &ВалютаРеглУчета)
		|			И (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаКредитовИДепозитов) В (&СписокОпераций) ИЛИ &ПоВсемОперациям)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Договор.ВалютаВзаиморасчетов = КурсРегл.Валюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|ГДЕ
		|	ВЫРАЗИТЬ(Остатки.СуммаВВалютеОстаток * КурсРегл.Курс / КурсРегл.Кратность / КурсУпр.Курс * КурсУпр.Кратность КАК ЧИСЛО(15,2)) <> Остатки.СуммаУпрОстаток
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаВВалютеОстаток * КурсРегл.Курс / КурсРегл.Кратность КАК ЧИСЛО(15,2)) <> Остатки.СуммаРеглОстаток";
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапросаВТ + ТекстЗапроса);
	Запрос.УстановитьПараметр("НаДату",              КонецМесяца(Период));
	Запрос.УстановитьПараметр("ГраницаКонецПериода", Новый Граница(КонецМесяца(Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ВалютаРеглУчета",     Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаУпрУчета",      Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("СписокОпераций",      МассивОпераций);
	Запрос.УстановитьПараметр("ПоВсемОперациям",     ПоВсемОперациям);
	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.УстановитьПараметр("ВсеОрганизации",      НЕ ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("АналитикаРасчета",    АналитикаРасчета);
	Запрос.УстановитьПараметр("ПоВсемАналитикам",    НЕ ЗначениеЗаполнено(АналитикаРасчета));
	
	Результат = Запрос.Выполнить();// нерассчитанные курсовые разницы
	Возврат НЕ Результат.Пустой();
	
КонецФункции

Функция ТребуетсяПереоценкаВзаиморасчетов(Организация, Период, АналитикаРасчета = Неопределено) Экспорт
	
	ОперацииВзаиморасчетов = Новый Массив;
	ОперацииВзаиморасчетов.Добавить(Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками);
	ОперацииВзаиморасчетов.Добавить(Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами);
	Возврат ТребуетсяПереоценка(Организация, Период, ОперацииВзаиморасчетов, АналитикаРасчета);
	
КонецФункции

Процедура ОчиститьДвижения(ДокументОбъект, ИмяРегистра, АналитикаРасчета = Неопределено)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Регистратор = &Регистратор
	|	И НЕ (ДанныеРегистра.Касса В (&АналитикаРасчета))
	|	И &ВсеКромеАналитикиРасчета";
	
	Если ИмяРегистра <> "ДенежныеСредстваНаличные" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДенежныеСредстваНаличные", ИмяРегистра);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Касса", "АналитикаУчетаПоПартнерам");
	КонецЕсли;
	
	// Получим новый набор движений - набор без движений которые надо удалить
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Регистратор", ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("АналитикаРасчета", АналитикаРасчета);
	Запрос.УстановитьПараметр("ВсеКромеАналитикиРасчета", ЗначениеЗаполнено(АналитикаРасчета));
	ДвиженияРегистра = Запрос.Выполнить().Выгрузить();
	
	Набор = ДокументОбъект.Движения[ИмяРегистра];
	Набор.Загрузить(ДвиженияРегистра);
	Набор.ОбменДанными.Загрузка = Истина;
	Набор.Записать();
	
КонецПроцедуры

Процедура ПодготовитьНаборыЗаписейКРасчету(ДокументОбъект, ИменаРегистров, АналитикаРасчета = Неопределено)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Документ.ПереоценкаВалютныхСредств");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	Для Каждого Имя Из ИменаРегистров Цикл
		ЭлементБлокировки = Блокировка.Добавить(СтрШаблон("РегистрНакопления.%1.НаборЗаписей", Имя));
		ЭлементБлокировки.УстановитьЗначение("Регистратор", ДокументОбъект.Ссылка);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	Для Каждого Имя Из ИменаРегистров Цикл
		Если АналитикаРасчета = Неопределено Тогда
			Набор = ДокументОбъект.Движения[Имя];
			Набор.ОбменДанными.Загрузка = Истина;
			Набор.Записать();
		Иначе
			ОчиститьДвижения(ДокументОбъект, Имя, АналитикаРасчета);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция КлючиОрганизации(Организация, АналитикаРасчета)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КлючиАналитикиУчетаПоПартнерам.Ссылка
	|ИЗ
	|	Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|ГДЕ
	|	КлючиАналитикиУчетаПоПартнерам.Организация = &Организация
	|	И КлючиАналитикиУчетаПоПартнерам.Ссылка В(&МассивКлючей)
	|");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("МассивКлючей", АналитикаРасчета);
	МассивКлючейОрганизации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивКлючейОрганизации;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
