#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ЕстьПриемка(СкладскиеОперации) Экспорт
	
	Возврат СкладыКлиентСервер.ЕстьПриемка(СкладскиеОперации);
	
КонецФункции

Функция СкладскиеОперацииПриемки() Экспорт
	
	Возврат СкладыКлиентСервер.СкладскиеОперацииПриемки();
	
КонецФункции

Функция ЕстьОтгрузка(СкладскиеОперации) Экспорт
	
	Возврат СкладыКлиентСервер.ЕстьОтгрузка(СкладскиеОперации);
	
КонецФункции

Функция СкладскиеОперацииОтгрузки() Экспорт
	
	Возврат СкладыКлиентСервер.СкладскиеОперацииОтгрузки();

КонецФункции

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПроизводство") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		МассивИсключаемыхЗначений = Новый Массив;
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ПриемкаПродукцииИзПроизводства"));
		
		ОбщегоНазначенияУТВызовСервера.ПолучитьСписокВыбораПеречисления(
			"СкладскиеОперации",
			ДанныеВыбора,
			Параметры,
			МассивИсключаемыхЗначений);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


