#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрНакопления.РаспоряженияНаВыпускПродукции";
	ИмяРегистра = "РаспоряженияНаВыпускПродукции";
	
	// МаршрутныйЛистПроизводства
	СписокРегистраторов = Документы.МаршрутныйЛистПроизводства.СписокДокументовВКоторыхНарушеноРавенство();
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, СписокРегистраторов, ПолноеИмяРегистра);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрНакопления.РаспоряженияНаВыпускПродукции";
	
	Регистраторы = Новый Массив;
	Регистраторы.Добавить("Документ.МаршрутныйЛистПроизводства");

	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазыУТ.ПерезаписатьДвиженияИзОчереди(Регистраторы, ПолноеИмяРегистра, Параметры.Очередь);
																			
КонецПроцедуры

#КонецОбласти

#КонецЕсли