
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт

	Если ПравоДоступа("Просмотр", Метаданные.Обработки.ФормированиеЗаказовНаПередачуВПроизводствоНаОсновании) Тогда
		КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик = "ВводНаОснованииУТКлиент.СоздатьЗаказыНаПередачуВПроизводство";
		КомандаСоздатьНаОсновании.Идентификатор = Метаданные.Обработки.ФормированиеЗаказовНаПередачуВПроизводствоНаОсновании.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление =  НСтр("ru='Заказы материалов в производство';uk='Замовлення матеріалів у виробництво'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьПроизводство";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции


#КонецОбласти

#КонецЕсли


