// Курченко В.М. от: 27.06.19 <<< 
&НаСервере
Процедура СотрудникПереводаПриИзмененииНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
		|	КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Подразделение,
		|	КадроваяИсторияСотрудниковСрезПоследних.Подразделение.Родитель КАК ПодразделениеРодитель
		|ИЗ
		|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
		|ГДЕ
		|	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник = &Сотрудник
		|	И КадроваяИсторияСотрудниковСрезПоследних.Активность";
	
	Запрос.УстановитьПараметр("Сотрудник", Объект.СотрудникПеревода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Объект.ПодразделениеСотрудника 		= ВыборкаДетальныеЗаписи.Подразделение;
		Объект.ШтатнаяДолжностьСотрудника 	= ВыборкаДетальныеЗаписи.ДолжностьПоШтатномуРасписанию;
		Объект.ТПСотрудника 				= ВыборкаДетальныеЗаписи.ПодразделениеРодитель;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СотрудникПереводаПриИзменении(Элемент)
	СотрудникПереводаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ШтатнаяДолжностьПриИзмененииНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтатноеРасписание.Подразделение КАК Подразделение,
		|	ШтатноеРасписание.Подразделение.Родитель КАК ПодразделениеРодитель
		|ИЗ
		|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
		|ГДЕ
		|	ШтатноеРасписание.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ШтатнаяДолжность);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.Подразделение = ВыборкаДетальныеЗаписи.Подразделение;	
		Объект.ТП			 = ВыборкаДетальныеЗаписи.ПодразделениеРодитель;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ШтатнаяДолжностьПриИзменении(Элемент)
	ШтатнаяДолжностьПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ = Документы.ИзменениеОрганизационнойСтруктуры.ПустаяСсылка() Тогда
		ЗначенияДляЗаполнения = Новый Структура("Ответственный, Организация", 
		"Объект.Ответственный", "Объект.Организация");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
	КонецЕсли; 

КонецПроцедуры
// >>> Курченко В.М. от: 27.06.19  
