#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Формирует массив состояний, которые не учитываются при вычислении стажа, дающего право на ежегодные оплачиваемые отпуска.
// См. ст. 9 Закона об отпусках.
//
// Возвращаемое значение:
//  Массив - содержит значения перечисления.
//
Функция СостоянияПрерывающиеПравоНаОтпуск() Экспорт 

	ПрерывающиеСостояния = Новый Массив;
	ПрерывающиеСостояния.Добавить(Перечисления.СостоянияСотрудника.ОтпускПоУходуЗаРебенком);

	Возврат ПрерывающиеСостояния;
	
КонецФункции
	
#КонецОбласти

#КонецЕсли
