
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	Если Параметры.Свойство("МассивПодразделений") Тогда
		СписокПодразделений.ЗагрузитьЗначения(Параметры.МассивПодразделений);
	КонецЕсли;

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	МассивПодразделений = Новый Массив;
	Для Каждого Элемент Из СписокПодразделений Цикл
		Если ЗначениеЗаполнено(Элемент.Значение) И МассивПодразделений.Найти(Элемент.Значение) = Неопределено Тогда
			МассивПодразделений.Добавить(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	Закрыть(МассивПодразделений);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти
