#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ТипНоменклатурыНабор.Видимость  = ПолучитьФункциональнуюОпцию("ИспользоватьНаборы");
	Элементы.ТипНоменклатурыТара.Видимость   = ПолучитьФункциональнуюОпцию("ИспользоватьМногооборотнуюТару");
	Элементы.ТипНоменклатурыРабота.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВидовНоменклатуры")
												И Не ПолучитьФункциональнуюОпцию("БазоваяВерсия");
	
	Элементы.ТипНоменклатурыНабор.Подсказка  = Перечисления.ТипыНоменклатуры.ПодсказкаПоТипуНоменклатуры(Перечисления.ТипыНоменклатуры.Набор);
	Элементы.ТипНоменклатурыТара.Подсказка   = Перечисления.ТипыНоменклатуры.ПодсказкаПоТипуНоменклатуры(Перечисления.ТипыНоменклатуры.МногооборотнаяТара);
	Элементы.ТипНоменклатурыРабота.Подсказка = Перечисления.ТипыНоменклатуры.ПодсказкаПоТипуНоменклатуры(Перечисления.ТипыНоменклатуры.Работа);
	Элементы.ТипНоменклатурыТовар.Подсказка  = Перечисления.ТипыНоменклатуры.ПодсказкаПоТипуНоменклатуры(Перечисления.ТипыНоменклатуры.Товар);
	Элементы.ТипНоменклатурыУслуга.Подсказка = Перечисления.ТипыНоменклатуры.ПодсказкаПоТипуНоменклатуры(Перечисления.ТипыНоменклатуры.Услуга);
	
	ТипНоменклатуры = Параметры.ТипНоменклатуры;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	ОповеститьОВыборе(ТипНоменклатуры);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

