////////////////////////////////////////////////////////////////////////////////
// Процедуры подсистемы "Производство"
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает параметры производственного подразделения
//
// Параметры:
//  Подразделение	- СправочникСсылка.СтруктураПредприятия - Подразделение для которого требуется получить параметры
//
// Возвращаемое значение:
//   Структура   - содержит параметры производственного подразделения
//
Функция ПараметрыПроизводственногоПодразделения(Подразделение) Экспорт

	ОсновнойКалендарьПредприятия = Константы.ОсновнойКалендарьПредприятия.Получить();
	
	Параметры = Новый Структура;
	Параметры.Вставить("Наименование",                   "");
	Параметры.Вставить("ГрафикРаботы",                   ОсновнойКалендарьПредприятия);
	Параметры.Вставить("НачалоИнтервалаПланирования",    '00010101');
	Параметры.Вставить("ОкончаниеИнтервалаПланирования", КонецДня('00010101'));
	Параметры.Вставить("ПодразделениеДиспетчер",         Ложь);
	Параметры.Вставить("ПроизводствоПоЗаказам",          Ложь);
	Параметры.Вставить("ПроизводствоБезЗаказов",         Ложь);
	Параметры.Вставить("ИспользуетсяСписаниеЗатратНаВыпуск", Ложь);
	//++ НЕ УТКА
	Параметры.Вставить("ИнтервалПланирования", Перечисления.ТочностьГрафикаПроизводства.День);
	Параметры.Вставить("УправлениеМаршрутнымиЛистами", Перечисления.УправлениеМаршрутнымиЛистами.МетодикаББВ);
	Параметры.Вставить("СпособПооперационногоУправления", Перечисления.СпособыУправленияОперациями.ПустаяСсылка());
	//-- НЕ УТКА
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтруктураПредприятия.Ссылка КАК Подразделение,
		|	СтруктураПредприятия.Наименование КАК Наименование,
		|	ВЫБОР
		|		КОГДА СтруктураПредприятия.ГрафикРаботы <> ЗНАЧЕНИЕ(Справочник.Календари.ПустаяСсылка)
		|			ТОГДА СтруктураПредприятия.ГрафикРаботы
		|		ИНАЧЕ &ОсновнойКалендарьПредприятия
		|	КОНЕЦ КАК ГрафикРаботы,
		|	СтруктураПредприятия.ИнтервалПланирования,
		|	СтруктураПредприятия.НачалоИнтервалаПланирования КАК НачалоИнтервалаПланирования,
		|	СтруктураПредприятия.ОкончаниеИнтервалаПланирования КАК ОкончаниеИнтервалаПланирования,
		|	СтруктураПредприятия.УправлениеМаршрутнымиЛистами,
		|	СтруктураПредприятия.СпособПооперационногоУправления,
		|	СтруктураПредприятия.ПодразделениеДиспетчер,
		|	СтруктураПредприятия.ПроизводствоПоЗаказам,
		|	СтруктураПредприятия.ПроизводствоБезЗаказов,
		|	СтруктураПредприятия.ИспользуетсяСписаниеЗатратНаВыпуск
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|ГДЕ
		|	СтруктураПредприятия.Ссылка = &Подразделение";
		
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		Запрос.УстановитьПараметр("ОсновнойКалендарьПредприятия", ОсновнойКалендарьПредприятия);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ЗаполнитьЗначенияСвойств(Параметры, Выборка);
			
		КонецЕсли;
		
	КонецЕсли; 

	Возврат Параметры;
	
КонецФункции

// Возвращает параметры производственного подразделения
//
// Параметры:
//  СписокПодразделений	- Массив - список подразделений для которых требуется получить параметры
//
// Возвращаемое значение:
//  Соответствие, где ключ - ссылка на подразделение, а Значение - структура, которая 
//				содержит параметры производственного подразделения
//
Функция ПараметрыПроизводственныхПодразделений(СписокПодразделений) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтруктураПредприятия.Ссылка КАК Подразделение,
	|	СтруктураПредприятия.Наименование КАК Наименование,
	|	ВЫБОР
	|		КОГДА СтруктураПредприятия.ГрафикРаботы <> ЗНАЧЕНИЕ(Справочник.Календари.ПустаяСсылка)
	|			ТОГДА СтруктураПредприятия.ГрафикРаботы
	|		ИНАЧЕ ОсновнойКалендарьПредприятия.Значение
	|	КОНЕЦ КАК ГрафикРаботы,
	|	СтруктураПредприятия.ИнтервалПланирования КАК ИнтервалПланирования,
	|	СтруктураПредприятия.НачалоИнтервалаПланирования КАК НачалоИнтервалаПланирования,
	|	СтруктураПредприятия.ОкончаниеИнтервалаПланирования КАК ОкончаниеИнтервалаПланирования,
	|	СтруктураПредприятия.УправлениеМаршрутнымиЛистами КАК УправлениеМаршрутнымиЛистами,
	|	СтруктураПредприятия.СпособПооперационногоУправления КАК СпособПооперационногоУправления
	|ИЗ
	|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия,
	|	Константа.ОсновнойКалендарьПредприятия КАК ОсновнойКалендарьПредприятия
	|ГДЕ
	|	СтруктураПредприятия.Ссылка В(&СписокПодразделений)";
	
	Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ЗначенияПараметров = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		Параметры = Новый Структура("Наименование,
									|ГрафикРаботы,
									|ИнтервалПланирования,
									|НачалоИнтервалаПланирования,
									|ОкончаниеИнтервалаПланирования,
									|УправлениеМаршрутнымиЛистами,
									|СпособПооперационногоУправления");
								
		ЗаполнитьЗначенияСвойств(Параметры, Выборка);
		ЗначенияПараметров.Вставить(Выборка.Подразделение, Параметры);
	КонецЦикла;

	Возврат ЗначенияПараметров;
	
КонецФункции

#КонецОбласти
