

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ИспользованияЛимитовРасходаДенежныхСредств");
	НастройкиВарианта.Описание =
		НСтр("ru='План-факт анализ лимитов расходования денежных средств';uk='План-факт аналіз лімітів витрачання грошових коштів'");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли