#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ПроведениеПоРеглУчетуУКР

// Возвращает текст запроса для отражения документа в регламентированном учете.
//
// Возвращаемое значение:
//	Строка - Текст запроса
//
Функция ТекстОтраженияВРеглУчетеУКР() Экспорт
    
#Область КорректировкаНаЗатраты // (Дт 9X :: Кт 6435)
	КорректировкаНаЗатраты = "
	|ВЫБРАТЬ //// Корректировка на затраты (Дт 9X :: Кт 6435)
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Операция.СуммаКорректировкиБУ КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.РасходыПриПерерасчетеПропорциональногоНДС) КАК АналитикаУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Операция.Организация КАК СубконтоДт1, 
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.РасходыПриПерерасчетеПропорциональногоНДС) КАК СубконтоДт2,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УсловнаяПродажа) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""НДС: корректировка пропорц. НДС по товарам/услугам и ОС"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|ГДЕ
	|	Операция.СуммаКорректировкиБУ <> 0
	|";
#КонецОбласти 

#Область КорректировкаАвансовПоставщикам // (Дт 6435 :: Кт 6442)
	КорректировкаАвансовПоставщикам = "
	|ВЫБРАТЬ //// Корректировка авансов постащикам (Дт 6435 :: Кт 6442)
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаКорректировкиНДС КАК Сумма,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УсловнаяПродажа) КАК СчетДт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,
	|                                    
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалоговыйКредитНеподтвержденный) КАК СчетКт,
    |   Аналитика.Контрагент КАК СубконтоКт1,
    |	Аналитика.Договор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""НДС: корректировка пропорц. НДС по предоплатам за товары/услуги"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
    |
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.АвансыПоставщикам КАК Строки
	|	ПО 
	|		Операция.Ссылка = Строки.Ссылка
	|	
    |	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
    |       РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
    |	ПО 
    |       Строки.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|	
	|ГДЕ
	|	Строки.СуммаКорректировкиНДС <> 0
	|";
#КонецОбласти 

#Область КорректировкаНалоговогоКредита // (Дт 6412 :: Кт 6443)
	КорректировкаНалоговогоКредита = "
	|ВЫБРАТЬ //// Корректировка налогового кредита (Дт 6412 :: Кт 6443)
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаКорректировкиНДС КАК Сумма,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоНДС) КАК СчетДт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,
	|                                    
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КорректировкиНалоговогоКредита) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""НДС: корректировка налогового кредита по пропорц. НДС"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
    |
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.ПараметрыПерерасчетаОС КАК Строки
	|	ПО 
	|		Операция.Ссылка = Строки.Ссылка
	|	
	|ГДЕ
	|	Строки.СуммаКорректировкиНДС <> 0
	|";
#КонецОбласти 

#Область ИзменениеБалансовойСтоимостиОСНМА // (Дт СчетУчетаОСНМА :: Кт 6443 сторно)
	ИзменениеБалансовойСтоимостиОСНМА = "
	|ВЫБРАТЬ //// Изменение балансовой стоимости ОС/НМА на балансе (снят флаг Списан) (Дт СчетУчетаОСНМА :: Кт 6443 сторно)
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	-Строки.СуммаКорректировкиНДС КАК Сумма,
    |
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	ПараметрыОбъектовУчета.Подразделение КАК ПодразделениеДт,
	|	ПараметрыОбъектовУчета.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	ПараметрыОбъектовУчета.НалоговоеНазначение КАК НалоговоеНазначениеДт,
	|
	|	ПараметрыОбъектовУчета.СчетУчета КАК СчетДт,
	|	Строки.НеоборотныйАктив КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
    |	-Строки.СуммаКорректировкиНДС КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,
	|                                    
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КорректировкиНалоговогоКредита) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""НДС: изменение балансовой стоимости в связи с перерасчетом пропорц. НДС"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
    |
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.ПараметрыПерерасчетаОС КАК Строки
	|	ПО 
	|		Операция.Ссылка = Строки.Ссылка
    |
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		ВТПараметрыОбъектовУчета КАК ПараметрыОбъектовУчета
	|	ПО 
	|		Операция.Ссылка = ПараметрыОбъектовУчета.Ссылка
	|		И Строки.НеоборотныйАктив = ПараметрыОбъектовУчета.ОбъектУчета
	|	
	|ГДЕ
	|	Строки.СуммаКорректировкиНДС <> 0
    |	И НЕ Строки.ОССписан 
    |	И ТИПЗНАЧЕНИЯ(Строки.НеоборотныйАктив) <> ТИП(Справочник.Номенклатура)
	|";
    
#КонецОбласти 

#Область АмортизацияОСНМА // (Дт 9Х :: Кт СчетАмортизацииОСНМА)
	АмортизацияОСНМА = "
	|ВЫБРАТЬ //// Амортизация ОС/НМА на балансе (снят флаг Списан) (Дт 9Х :: Кт СчетАмортизацииОСНМА)
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаКорректировкиБУ КАК Сумма,
    |
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.РасходыПриПерерасчетеПропорциональногоНДС) КАК АналитикаУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Операция.Организация КАК СубконтоДт1, 
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.РасходыПриПерерасчетеПропорциональногоНДС) КАК СубконтоДт2,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
    |	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	ПараметрыОбъектовУчета.Подразделение КАК ПодразделениеКт,
	|	ПараметрыОбъектовУчета.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	ПараметрыОбъектовУчета.НалоговоеНазначение КАК НалоговоеНазначениеКт,
	|                                    
	|	ПараметрыОбъектовУчета.СчетНачисленияАмортизации КАК СчетКт,
	|	Строки.НеоборотныйАктив КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.СуммаКорректировкиНУ КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""НДС: изменение накопленной амортизации в связи с перерасчетом пропорц. НДС"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
    |
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.ПараметрыПерерасчетаОС КАК Строки
	|	ПО 
	|		Операция.Ссылка = Строки.Ссылка
    |
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		ВТПараметрыОбъектовУчета КАК ПараметрыОбъектовУчета
	|	ПО 
	|		Операция.Ссылка = ПараметрыОбъектовУчета.Ссылка
	|		И Строки.НеоборотныйАктив = ПараметрыОбъектовУчета.ОбъектУчета
	|	
	|ГДЕ
	|	(Строки.СуммаКорректировкиБУ <> 0 ИЛИ Строки.СуммаКорректировкиНУ <> 0)
    |	И НЕ Строки.ОССписан 
    |	И ТИПЗНАЧЕНИЯ(Строки.НеоборотныйАктив) <> ТИП(Справочник.Номенклатура)
	|";
    
#КонецОбласти 

#Область ИзменениеБалансовойСтоимостиМалоценки // (Дт СчетУчета :: Кт 6443 сторно)
	ИзменениеБалансовойСтоимостиМалоценки = "
	|ВЫБРАТЬ //// Изменение балансовой стоимости малоценки на балансе (снят флаг Списан) (Дт СчетУчета :: Кт 6443 сторно)
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	-Строки.СуммаКорректировкиНДС КАК Сумма,
    |
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦВЭксплуатации) КАК ВидСчетаДт,
	|	Строки.ПартияТМЦВЭксплуатации.КатегорияЭксплуатации КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиДт,
	|	Строки.ПартияТМЦВЭксплуатации.НалоговоеНазначение КАК НалоговоеНазначениеДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.НеоборотныйАктив КАК СубконтоДт1,
    |	Строки.ПартияТМЦВЭксплуатации КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
    |	-Строки.СуммаКорректировкиНДС КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,
	|                                    
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КорректировкиНалоговогоКредита) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""НДС: изменение балансовой стоимости в связи с перерасчетом пропорц. НДС"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
    |
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.ПараметрыПерерасчетаОС КАК Строки
	|	ПО 
	|		Операция.Ссылка = Строки.Ссылка
    |
	|ГДЕ
	|	Строки.СуммаКорректировкиНДС <> 0
    |	И НЕ Строки.ОССписан 
    |	И ТИПЗНАЧЕНИЯ(Строки.НеоборотныйАктив) = ТИП(Справочник.Номенклатура)
	|";
    
#КонецОбласти 

#Область АмортизацияМалоценки // (Дт 9Х :: Кт СчетАмортизацииМалоценки)
	АмортизацияМалоценки = "
	|ВЫБРАТЬ //// Амортизация малоценки на балансе (снят флаг Списан) (Дт 9Х :: Кт СчетАмортизацииМалоценки)
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	-Строки.СуммаКорректировкиНДС КАК Сумма,
    |
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.РасходыПриПерерасчетеПропорциональногоНДС) КАК АналитикаУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Операция.Организация КАК СубконтоДт1, 
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.РасходыПриПерерасчетеПропорциональногоНДС) КАК СубконтоДт2,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
    |	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦВЭксплуатацииАмортизация) КАК ВидСчетаКт,
	|	Строки.ПартияТМЦВЭксплуатации.КатегорияЭксплуатации КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	Строки.ПартияТМЦВЭксплуатации.НалоговоеНазначение КАК НалоговоеНазначениеКт, 
	|                                    
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.НеоборотныйАктив КАК СубконтоКт1,
	|	Строки.ПартияТМЦВЭксплуатации КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	-Строки.СуммаКорректировкиНДС КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""НДС: изменение накопленной амортизации в связи с перерасчетом пропорц. НДС"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
    |
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.ПараметрыПерерасчетаОС КАК Строки
	|	ПО 
	|		Операция.Ссылка = Строки.Ссылка
	|	
	|ГДЕ
	|	Строки.СуммаКорректировкиНДС <> 0
    |	И НЕ Строки.ОССписан 
    |	И ТИПЗНАЧЕНИЯ(Строки.НеоборотныйАктив) = ТИП(Справочник.Номенклатура)
	|";
    
#КонецОбласти 

#Область КорректировкаПоСписаннымНеоборотнымАктивам // (Дт 9X :: Кт 6443 сторно)
	КорректировкаПоСписаннымНеоборотнымАктивам = "
	|ВЫБРАТЬ //// Корректировка по списанным ОС/НМА/малоценке (Дт 9X :: Кт 6443 сторно)
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	-Строки.СуммаКорректировкиНДС КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.РасходыПриПерерасчетеПропорциональногоНДС) КАК АналитикаУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Операция.Организация КАК СубконтоДт1, 
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.РасходыПриПерерасчетеПропорциональногоНДС) КАК СубконтоДт2,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КорректировкиНалоговогоКредита) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""НДС: корректировка пропорц. НДС по списанным необоротным активам"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
    |
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.ПараметрыПерерасчетаОС КАК Строки
	|	ПО 
	|		Операция.Ссылка = Строки.Ссылка
    |
	|ГДЕ
	|	Операция.СуммаКорректировкиНДС <> 0
    |	И Строки.ОССписан 
	|";
    
#КонецОбласти 

	Возврат КорректировкаНаЗатраты
		+ " ОБЪЕДИНИТЬ ВСЕ " + КорректировкаАвансовПоставщикам
        + " ОБЪЕДИНИТЬ ВСЕ " + КорректировкаНалоговогоКредита
        + " ОБЪЕДИНИТЬ ВСЕ " + ИзменениеБалансовойСтоимостиОСНМА
        + " ОБЪЕДИНИТЬ ВСЕ " + АмортизацияОСНМА
        + " ОБЪЕДИНИТЬ ВСЕ " + ИзменениеБалансовойСтоимостиМалоценки
        + " ОБЪЕДИНИТЬ ВСЕ " + АмортизацияМалоценки
        + " ОБЪЕДИНИТЬ ВСЕ " + КорректировкаПоСписаннымНеоборотнымАктивам
		;

КонецФункции

// Функция возвращает текст запроса дополнительных временных таблиц, 
// необходимых для отражения в регламетированном учете
//
Функция ТекстЗапросаВТОтраженияВРеглУчетеУКР() Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ПараметрыПерерасчетаОС.Ссылка КАК Ссылка,
	|	ПараметрыПерерасчетаОС.Ссылка.Организация КАК Организация,
	|	ПараметрыПерерасчетаОС.НеоборотныйАктив КАК НеоборотныйАктив
    |ПОМЕСТИТЬ ПараметрыПерерасчетаОС
	|ИЗ Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.ПараметрыПерерасчетаОС КАК ПараметрыПерерасчетаОС
    |   ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКОтражению
	|   ПО ДокументыКОтражению.Ссылка = ПараметрыПерерасчетаОС.Ссылка
    |;
	|ВЫБРАТЬ
	|	ПараметрыПерерасчетаОС.Ссылка КАК Ссылка,
	|	ПараметрыПерерасчетаОС.Организация КАК Организация,
	|	ПараметрыПерерасчетаОС.НеоборотныйАктив КАК ОбъектУчета,
	|	ОбъектыУчета.НаправлениеДеятельности,
	|	ЕСТЬNULL(СчетаОтражения.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) КАК СчетУчета,
    |	ЕСТЬNULL(СчетаОтражения.СчетНачисленияАмортизации, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) КАК СчетНачисленияАмортизации,
    |	ЕСТЬNULL(НалоговыеНазначенияОС.НалоговоеНазначение, ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка)) КАК НалоговоеНазначение,
	|	ЕСТЬNULL(Местонахождения.Местонахождение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение
	|ПОМЕСТИТЬ ВТПараметрыОбъектовУчета
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыПерерасчетаОС КАК ПараметрыПерерасчетаОС
	|		ПО ДокументыКОтражению.Ссылка = ПараметрыПерерасчетаОС.Ссылка
	|		И (ПараметрыПерерасчетаОС.НеоборотныйАктив ССЫЛКА Справочник.ОбъектыЭксплуатации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыЭксплуатации КАК ОбъектыУчета
	|		ПО (ПараметрыПерерасчетаОС.НеоборотныйАктив = ОбъектыУчета.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|				&Дата,
	|				(Организация, ОсновноеСредство) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.НеоборотныйАктив
	|					ИЗ
	|						ПараметрыПерерасчетаОС КАК Т)) КАК СчетаОтражения
	|		ПО (ПараметрыПерерасчетаОС.НеоборотныйАктив = СчетаОтражения.ОсновноеСредство)
	|			И (ПараметрыПерерасчетаОС.Организация = СчетаОтражения.Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалоговыеНазначенияОС.СрезПоследних(
	|				&Дата,
	|				(Организация, ОсновноеСредство) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.НеоборотныйАктив
	|					ИЗ
	|						ПараметрыПерерасчетаОС КАК Т)) КАК НалоговыеНазначенияОС
	|		ПО (ПараметрыПерерасчетаОС.НеоборотныйАктив = НалоговыеНазначенияОС.ОсновноеСредство)
	|			И (ПараметрыПерерасчетаОС.Организация = НалоговыеНазначенияОС.Организация)
    |
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(
	|				&Дата,
	|				(Организация, ОсновноеСредство) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.НеоборотныйАктив
	|					ИЗ
	|						ПараметрыПерерасчетаОС КАК Т)) КАК Местонахождения
	|		ПО (ПараметрыПерерасчетаОС.НеоборотныйАктив = Местонахождения.ОсновноеСредство)
	|			И (ПараметрыПерерасчетаОС.Организация = Местонахождения.Организация)
    |
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыУчета.НаправлениеДеятельности,
	|	ПараметрыПерерасчетаОС.Ссылка,
	|	ПараметрыПерерасчетаОС.НеоборотныйАктив,
	|	ПараметрыПерерасчетаОС.Организация,
	|	ЕСТЬNULL(СчетаОтражения.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)),
    |	ЕСТЬNULL(СчетаОтражения.СчетНачисленияАмортизации, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)),
    |	ЕСТЬNULL(НалоговыеНазначенияОС.НалоговоеНазначение, ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка)),
	|	ЕСТЬNULL(Местонахождения.Местонахождение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПараметрыПерерасчетаОС.Ссылка,
	|	ПараметрыПерерасчетаОС.Организация,
	|	ПараметрыПерерасчетаОС.НеоборотныйАктив,
	|	ОбъектыУчета.НаправлениеДеятельности,
	|	ЕСТЬNULL(СчетаОтражения.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) КАК СчетУчета,
    |	ЕСТЬNULL(СчетаОтражения.СчетНачисленияАмортизации, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) КАК СчетНачисленияАмортизации,
    |	ЕСТЬNULL(ПервоначальныеСведенияНМАНалоговыйУчет.НалоговоеНазначение, ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка)) КАК НалоговоеНазначение,
	|	ЕСТЬNULL(Местонахождения.Местонахождение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыПерерасчетаОС КАК ПараметрыПерерасчетаОС
	|		ПО ДокументыКОтражению.Ссылка = ПараметрыПерерасчетаОС.Ссылка
	|		И (ПараметрыПерерасчетаОС.НеоборотныйАктив ССЫЛКА Справочник.НематериальныеАктивы)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НематериальныеАктивы КАК ОбъектыУчета
	|		ПО (ПараметрыПерерасчетаОС.НеоборотныйАктив = ОбъектыУчета.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(
	|				&Дата,
	|				(Организация, НематериальныйАктив) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.НеоборотныйАктив
	|					ИЗ
	|						ПараметрыПерерасчетаОС КАК Т)) КАК СчетаОтражения
	|		ПО (ПараметрыПерерасчетаОС.НеоборотныйАктив = СчетаОтражения.НематериальныйАктив)
	|			И (ПараметрыПерерасчетаОС.Организация = СчетаОтражения.Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияНМАНалоговыйУчет.СрезПоследних(
	|				&Дата,
	|				(Организация, НематериальныйАктив) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.НеоборотныйАктив
	|					ИЗ
	|						ПараметрыПерерасчетаОС КАК Т)) КАК ПервоначальныеСведенияНМАНалоговыйУчет
	|		ПО (ПараметрыПерерасчетаОС.НеоборотныйАктив = ПервоначальныеСведенияНМАНалоговыйУчет.НематериальныйАктив)
	|			И (ПараметрыПерерасчетаОС.Организация = ПервоначальныеСведенияНМАНалоговыйУчет.Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеНМАБухгалтерскийУчет.СрезПоследних(
	|				&Дата,
	|				(Организация, НематериальныйАктив) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.НеоборотныйАктив
	|					ИЗ
	|						ПараметрыПерерасчетаОС КАК Т)) КАК Местонахождения
	|		ПО (ПараметрыПерерасчетаОС.НеоборотныйАктив = Местонахождения.НематериальныйАктив)
	|			И (ПараметрыПерерасчетаОС.Организация = Местонахождения.Организация)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыУчета.НаправлениеДеятельности,
	|	ПараметрыПерерасчетаОС.Ссылка,
	|	ПараметрыПерерасчетаОС.НеоборотныйАктив,
	|	ПараметрыПерерасчетаОС.Организация,
	|	ЕСТЬNULL(СчетаОтражения.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)),
    |	ЕСТЬNULL(СчетаОтражения.СчетНачисленияАмортизации, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)),
    |	ЕСТЬNULL(ПервоначальныеСведенияНМАНалоговыйУчет.НалоговоеНазначение, ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка)),
	|	ЕСТЬNULL(Местонахождения.Местонахождение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	ОбъектУчета
	|;
	|";
    
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти 	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт
	
	ИсточникиДанных = Новый Соответствие;
	Возврат ИсточникиДанных;
	
КонецФункции

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
    
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
    
    Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                   КАК Ссылка,
	|	ДанныеДокумента.Дата                     КАК Период,
    |
	|	ДанныеДокумента.Организация              КАК Организация,
	|	ДанныеДокумента.СпецРежимНалогообложения КАК СпецРежимНалогообложения,
	|	ДанныеДокумента.СуммаКорректировкиНДС 	 КАК СуммаКорректировкиНДС
	|
	|ИЗ
	|	Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|";
    
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
    
	Запрос.УстановитьПараметр("Период",                             Реквизиты.Период);
    Запрос.УстановитьПараметр("Граница",                            Новый Граница(КонецМесяца(Реквизиты.Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",                        Реквизиты.Организация);
	Запрос.УстановитьПараметр("СпецРежимНалогообложения",           Реквизиты.СпецРежимНалогообложения);
    
    Запрос.УстановитьПараметр("СтатьяРасходовПриПерерасчетеПропорциональногоНДС", ПланыВидовХарактеристик.СтатьиРасходов.РасходыПриПерерасчетеПропорциональногоНДС);
    Запрос.УстановитьПараметр("НалоговоеНазначениеОблагаемое",       Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
    Запрос.УстановитьПараметр("НалоговоеНазначениеПропорциональное", Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально);
    Запрос.УстановитьПараметр("ФормироватьФинансовыйРезультат",      ПолучитьФункциональнуюОпцию("ФормироватьФинансовыйРезультат"));
    Запрос.УстановитьПараметр("ВидПоставки",                         Перечисления.ВидыПоставки.Поставка);
    
    Запрос.УстановитьПараметр("ГраничнаяДатаНачалаИспользованияОС",  НачалоГода(ДобавитьМесяц(Реквизиты.Период, - 36)));
	Запрос.УстановитьПараметр("СуммаКорректировкиНДС",  			 Реквизиты.СуммаКорректировкиНДС);	
	
КонецПроцедуры

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
    
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
    
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
    
    ТекстЗапросаТаблицаПрочиеРасходы(Запрос, ТекстыЗапроса, Регистры);
    ТекстЗапросаТаблицаНДССоставПоставкиДляРегистрацииВходящихНалоговыхДокументов(Запрос, ТекстыЗапроса, Регистры);
    ТекстЗапросаТаблицаСтоимостьПриобретенияОСПропорциональноОблагаемыхНДС(Запрос, ТекстыЗапроса, Регистры);
    
    ТекстЗапросаТаблицаПервоначальныеСведенияОСБухгалтерскийУчет(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаПервоначальныеСведенияОСНалоговыйУчет(Запрос, ТекстыЗапроса, Регистры);
    ТекстЗапросаТаблицаПараметрыАмортизацииОСБухгалтерскийУчет(Запрос, ТекстыЗапроса, Регистры);
    ТекстЗапросаТаблицаПараметрыАмортизацииОСНалоговыйУчет(Запрос, ТекстыЗапроса, Регистры);
    ТекстЗапросаТаблицаПервоначальныеСведенияНМАБухгалтерскийУчет(Запрос, ТекстыЗапроса, Регистры);
    ТекстЗапросаТаблицаПервоначальныеСведенияНМАНалоговыйУчет(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаСуммыКорректировокПропорциональногоНДС(Запрос, ТекстыЗапроса, Регистры);
    
	////////////////////////////////////////////////////////////////////////////
	// Поместим результаты запроса в дополнительные свойства
	
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаПрочиеРасходы(Запрос, ТекстыЗапроса, Регистры)
    
	ИмяРегистра = "ПрочиеРасходы";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
    КонецЕсли;
	
	ТекстЗапроса = "
    // Сумма корректировки затрат (БУ) - приход 
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
    |
	|	&Организация КАК Организация,
	|	Неопределено КАК Подразделение,
    |   &НалоговоеНазначениеОблагаемое КАК НалоговоеНазначение,
	|	&СтатьяРасходовПриПерерасчетеПропорциональногоНДС КАК СтатьяРасходов,
    |	&Организация КАК АналитикаРасходов,
    |
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	ДанныеДокумента.СуммаКорректировкиБУ КАК СуммаРегл,
    |	ДанныеДокумента.СуммаКорректировкиБУ КАК СуммаРеглБезНДС,
	|	0 КАК НДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница, 
    |
    |	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПерерасчетПропорциональногоНДС) КАК ХозяйственнаяОперация
	|ИЗ
	|	Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И НЕ ДанныеДокумента.СуммаКорректировкиБУ = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
    // Сумма корректировки затрат (БУ) - расход, если не формируем финансовый результат
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
    |
	|	&Организация КАК Организация,
	|	Неопределено КАК Подразделение,
    |   &НалоговоеНазначениеОблагаемое КАК НалоговоеНазначение,
	|	&СтатьяРасходовПриПерерасчетеПропорциональногоНДС КАК СтатьяРасходов,
    |	&Организация КАК АналитикаРасходов,
    |
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	ДанныеДокумента.СуммаКорректировкиБУ КАК СуммаРегл,
    |	ДанныеДокумента.СуммаКорректировкиБУ КАК СуммаРеглБезНДС,
	|	0 КАК НДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница, 
    |
    |	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПерерасчетПропорциональногоНДС) КАК ХозяйственнаяОперация
	|ИЗ
	|	Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И НЕ ДанныеДокумента.СуммаКорректировкиБУ = 0
	|	И НЕ &ФормироватьФинансовыйРезультат    
	|
	|ОБЪЕДИНИТЬ ВСЕ
	// По ТЧ «Перерасчет ОС» для ОС/НМА на балансе (снят флаг Списан) - приход
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
    |
	|	&Организация КАК Организация,
	|	Неопределено КАК Подразделение,
    |   &НалоговоеНазначениеОблагаемое КАК НалоговоеНазначение,
	|	&СтатьяРасходовПриПерерасчетеПропорциональногоНДС КАК СтатьяРасходов,
    |	&Организация КАК АналитикаРасходов,
    |
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	ПараметрыПерерасчетаОС.СуммаКорректировкиБУ КАК СуммаРегл,
    |	ПараметрыПерерасчетаОС.СуммаКорректировкиБУ КАК СуммаРеглБезНДС,
	|	0 КАК НДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница, 
    |
    |	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПерерасчетПропорциональногоНДС) КАК ХозяйственнаяОперация
	|ИЗ
	|	Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.ПараметрыПерерасчетаОС КАК ПараметрыПерерасчетаОС
	|ГДЕ
	|	ПараметрыПерерасчетаОС.Ссылка = &Ссылка
	|	И НЕ ПараметрыПерерасчетаОС.СуммаКорректировкиБУ = 0
    |	И НЕ ПараметрыПерерасчетаОС.ОССписан
    |	И ТИПЗНАЧЕНИЯ(ПараметрыПерерасчетаОС.НеоборотныйАктив) <> ТИП(Справочник.Номенклатура)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	// По ТЧ «Перерасчет ОС» для ОС/НМА на балансе (снят флаг Списан) - расход, если не формируем финансовый результат
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
    |
	|	&Организация КАК Организация,
	|	Неопределено КАК Подразделение,
    |   &НалоговоеНазначениеОблагаемое КАК НалоговоеНазначение,
	|	&СтатьяРасходовПриПерерасчетеПропорциональногоНДС КАК СтатьяРасходов,
    |	&Организация КАК АналитикаРасходов,
    |
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	ПараметрыПерерасчетаОС.СуммаКорректировкиБУ КАК СуммаРегл,
    |	ПараметрыПерерасчетаОС.СуммаКорректировкиБУ КАК СуммаРеглБезНДС,
	|	0 КАК НДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница, 
    |
    |	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПерерасчетПропорциональногоНДС) КАК ХозяйственнаяОперация
	|ИЗ
	|	Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.ПараметрыПерерасчетаОС КАК ПараметрыПерерасчетаОС
	|ГДЕ
	|	ПараметрыПерерасчетаОС.Ссылка = &Ссылка
	|	И НЕ ПараметрыПерерасчетаОС.СуммаКорректировкиБУ = 0
    |	И НЕ ПараметрыПерерасчетаОС.ОССписан
    |	И ТИПЗНАЧЕНИЯ(ПараметрыПерерасчетаОС.НеоборотныйАктив) <> ТИП(Справочник.Номенклатура)
    |	И НЕ &ФормироватьФинансовыйРезультат   
    |
	|
	|ОБЪЕДИНИТЬ ВСЕ
	// По ТЧ «Перерасчет ОС» для малоценки на балансе (снят флаг Списан) - приход
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
    |
	|	&Организация КАК Организация,
	|	Неопределено КАК Подразделение,
    |   &НалоговоеНазначениеОблагаемое КАК НалоговоеНазначение,
	|	&СтатьяРасходовПриПерерасчетеПропорциональногоНДС КАК СтатьяРасходов,
    |	&Организация КАК АналитикаРасходов,
    |
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	-ПараметрыПерерасчетаОС.СуммаКорректировкиНДС КАК СуммаРегл,
    |	-ПараметрыПерерасчетаОС.СуммаКорректировкиНДС КАК СуммаРеглБезНДС,
	|	0 КАК НДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница, 
    |
    |	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПерерасчетПропорциональногоНДС) КАК ХозяйственнаяОперация
	|ИЗ
	|	Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.ПараметрыПерерасчетаОС КАК ПараметрыПерерасчетаОС
	|ГДЕ
	|	ПараметрыПерерасчетаОС.Ссылка = &Ссылка
	|	И НЕ ПараметрыПерерасчетаОС.СуммаКорректировкиНДС = 0
    |	И НЕ ПараметрыПерерасчетаОС.ОССписан
    |	И ТИПЗНАЧЕНИЯ(ПараметрыПерерасчетаОС.НеоборотныйАктив) = ТИП(Справочник.Номенклатура)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	// По ТЧ «Перерасчет ОС» для малоценки на балансе (снят флаг Списан) - расход, если не формируем финансовый результат
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
    |
	|	&Организация КАК Организация,
	|	Неопределено КАК Подразделение,
    |   &НалоговоеНазначениеОблагаемое КАК НалоговоеНазначение,
	|	&СтатьяРасходовПриПерерасчетеПропорциональногоНДС КАК СтатьяРасходов,
    |	&Организация КАК АналитикаРасходов,
    |
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	-ПараметрыПерерасчетаОС.СуммаКорректировкиНДС КАК СуммаРегл,
    |	-ПараметрыПерерасчетаОС.СуммаКорректировкиНДС КАК СуммаРеглБезНДС,
	|	0 КАК НДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница, 
    |
    |	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПерерасчетПропорциональногоНДС) КАК ХозяйственнаяОперация
	|ИЗ
	|	Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.ПараметрыПерерасчетаОС КАК ПараметрыПерерасчетаОС
	|ГДЕ
	|	ПараметрыПерерасчетаОС.Ссылка = &Ссылка
	|	И НЕ ПараметрыПерерасчетаОС.СуммаКорректировкиНДС = 0
    |	И НЕ ПараметрыПерерасчетаОС.ОССписан
    |	И ТИПЗНАЧЕНИЯ(ПараметрыПерерасчетаОС.НеоборотныйАктив) = ТИП(Справочник.Номенклатура)
    |	И НЕ &ФормироватьФинансовыйРезультат   
	|
	|ОБЪЕДИНИТЬ ВСЕ
	// По ТЧ «Перерасчет ОС» для списанных ОС/НМА/малоценки (установлен флаг Списан) - приход
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
    |
	|	&Организация КАК Организация,
	|	Неопределено КАК Подразделение,
    |   &НалоговоеНазначениеОблагаемое КАК НалоговоеНазначение,
	|	&СтатьяРасходовПриПерерасчетеПропорциональногоНДС КАК СтатьяРасходов,
    |	&Организация КАК АналитикаРасходов,
    |
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	-ПараметрыПерерасчетаОС.СуммаКорректировкиНДС КАК СуммаРегл,
    |	-ПараметрыПерерасчетаОС.СуммаКорректировкиНДС КАК СуммаРеглБезНДС,
	|	0 КАК НДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница, 
    |
    |	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПерерасчетПропорциональногоНДС) КАК ХозяйственнаяОперация
	|ИЗ
	|	Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.ПараметрыПерерасчетаОС КАК ПараметрыПерерасчетаОС
	|ГДЕ
	|	ПараметрыПерерасчетаОС.Ссылка = &Ссылка
	|	И НЕ ПараметрыПерерасчетаОС.СуммаКорректировкиНДС = 0
    |	И ПараметрыПерерасчетаОС.ОССписан
	|
	|ОБЪЕДИНИТЬ ВСЕ
	// По ТЧ «Перерасчет ОС» для списанных ОС/НМА/малоценки (установлен флаг Списан) - расход, если не формируем финансовый результат
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
    |
	|	&Организация КАК Организация,
	|	Неопределено КАК Подразделение,
    |   &НалоговоеНазначениеОблагаемое КАК НалоговоеНазначение,
	|	&СтатьяРасходовПриПерерасчетеПропорциональногоНДС КАК СтатьяРасходов,
    |	&Организация КАК АналитикаРасходов,
    |
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	-ПараметрыПерерасчетаОС.СуммаКорректировкиНДС КАК СуммаРегл,
    |	-ПараметрыПерерасчетаОС.СуммаКорректировкиНДС КАК СуммаРеглБезНДС,
	|	0 КАК НДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница, 
    |
    |	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПерерасчетПропорциональногоНДС) КАК ХозяйственнаяОперация
	|ИЗ
	|	Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.ПараметрыПерерасчетаОС КАК ПараметрыПерерасчетаОС
	|ГДЕ
	|	ПараметрыПерерасчетаОС.Ссылка = &Ссылка
	|	И НЕ ПараметрыПерерасчетаОС.СуммаКорректировкиНДС = 0
    |	И ПараметрыПерерасчетаОС.ОССписан
    |	И НЕ &ФормироватьФинансовыйРезультат   
    |
    |";
    
    ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаНДССоставПоставкиДляРегистрацииВходящихНалоговыхДокументов(Запрос, ТекстыЗапроса, Регистры)
    
	ИмяРегистра = "НДССоставПоставкиДляРегистрацииВходящихНалоговыхДокументов";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
    КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
    |	&Период КАК Период,
    |
	|	АвансыПоставщикам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	&Ссылка КАК ОбъектРасчетов,	
	|	&ВидПоставки КАК ВидПоставки,
	|	АвансыПоставщикам.СтавкаНДС КАК СтавкаНДС,
	|	&НалоговоеНазначениеПропорциональное КАК НалоговоеНазначение,
    |
	|	0 КАК СуммаВзаиморасчетов,
	|	АвансыПоставщикам.СуммаКорректировкиНДС КАК СуммаНДСКредит,
	|
	|	НЕОПРЕДЕЛЕНО КАК ДатаВходящегоНалоговогоДокумента,
    |	НЕОПРЕДЕЛЕНО КАК ДокументПоставки
	|ИЗ
	|	Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.АвансыПоставщикам КАК АвансыПоставщикам
	|ГДЕ
	|	АвансыПоставщикам.Ссылка = &Ссылка
	|	И НЕ АвансыПоставщикам.СуммаКорректировкиНДС = 0
    |
    |";
    
    ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаСтоимостьПриобретенияОСПропорциональноОблагаемыхНДС(Запрос, ТекстыЗапроса, Регистры)
    
	ИмяРегистра = "СтоимостьПриобретенияОСПропорциональноОблагаемыхНДС";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
    КонецЕсли;
	
	ТекстЗапроса = "
    // приход по суммам корректировки НДС
	|ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
    |
	|	&Организация КАК Организация,
	|	ПараметрыПерерасчетаОС.НеоборотныйАктив КАК НеоборотныйАктив,
    |	ПараметрыПерерасчетаОС.ПартияТМЦВЭксплуатации КАК ПартияТМЦВЭксплуатации,
    |	ПараметрыПерерасчетаОС.ДатаНачалаИспользования КАК ДатаНачалаИспользования,
    |	&СпецРежимНалогообложения КАК СпецРежимНалогообложения,
    |
    |	0 КАК БазаНДС,
    |	0 КАК СуммаНДС,
    |	ПараметрыПерерасчетаОС.СуммаКорректировкиНДС КАК СуммаНДСПропорциональноКредит
	|ИЗ
	|	Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.ПараметрыПерерасчетаОС КАК ПараметрыПерерасчетаОС
	|ГДЕ
	|	ПараметрыПерерасчетаОС.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
    |
    // закрытие остатков в регистре по ОС, которые эксплуатируются более 36 месяцев
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
    |
    |	&Организация КАК Организация,
    |	СтоимостьПриобретенияОСПропорциональноОблагаемыхНДСОстатки.НеоборотныйАктив,
    |	СтоимостьПриобретенияОСПропорциональноОблагаемыхНДСОстатки.ПартияТМЦВЭксплуатации,
    |	СтоимостьПриобретенияОСПропорциональноОблагаемыхНДСОстатки.ДатаНачалаИспользования,
    |	&СпецРежимНалогообложения КАК СпецРежимНалогообложения,
    |
    |	СтоимостьПриобретенияОСПропорциональноОблагаемыхНДСОстатки.БазаНДСОстаток КАК БазаНДС,
    |	СтоимостьПриобретенияОСПропорциональноОблагаемыхНДСОстатки.СуммаНДСОстаток КАК СуммаНДС,
    |	СтоимостьПриобретенияОСПропорциональноОблагаемыхНДСОстатки.СуммаНДСПропорциональноКредитОстаток КАК СуммаНДСПропорциональноКредит
    |ИЗ
    |	РегистрНакопления.СтоимостьПриобретенияОСПропорциональноОблагаемыхНДС.Остатки(&Период, ДатаНачалаИспользования < &ГраничнаяДатаНачалаИспользованияОС И Организация = &Организация И СпецРежимНалогообложения = &СпецРежимНалогообложения) КАК СтоимостьПриобретенияОСПропорциональноОблагаемыхНДСОстатки
    |
    |";
		
    ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтОС(Запрос, ТекстыЗапроса)
    
    ИмяРегистра = "ВтОС";
    
    ТекстЗапроса = "
    |ВЫБРАТЬ 
    |	ПараметрыПерерасчетаОС.НеоборотныйАктив КАК ОС
    |
    |ПОМЕСТИТЬ ВтОС
    |
	|ИЗ 
    |   Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.ПараметрыПерерасчетаОС КАК ПараметрыПерерасчетаОС
	|ГДЕ 
	|	ПараметрыПерерасчетаОС.Ссылка = &Ссылка
    |	И НЕ ПараметрыПерерасчетаОС.ОССписан
    |	И ТИПЗНАЧЕНИЯ(ПараметрыПерерасчетаОС.НеоборотныйАктив) = ТИП(Справочник.ОбъектыЭксплуатации)
    |";
    // НематериальныеАктивы
    
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтПервоначальныеСведенияОСБухгалтерскийУчет(Запрос, ТекстыЗапроса)
    
    ИмяРегистра = "ВтПервоначальныеСведенияОСБухгалтерскийУчет";
    
    Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтОС", ТекстыЗапроса) Тогда
    	ТекстЗапросаВтОС(Запрос, ТекстыЗапроса);
    КонецЕсли; 
    
    ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	ПервоначальныеСведенияОС.ОсновноеСредство            КАК ОсновноеСредство,
	|	ПервоначальныеСведенияОС.Организация                 КАК Организация,
	|	ПервоначальныеСведенияОС.ИнвентарныйНомер            КАК ИнвентарныйНомер,
	|	ПервоначальныеСведенияОС.ПервоначальнаяСтоимость     КАК ПервоначальнаяСтоимость,
	|	ПервоначальныеСведенияОС.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	ПервоначальныеСведенияОС.ПоказательНаработки         КАК ПоказательНаработки,
	|	ПервоначальныеСведенияОС.ЛиквидационнаяСтоимость     КАК ЛиквидационнаяСтоимость
    |
    |ПОМЕСТИТЬ ВтПервоначальныеСведенияОСБухгалтерскийУчет
    |
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
	|			&Граница,
	|			Регистратор <> &Ссылка
	|				И Организация = &Организация
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						Т.ОС
	|					ИЗ
	|						ВтОС КАК Т)) КАК ПервоначальныеСведенияОС
	|";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПервоначальныеСведенияОСБухгалтерскийУчет(Запрос, ТекстыЗапроса, Регистры)
    
    ИмяРегистра = "ПервоначальныеСведенияОСБухгалтерскийУчет";
    
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
    КонецЕсли;
    
    Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтПервоначальныеСведенияОСБухгалтерскийУчет", ТекстыЗапроса) Тогда
    	ТекстЗапросаВтПервоначальныеСведенияОСБухгалтерскийУчет(Запрос, ТекстыЗапроса);
    КонецЕсли; 
    
    ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	ПервоначальныеСведенияОС.ОсновноеСредство            КАК ОсновноеСредство,
	|	ПервоначальныеСведенияОС.Организация                 КАК Организация,
	|	ПервоначальныеСведенияОС.ИнвентарныйНомер            КАК ИнвентарныйНомер,
	|	ПервоначальныеСведенияОС.ПервоначальнаяСтоимость-ПараметрыПерерасчетаОС.СуммаКорректировкиНДС КАК ПервоначальнаяСтоимость,
	|	ПервоначальныеСведенияОС.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	ПервоначальныеСведенияОС.ПоказательНаработки         КАК ПоказательНаработки,
	|	ПервоначальныеСведенияОС.ЛиквидационнаяСтоимость     КАК ЛиквидационнаяСтоимость
	|ИЗ
	|	ВтПервоначальныеСведенияОСБухгалтерскийУчет КАК ПервоначальныеСведенияОС
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.ПараметрыПерерасчетаОС КАК ПараметрыПерерасчетаОС
	|	ПО 
	|		ПараметрыПерерасчетаОС.Ссылка = &Ссылка
    |		И ПараметрыПерерасчетаОС.НеоборотныйАктив = ПервоначальныеСведенияОС.ОсновноеСредство
    |	    И НЕ ПараметрыПерерасчетаОС.ОССписан
	|";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтПервоначальныеСведенияОСНалоговыйУчет(Запрос, ТекстыЗапроса)
    
    ИмяРегистра = "ВтПервоначальныеСведенияОСНалоговыйУчет";
    
    Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтОС", ТекстыЗапроса) Тогда
    	ТекстЗапросаВтОС(Запрос, ТекстыЗапроса);
    КонецЕсли; 
    
    ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	ПервоначальныеСведенияОС.ОсновноеСредство              КАК ОсновноеСредство,
	|	ПервоначальныеСведенияОС.Организация                   КАК Организация,
	|	ПервоначальныеСведенияОС.НалоговоеНазначение           КАК НалоговоеНазначение,
	|	ПервоначальныеСведенияОС.ПервоначальнаяСтоимостьНУ     КАК ПервоначальнаяСтоимостьНУ,
	|	ПервоначальныеСведенияОС.СпособНачисленияАмортизацииНУ КАК СпособНачисленияАмортизацииНУ,
	|	ПервоначальныеСведенияОС.НалоговаяГруппаОС             КАК НалоговаяГруппаОС
    |
    |ПОМЕСТИТЬ ВтПервоначальныеСведенияОСНалоговыйУчет
    |
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.СрезПоследних(
	|			&Граница,
	|			Регистратор <> &Ссылка
	|				И Организация = &Организация
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						Т.ОС
	|					ИЗ
	|						ВтОС КАК Т)) КАК ПервоначальныеСведенияОС
	|";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПервоначальныеСведенияОСНалоговыйУчет(Запрос, ТекстыЗапроса, Регистры)
    
    ИмяРегистра = "ПервоначальныеСведенияОСНалоговыйУчет";
    
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
    КонецЕсли;
    
    Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтПервоначальныеСведенияОСНалоговыйУчет", ТекстыЗапроса) Тогда
    	ТекстЗапросаВтПервоначальныеСведенияОСНалоговыйУчет(Запрос, ТекстыЗапроса);
    КонецЕсли; 
    
    ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	ПервоначальныеСведенияОС.ОсновноеСредство              КАК ОсновноеСредство,
	|	ПервоначальныеСведенияОС.Организация                   КАК Организация,
	|	ПервоначальныеСведенияОС.НалоговоеНазначение           КАК НалоговоеНазначение,
	|	ПервоначальныеСведенияОС.ПервоначальнаяСтоимостьНУ-ПараметрыПерерасчетаОС.СуммаКорректировкиНДС КАК ПервоначальнаяСтоимостьНУ,
	|	ПервоначальныеСведенияОС.СпособНачисленияАмортизацииНУ КАК СпособНачисленияАмортизацииНУ,
	|	ПервоначальныеСведенияОС.НалоговаяГруппаОС             КАК НалоговаяГруппаОС
	|ИЗ
	|	ВтПервоначальныеСведенияОСНалоговыйУчет КАК ПервоначальныеСведенияОС
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.ПараметрыПерерасчетаОС КАК ПараметрыПерерасчетаОС
	|	ПО 
	|		ПараметрыПерерасчетаОС.Ссылка = &Ссылка
    |		И ПараметрыПерерасчетаОС.НеоборотныйАктив = ПервоначальныеСведенияОС.ОсновноеСредство
    |	    И НЕ ПараметрыПерерасчетаОС.ОССписан
	|";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтПараметрыАмортизацииОСБухгалтерскийУчет(Запрос, ТекстыЗапроса)
    
    ИмяРегистра = "ВтПараметрыАмортизацииОСБухгалтерскийУчет";
    
    Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтОС", ТекстыЗапроса) Тогда
    	ТекстЗапросаВтОС(Запрос, ТекстыЗапроса);
    КонецЕсли; 
    
    ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	ПараметрыАмортизацииОС.ОсновноеСредство                            КАК ОсновноеСредство,
	|	ПараметрыАмортизацииОС.Организация                                 КАК Организация,
	|	ПараметрыАмортизацииОС.СрокПолезногоИспользования                  КАК СрокПолезногоИспользования,
	|	ПараметрыАмортизацииОС.ОбъемПродукцииРабот                         КАК ОбъемПродукцииРабот,
	|	ПараметрыАмортизацииОС.СрокИспользованияДляВычисленияАмортизации   КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.СтоимостьДляВычисленияАмортизации           КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации
    |
    |ПОМЕСТИТЬ ВтПараметрыАмортизацииОСБухгалтерскийУчет
    |
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|			&Граница,
	|			Регистратор <> &Ссылка
	|			И Организация = &Организация
	|			И ОсновноеСредство В (ВЫБРАТЬ Т.ОС ИЗ ВтОС КАК Т)
	|	) КАК ПараметрыАмортизацииОС
	|";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПараметрыАмортизацииОСБухгалтерскийУчет(Запрос, ТекстыЗапроса, Регистры)
    
    ИмяРегистра = "ПараметрыАмортизацииОСБухгалтерскийУчет";
    
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
    КонецЕсли;
    
    Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтПараметрыАмортизацииОСБухгалтерскийУчет", ТекстыЗапроса) Тогда
    	ТекстЗапросаВтПараметрыАмортизацииОСБухгалтерскийУчет(Запрос, ТекстыЗапроса);
    КонецЕсли; 
    
    ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	ПараметрыАмортизацииОС.ОсновноеСредство                            КАК ОсновноеСредство,
	|	ПараметрыАмортизацииОС.Организация                                 КАК Организация,
	|	ПараметрыАмортизацииОС.СрокПолезногоИспользования                  КАК СрокПолезногоИспользования,
	|	ПараметрыАмортизацииОС.ОбъемПродукцииРабот                         КАК ОбъемПродукцииРабот,
	|	ПараметрыАмортизацииОС.СрокИспользованияДляВычисленияАмортизации   КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.СтоимостьДляВычисленияАмортизации-ПараметрыПерерасчетаОС.СуммаКорректировкиНДС КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации
    |
	|ИЗ
	|	ВтПараметрыАмортизацииОСБухгалтерскийУчет КАК ПараметрыАмортизацииОС
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.ПараметрыПерерасчетаОС КАК ПараметрыПерерасчетаОС
	|	ПО 
	|		ПараметрыПерерасчетаОС.Ссылка = &Ссылка
    |		И ПараметрыПерерасчетаОС.НеоборотныйАктив = ПараметрыАмортизацииОС.ОсновноеСредство
    |	    И НЕ ПараметрыПерерасчетаОС.ОССписан
	|";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтПараметрыАмортизацииОСНалоговыйУчет(Запрос, ТекстыЗапроса)
    
    ИмяРегистра = "ВтПараметрыАмортизацииОСНалоговыйУчет";
    
    Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтОС", ТекстыЗапроса) Тогда
    	ТекстЗапросаВтОС(Запрос, ТекстыЗапроса);
    КонецЕсли; 
    
    ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	ПараметрыАмортизацииОС.ОсновноеСредство                          КАК ОсновноеСредство,
	|	ПараметрыАмортизацииОС.Организация                               КАК Организация,
	|	ПараметрыАмортизацииОС.СрокПолезногоИспользования                КАК СрокПолезногоИспользования,
	|	ПараметрыАмортизацииОС.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.СтоимостьДляВычисленияАмортизации         КАК СтоимостьДляВычисленияАмортизации
    |
    |ПОМЕСТИТЬ ВтПараметрыАмортизацииОСНалоговыйУчет
    |
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет.СрезПоследних(
	|			&Граница,
	|			Регистратор <> &Ссылка
	|			И Организация = &Организация
	|			И ОсновноеСредство В (ВЫБРАТЬ Т.ОС ИЗ ВтОС КАК Т)
	|	) КАК ПараметрыАмортизацииОС
	|";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПараметрыАмортизацииОСНалоговыйУчет(Запрос, ТекстыЗапроса, Регистры)
    
    ИмяРегистра = "ПараметрыАмортизацииОСНалоговыйУчет";
    
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
    КонецЕсли;
    
    Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтПараметрыАмортизацииОСНалоговыйУчет", ТекстыЗапроса) Тогда
    	ТекстЗапросаВтПараметрыАмортизацииОСНалоговыйУчет(Запрос, ТекстыЗапроса);
    КонецЕсли; 
    
    ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	ПараметрыАмортизацииОС.ОсновноеСредство                          КАК ОсновноеСредство,
	|	ПараметрыАмортизацииОС.Организация                               КАК Организация,
	|	ПараметрыАмортизацииОС.СрокПолезногоИспользования                КАК СрокПолезногоИспользования,
	|	ПараметрыАмортизацииОС.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.СтоимостьДляВычисленияАмортизации-ПараметрыПерерасчетаОС.СуммаКорректировкиНДС КАК СтоимостьДляВычисленияАмортизации
	|ИЗ
	|	ВтПараметрыАмортизацииОСНалоговыйУчет КАК ПараметрыАмортизацииОС
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.ПараметрыПерерасчетаОС КАК ПараметрыПерерасчетаОС
	|	ПО 
	|		ПараметрыПерерасчетаОС.Ссылка = &Ссылка
    |		И ПараметрыПерерасчетаОС.НеоборотныйАктив = ПараметрыАмортизацииОС.ОсновноеСредство
    |	    И НЕ ПараметрыПерерасчетаОС.ОССписан
	|";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтНМА(Запрос, ТекстыЗапроса)
    
    ИмяРегистра = "ВтНМА";
    
    ТекстЗапроса = "
    |ВЫБРАТЬ 
    |	ПараметрыПерерасчетаОС.НеоборотныйАктив КАК НМА
    |
    |ПОМЕСТИТЬ ВтНМА
    |
	|ИЗ 
    |   Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.ПараметрыПерерасчетаОС КАК ПараметрыПерерасчетаОС
	|ГДЕ 
	|	ПараметрыПерерасчетаОС.Ссылка = &Ссылка
    |	И НЕ ПараметрыПерерасчетаОС.ОССписан
    |	И ТИПЗНАЧЕНИЯ(ПараметрыПерерасчетаОС.НеоборотныйАктив) = ТИП(Справочник.НематериальныеАктивы)
    |";
    
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтПервоначальныеСведенияНМАБухгалтерскийУчет(Запрос, ТекстыЗапроса)
    
    ИмяРегистра = "ВтПервоначальныеСведенияНМАБухгалтерскийУчет";
    
    Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтНМА", ТекстыЗапроса) Тогда
    	ТекстЗапросаВтНМА(Запрос, ТекстыЗапроса);
    КонецЕсли; 
    
    ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	ПервоначальныеСведенияНМА.НематериальныйАктив                         КАК НематериальныйАктив,
	|	ПервоначальныеСведенияНМА.Организация                                 КАК Организация,
	|	ПервоначальныеСведенияНМА.НачислятьАмортизацию                        КАК НачислятьАмортизацию,
	|	ПервоначальныеСведенияНМА.СпособНачисленияАмортизации                 КАК СпособНачисленияАмортизации,
	|	ПервоначальныеСведенияНМА.СрокПолезногоИспользования                  КАК СрокПолезногоИспользования,
	|	ПервоначальныеСведенияНМА.ПервоначальнаяСтоимость                     КАК ПервоначальнаяСтоимость,
	|	ПервоначальныеСведенияНМА.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПервоначальныеСведенияНМА.ЛиквидационнаяСтоимость                     КАК ЛиквидационнаяСтоимость
    |
    |ПОМЕСТИТЬ ВтПервоначальныеСведенияНМАБухгалтерскийУчет
    |
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.СрезПоследних(
	|			&Граница,
	|			Регистратор <> &Ссылка
	|			И Организация = &Организация
	|			И НематериальныйАктив В (ВЫБРАТЬ Т.НМА ИЗ ВтНМА КАК Т)
	|	) КАК ПервоначальныеСведенияНМА
	|";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПервоначальныеСведенияНМАБухгалтерскийУчет(Запрос, ТекстыЗапроса, Регистры)
    
    ИмяРегистра = "ПервоначальныеСведенияНМАБухгалтерскийУчет";
    
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
    КонецЕсли;
    
    Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтПервоначальныеСведенияНМАБухгалтерскийУчет", ТекстыЗапроса) Тогда
    	ТекстЗапросаВтПервоначальныеСведенияНМАБухгалтерскийУчет(Запрос, ТекстыЗапроса);
    КонецЕсли; 
    
    ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	ПервоначальныеСведенияНМА.НематериальныйАктив                         КАК НематериальныйАктив,
	|	ПервоначальныеСведенияНМА.Организация                                 КАК Организация,
	|	ПервоначальныеСведенияНМА.НачислятьАмортизацию                        КАК НачислятьАмортизацию,
	|	ПервоначальныеСведенияНМА.СпособНачисленияАмортизации                 КАК СпособНачисленияАмортизации,
	|	ПервоначальныеСведенияНМА.СрокПолезногоИспользования                  КАК СрокПолезногоИспользования,
	|	ПервоначальныеСведенияНМА.ПервоначальнаяСтоимость-ПараметрыПерерасчетаОС.СуммаКорректировкиНДС КАК ПервоначальнаяСтоимость,
	|	ПервоначальныеСведенияНМА.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПервоначальныеСведенияНМА.ЛиквидационнаяСтоимость                     КАК ЛиквидационнаяСтоимость
	|ИЗ
	|	ВтПервоначальныеСведенияНМАБухгалтерскийУчет КАК ПервоначальныеСведенияНМА
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.ПараметрыПерерасчетаОС КАК ПараметрыПерерасчетаОС
	|	ПО 
	|		ПараметрыПерерасчетаОС.Ссылка = &Ссылка
    |		И ПараметрыПерерасчетаОС.НеоборотныйАктив = ПервоначальныеСведенияНМА.НематериальныйАктив
    |	    И НЕ ПараметрыПерерасчетаОС.ОССписан
	|";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтПервоначальныеСведенияНМАНалоговыйУчет(Запрос, ТекстыЗапроса)
    
    ИмяРегистра = "ВтПервоначальныеСведенияНМАНалоговыйУчет";
    
    Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтНМА", ТекстыЗапроса) Тогда
    	ТекстЗапросаВтНМА(Запрос, ТекстыЗапроса);
    КонецЕсли; 
    
    ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	ПервоначальныеСведенияНМА.НематериальныйАктив КАК       НематериальныйАктив,
	|	ПервоначальныеСведенияНМА.Организация                   КАК Организация,
	|	ПервоначальныеСведенияНМА.СпособНачисленияАмортизацииНУ КАК СпособНачисленияАмортизацииНУ,
	|	ПервоначальныеСведенияНМА.НалоговаяГруппаОС             КАК НалоговаяГруппаОС,
	|	ПервоначальныеСведенияНМА.ПервоначальнаяСтоимостьНУ     КАК ПервоначальнаяСтоимостьНУ,
	|	ПервоначальныеСведенияНМА.НалоговоеНазначение           КАК НалоговоеНазначение,
	|	ПервоначальныеСведенияНМА.НачислятьАмортизацию          КАК НачислятьАмортизацию,
	|	ПервоначальныеСведенияНМА.СрокПолезногоИспользования    КАК СрокПолезногоИспользования
    |
    |ПОМЕСТИТЬ ВтПервоначальныеСведенияНМАНалоговыйУчет
    |
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияНМАНалоговыйУчет.СрезПоследних(
	|			&Граница,
	|			Регистратор <> &Ссылка
	|			И Организация = &Организация
	|			И НематериальныйАктив В (ВЫБРАТЬ Т.НМА ИЗ ВтНМА КАК Т)
	|	) КАК ПервоначальныеСведенияНМА
	|";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПервоначальныеСведенияНМАНалоговыйУчет(Запрос, ТекстыЗапроса, Регистры)
    
    ИмяРегистра = "ПервоначальныеСведенияНМАНалоговыйУчет";
    
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
    КонецЕсли;
    
    Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтПервоначальныеСведенияНМАНалоговыйУчет", ТекстыЗапроса) Тогда
    	ТекстЗапросаВтПервоначальныеСведенияНМАНалоговыйУчет(Запрос, ТекстыЗапроса);
    КонецЕсли; 
    
    ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	ПервоначальныеСведенияНМА.НематериальныйАктив КАК       НематериальныйАктив,
	|	ПервоначальныеСведенияНМА.Организация                   КАК Организация,
	|	ПервоначальныеСведенияНМА.СпособНачисленияАмортизацииНУ КАК СпособНачисленияАмортизацииНУ,
	|	ПервоначальныеСведенияНМА.НалоговаяГруппаОС             КАК НалоговаяГруппаОС,
	|	ПервоначальныеСведенияНМА.ПервоначальнаяСтоимостьНУ-ПараметрыПерерасчетаОС.СуммаКорректировкиНДС КАК ПервоначальнаяСтоимостьНУ,
	|	ПервоначальныеСведенияНМА.НалоговоеНазначение           КАК НалоговоеНазначение,
	|	ПервоначальныеСведенияНМА.НачислятьАмортизацию          КАК НачислятьАмортизацию,
	|	ПервоначальныеСведенияНМА.СрокПолезногоИспользования    КАК СрокПолезногоИспользования
	|ИЗ
	|	ВтПервоначальныеСведенияНМАНалоговыйУчет КАК ПервоначальныеСведенияНМА
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.ПараметрыПерерасчетаОС КАК ПараметрыПерерасчетаОС
	|	ПО 
	|		ПараметрыПерерасчетаОС.Ссылка = &Ссылка
    |		И ПараметрыПерерасчетаОС.НеоборотныйАктив = ПервоначальныеСведенияНМА.НематериальныйАктив
    |	    И НЕ ПараметрыПерерасчетаОС.ОССписан
	|";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаСуммыКорректировокПропорциональногоНДС(Запрос, ТекстыЗапроса, Регистры)
    
    ИмяРегистра = "СуммыКорректировокПропорциональногоНДС";
    
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
    КонецЕсли; 
    
    ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ВидУсловнойПродажи.ПредполагаемаяКорректировкаУсловнойПродажи) КАК ВидУсловнойПродажи,
	|	&СпецРежимНалогообложения КАК СпецРежимНалогообложения,
	|	-&СуммаКорректировкиНДС КАК СуммаКорректировкиНДС
	|ГДЕ
    |	&СуммаКорректировкиНДС <> 0
	|";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	ВводНаОснованииПереопределяемый.ДобавитьКомандуСоздатьНаОснованииБизнесПроцессЗадание(КомандыСоздатьНаОсновании);
	
	ВводНаОснованииПереопределяемый.ДобавитьКомандыСоздатьНаОснованииПисмаПоШаблону(КомандыСоздатьНаОсновании);
	
КонецПроцедуры

#КонецОбласти

#Область Отчеты

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов) Экспорт
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

#КонецОбласти 	

#КонецОбласти

#КонецЕсли

