#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Не ЗначениеЗаполнено(Запись.Документ)
		 И Запись.Документ <> Неопределено Тогда
			Запись.Документ = Неопределено;
		КонецЕсли;
		
		ВидыСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные;
		
		Если ЗначениеЗаполнено(Запись.СчетУчета) Тогда
			
			Если Не Запись.СчетУчета.ВидыСубконто.Найти(ВидыСубконто.СтатьиЗатрат) = Неопределено Тогда
				Запись.ВидСубконто = ВидыСубконто.СтатьиЗатрат;
				
			Иначе
				Запись.ВидСубконто = Неопределено;
				
			КонецЕсли;
			
		Иначе
			Запись.ВидСубконто = Неопределено;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()

#КонецЕсли