#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьЗаголовкиПолей()
	Если НЕ ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	
	ВалютаУправленческогоУчета = Строка(Константы.ВалютаУправленческогоУчета.Получить());

	Для каждого НаборДанных из СхемаКомпоновкиДанных.НаборыДанных Цикл
		Для каждого ПолеНабораДанных из НаборДанных.Поля Цикл
			Если СтрНайти(ПолеНабораДанных.Заголовок, "%ВалютаУпр%") > 0 Тогда
				ПолеНабораДанных.Заголовок = СтрЗаменить(ПолеНабораДанных.Заголовок, "%ВалютаУпр%", ВалютаУправленческогоУчета);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для каждого ВычисляемоеПоле из СхемаКомпоновкиДанных.ВычисляемыеПоля Цикл
		Если СтрНайти(ВычисляемоеПоле.Заголовок, "%ВалютаУпр%") > 0 Тогда
			ВычисляемоеПоле.Заголовок = СтрЗаменить(ВычисляемоеПоле.Заголовок, "%ВалютаУпр%", ВалютаУправленческогоУчета);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

УстановитьЗаголовкиПолей();

#КонецОбласти

#КонецЕсли