#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если Не ЭтоГруппа Тогда
		ТабличнаяЧасть = ИспользуемыеАналитики.Выгрузить();
		Измерения = ТабличнаяЧасть.ВыгрузитьКолонку("ИмяИзмерения");
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(Измерения, "");
		ПредставлениеАналитик = СтроковыеФункцииКлиентСервер.СтрокаИзМассиваПодстрок(Измерения, ", ");
		ВидыАналитик = ТабличнаяЧасть.ВыгрузитьКолонку("ВидАналитики");
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(Измерения, ПланыВидовХарактеристик.АналитикиСтатейБюджетов.ПустаяСсылка());
		ПредставлениеАналитик = ?(ПустаяСтрока(ПредставлениеАналитик), "", ПредставлениеАналитик + ", ") +
								СтроковыеФункцииКлиентСервер.СтрокаИзМассиваПодстрок(ВидыАналитик, ", ");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли