////////////////////////////////////////////////////////////////////////////////
// Общие процедуры и функции работы с выгрузкой и загрузкой из Excel
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция - Создать присоединенный файл excel
//
// Параметры:
//  ДокументСсылка		 - ДокументСсылка.ПланЗакупок, ДокументСсылка.ПланПродаж и др - ссылка на документ для которого 
//						создается присоединенный файл
//  ИдентификаторФормы	 - УникальныйИдентификатор	 - идентификатор формы
//  ИмяПроцедуры		 - Строка	 - Имя экспортной процедуры в модуле менеджера документа плана который создает присоединенный файл
// Возвращаемое значение:
//  Структура - Параметры созданного присоединенного файла
Функция СоздатьПрисоединенныйФайлExcel(ДокументСсылка, ИдентификаторФормы, ИмяПроцедуры = "") Экспорт 

	Если НЕ ЗначениеЗаполнено(ИмяПроцедуры) Тогда
	
		ИмяПроцедуры = "СоздатьПрисоединенныйФайлExcel";
	
	КонецЕсли;
	
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ДокументСсылка);
	
	Попытка
	
		Возврат Вычислить("Менеджер." + ИмяПроцедуры + "(ДокументСсылка, ИдентификаторФормы)");
	
	Исключение
		Возврат Неопределено;
	КонецПопытки; 
	
КонецФункции 

#КонецОбласти