#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Если Параметры.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоПродукции Тогда
		ЗаголовокГруппы = НСтр("ru='Продукция';uk='Продукція'");
		Заголовок = НСтр("ru='Выбор продукции';uk='Вибір продукції'");
	ИначеЕсли Параметры.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоСпецификациям Тогда
		ЗаголовокГруппы = НСтр("ru='Спецификация продукции';uk='Специфікація продукції'");
		Заголовок = НСтр("ru='Выбор спецификации продукции';uk='Вибір специфікації продукції'");
	ИначеЕсли Параметры.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоЗаказамНаПроизводство Тогда
		ЗаголовокГруппы = НСтр("ru='Заказ (этап, спецификация)';uk='Замовлення (етап, специфікація)'");
		Заголовок = НСтр("ru='Выбор заказа';uk='Вибір замовлення'");
	КонецЕсли; 
	
	Элементы.СписокГруппГруппаЗатрат.Заголовок = ЗаголовокГруппы;
	
	ТекущаяСтрока = Неопределено;
	Для каждого СтрокаУслуга Из Параметры.Услуги Цикл
		СтрокаГруппа = СписокГрупп.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаГруппа, СтрокаУслуга);
		Если Параметры.НомерГруппыЗатрат = СтрокаУслуга.НомерГруппыЗатрат Тогда
			ТекущаяСтрока = СтрокаГруппа.ПолучитьИдентификатор();
		КонецЕсли; 
	КонецЦикла;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		Элементы.СписокГрупп.ТекущаяСтрока = ТекущаяСтрока;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура СписокГруппВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработатьВыборГруппы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьГруппу(Команда)
	
	ОбработатьВыборГруппы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыборГруппы()

	ТекущиеДанные = Элементы.СписокГрупп.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("ГруппаЗатрат", ТекущиеДанные.ГруппаЗатрат);
	ПараметрыВыбора.Вставить("НомерГруппыЗатрат", ТекущиеДанные.НомерГруппыЗатрат);
	ПараметрыВыбора.Вставить("Спецификация", ТекущиеДанные.Спецификация);

	Закрыть(ПараметрыВыбора);

КонецПроцедуры

#КонецОбласти
