
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд создания на основании.
//
// Параметры:
// 		КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. в функции ВводНаОсновании.СоздатьКоллекциюКомандСоздатьНаОсновании
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	
	
КонецПроцедуры

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ПереоценкаОС) Тогда
		КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Идентификатор = Метаданные.Документы.ПереоценкаОС.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ВводНаОсновании.ПредставлениеОбъекта(Метаданные.Документы.ПереоценкаОС);
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов) Экспорт

	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт
	
	ИсточникиДанных = Новый Соответствие;
	Возврат ИсточникиДанных;
	
КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(НСтр("ru='Переоценка ОС';uk='Переоцінка ОЗ'"));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДополнительныеСвойства);
	
	ТекстыЗапроса = Новый СписокЗначений;
	УчетОСВызовСервера.ПереоценкаОСБухгалтерскийУчет(ТекстыЗапроса, Регистры, ПереоценкаОСБухгалтерскийУчет(ТекстыЗапроса));
	УчетОСВызовСервера.ПрочиеРасходы(ТекстыЗапроса, Регистры, ПрочиеРасходы(ТекстыЗапроса));
	УчетОСВызовСервера.ПартииПрочихРасходов(ТекстыЗапроса, Регистры, ПартииПрочихРасходов(ТекстыЗапроса));
	УчетОСВызовСервера.ПорядокОтраженияПрочихОпераций(ТекстыЗапроса, Регистры);
	УчетОСВызовСервера.ОтражениеДокументовВРеглУчете(ТекстыЗапроса, Регистры);
	ПараметрыАмортизацииОСБухгалтерскийУчет(ТекстыЗапроса, Регистры);
	
	СобытияОСОрганизаций(ТекстыЗапроса, Регистры);
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Ложь, Ложь, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДополнительныеСвойства)
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ДанныеДокумента.СобытиеОС КАК СобытиеОС,
	|	ДанныеДокумента.СчетДооценки КАК СчетДооценки,
	|	ДанныеДокумента.СтатьяРасходов КАК СтатьяДоходов,
	|	ДанныеДокумента.АналитикаРасходов КАК АналитикаДоходов,
	|	ДанныеДокумента.СтатьяРасходов КАК СтатьяРасходов,
	|	ДанныеДокумента.АналитикаРасходов КАК АналитикаРасходов
	|ИЗ
	|	Документ.ПереоценкаОС КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка";
	
	Результат = Запрос.Выполнить();
	Реквизиты = Результат.Выбрать();
	Реквизиты.Следующий();
	
	УчетОСВызовСервера.ИнициализироватьПараметрыЗапросаПриОтраженииАмортизации(Запрос, ДополнительныеСвойства);
	Для Каждого Колонка Из Результат.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[Колонка.Имя]);
	КонецЦикла;
	Запрос.УстановитьПараметр("Граница", Новый Граница(НачалоМесяца(Реквизиты.Период), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("НазваниеДокумента", НСтр("ru='Переоценка ОС';uk='Переоцінка ОЗ'"));
	Запрос.УстановитьПараметр("ГраницаМесяцОкончание", Новый Граница(КонецМесяца(Реквизиты.Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("НалоговоеНазначениеОрганизации", Справочники.Организации.НалоговоеНазначениеНДС(Реквизиты.Организация, Реквизиты.Период));
	
КонецПроцедуры

Процедура ВременнаяТаблицаПоДокументу(ТекстыЗапроса)
	
	ИмяТаблицы = "втТаблицаПоДокументу";
	
	Если ПроведениеСервер.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втТаблицаПоДокументу
	|"+
	"ВЫБРАТЬ
	|	втТаблицаПоДокументу.Ссылка КАК Ссылка,
	|	втТаблицаПоДокументу.НомерСтроки КАК НомерСтроки,
	|	втТаблицаПоДокументу.ОсновноеСредство КАК ОбъектУчета,
	|	втТаблицаПоДокументу.Ссылка.Организация КАК Организация,
	|	втТаблицаПоДокументу.Ссылка.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(втТаблицаПоДокументу.ОсновноеСредство.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	втТаблицаПоДокументу.Стоимость КАК Стоимость,
	|	втТаблицаПоДокументу.СтоимостьДляВычисленияАмортизацииБУ КАК СтоимостьДляВычисленияАмортизацииБУ
	|ПОМЕСТИТЬ втТаблицаПоДокументу
	|ИЗ
	|	Документ.ПереоценкаОС.ОС КАК втТаблицаПоДокументу
	|ГДЕ
	|	втТаблицаПоДокументу.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	втТаблицаПоДокументу.ОсновноеСредство,
	|	Организация,
	|	Подразделение"+";";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ВременнаяТаблицаАмортизацияПоДокументу(ТекстыЗапроса)
	
	ИмяТаблицы = "втАмортизацияПоДокументу";
	
	Если ПроведениеСервер.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	УчетОСВызовСервера.ВременнаяТаблицаНачисленнаяАмортизация(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втАмортизацияПоДокументу
	|"+
	"ВЫБРАТЬ
	|	втНачисленнаяАмортизация.ОбъектУчета КАК ОбъектУчета,
	|	СУММА(втНачисленнаяАмортизация.СуммаБУ) КАК Сумма
	|ПОМЕСТИТЬ втАмортизацияПоДокументу
	|ИЗ
	|	втНачисленнаяАмортизация КАК втНачисленнаяАмортизация
	|
	|СГРУППИРОВАТЬ ПО
	|	втНачисленнаяАмортизация.ОбъектУчета"+";";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ВременнаяТаблицаСчетаУчета(ТекстыЗапроса)
	
	ИмяТаблицы = "втСчетаУчета";
	
	Если ПроведениеСервер.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаПоДокументу(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втСчетаУчета
	|"+
	"ВЫБРАТЬ
	|	втТаблицаПоДокументу.ОбъектУчета КАК ОбъектУчета,
	|	СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета,
	|	СчетаБухгалтерскогоУчетаОССрезПоследних.СчетНачисленияАмортизации КАК СчетАмортизации,
	|	ПараметрыЦелевогоФинансирования.СчетУчета КАК СчетУчетаЦФ,
	|	ПараметрыЦелевогоФинансирования.СчетАмортизации КАК СчетАмортизацииЦФ,
	|	ЕСТЬNULL(ПараметрыЦелевогоФинансирования.ПрименениеЦелевогоФинансирования, ЛОЖЬ) КАК ПрименениеЦелевогоФинансирования
	|ПОМЕСТИТЬ втСчетаУчета
	|ИЗ
	|	втТаблицаПоДокументу КАК втТаблицаПоДокументу
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|				&Период,
	|				(Организация, ОсновноеСредство) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втТаблицаПоДокументу КАК Т)) КАК СчетаБухгалтерскогоУчетаОССрезПоследних
	|		ПО втТаблицаПоДокументу.ОбъектУчета = СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЦелевогоФинансированияОС.СрезПоследних(
	|				&Период,
	|				Регистратор <> &Ссылка
	|					И ОсновноеСредство В
	|						(ВЫБРАТЬ
	|							Т.ОбъектУчета
	|						ИЗ
	|							втТаблицаПоДокументу КАК Т)) КАК ПараметрыЦелевогоФинансирования
	|		ПО втТаблицаПоДокументу.ОбъектУчета = ПараметрыЦелевогоФинансирования.ОсновноеСредство
	|			И (ПараметрыЦелевогоФинансирования.ПрименениеЦелевогоФинансирования)"+";";;
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ВременнаяТаблицаСчетаУчетаСгруппированные(ТекстыЗапроса)
	
	ИмяТаблицы = "втСчетаУчетаСгруппированные";
	
	Если ПроведениеСервер.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаСчетаУчета(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втСчетаУчетаСгруппированные
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСчетаУчета.ОбъектУчета КАК ОбъектУчета,
	|	втСчетаУчета.СчетУчета КАК Счет
	|ПОМЕСТИТЬ втСчетаУчетаСгруппированные
	|ИЗ
	|	втСчетаУчета КАК втСчетаУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСчетаУчета.ОбъектУчета,
	|	втСчетаУчета.СчетУчетаЦФ
	|ИЗ
	|	втСчетаУчета КАК втСчетаУчета
	|ГДЕ
	|	втСчетаУчета.ПрименениеЦелевогоФинансирования"+";";;
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ВременнаяТаблицаСчетаАмортизацииСгруппированные(ТекстыЗапроса)
	
	ИмяТаблицы = "втСчетаАмортизацииСгруппированные";
	
	Если ПроведениеСервер.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаСчетаУчета(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втСчетаАмортизацииСгруппированные
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСчетаУчета.ОбъектУчета КАК ОбъектУчета,
	|	втСчетаУчета.СчетАмортизации КАК Счет
	|ПОМЕСТИТЬ втСчетаАмортизацииСгруппированные
	|ИЗ
	|	втСчетаУчета КАК втСчетаУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСчетаУчета.ОбъектУчета,
	|	втСчетаУчета.СчетАмортизацииЦФ
	|ИЗ
	|	втСчетаУчета КАК втСчетаУчета
	|ГДЕ
	|	втСчетаУчета.ПрименениеЦелевогоФинансирования"+";";;
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ВременнаяТаблицаСчетаСгруппированные(ТекстыЗапроса)
	
	ИмяТаблицы = "втСчетаСгруппированные";
	
	Если ПроведениеСервер.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаСчетаУчетаСгруппированные(ТекстыЗапроса);
	ВременнаяТаблицаСчетаАмортизацииСгруппированные(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втСчетаСгруппированные
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСчетаУчетаСгруппированные.Счет КАК Счет
	|ПОМЕСТИТЬ втСчетаСгруппированные
	|ИЗ
	|	втСчетаУчетаСгруппированные КАК втСчетаУчетаСгруппированные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСчетаАмортизацииСгруппированные.Счет
	|ИЗ
	|	втСчетаАмортизацииСгруппированные КАК втСчетаАмортизацииСгруппированные"+";";;
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ВременнаяТаблицаОстаткиПоСчетам(ТекстыЗапроса)
	
	ИмяТаблицы = "втОстаткиПоСчетам";
	
	Если ПроведениеСервер.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаПоДокументу(ТекстыЗапроса);
	ВременнаяТаблицаСчетаСгруппированные(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втОстаткиПоСчетам
	|"+
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1 КАК ОбъектУчета,
	|	ХозрасчетныйОстатки.Счет КАК Счет,
	|	СУММА(ХозрасчетныйОстатки.СуммаОстаток) КАК Сумма
	|ПОМЕСТИТЬ втОстаткиПоСчетам
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&ГраницаМесяцОкончание,
	|			Счет В
	|				(ВЫБРАТЬ
	|					Т.Счет
	|				ИЗ
	|					втСчетаСгруппированные КАК Т),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	|			(Организация, Подразделение, Субконто1, НаправлениеДеятельности) В
	|				(ВЫБРАТЬ
	|					Т.Организация,
	|					Т.Подразделение,
	|					Т.ОбъектУчета,
	|					Т.НаправлениеДеятельности
	|				ИЗ
	|					втТаблицаПоДокументу КАК Т)) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.Счет"+";";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ВременнаяТаблицаОстаткиСтоимости(ТекстыЗапроса)
	
	ИмяТаблицы = "втОстаткиСтоимости";
	
	Если ПроведениеСервер.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаПоДокументу(ТекстыЗапроса);
	ВременнаяТаблицаСчетаУчетаСгруппированные(ТекстыЗапроса);
	ВременнаяТаблицаСчетаАмортизацииСгруппированные(ТекстыЗапроса);
	ВременнаяТаблицаОстаткиПоСчетам(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втОстаткиСтоимости
	|"+
	"ВЫБРАТЬ
	|	втТаблицаПоДокументу.ОбъектУчета,
	|	СУММА(ЕСТЬNULL(ВосстановительнаяСтоимость.Сумма, 0) + ЕСТЬNULL(ВосстановительнаяСтоимостьЦФ.Сумма, 0)) КАК ВосстановительнаяСтоимость,
	|	СУММА(ЕСТЬNULL(-НакопленнаяАмортизация.Сумма, 0) ) КАК НакопленнаяАмортизация
	|ПОМЕСТИТЬ втОстаткиСтоимости
	|ИЗ
	|	втТаблицаПоДокументу КАК втТаблицаПоДокументу
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСчетаУчета КАК втСчетаУчета
	|		ПО втТаблицаПоДокументу.ОбъектУчета = втСчетаУчета.ОбъектУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиПоСчетам КАК ВосстановительнаяСтоимость
	|		ПО втТаблицаПоДокументу.ОбъектУчета = ВосстановительнаяСтоимость.ОбъектУчета
	|			И (втСчетаУчета.СчетУчета = ВосстановительнаяСтоимость.Счет)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиПоСчетам КАК НакопленнаяАмортизация
	|		ПО втТаблицаПоДокументу.ОбъектУчета = НакопленнаяАмортизация.ОбъектУчета
	|			И (втСчетаУчета.СчетАмортизации = НакопленнаяАмортизация.Счет)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиПоСчетам КАК ВосстановительнаяСтоимостьЦФ
	|		ПО втТаблицаПоДокументу.ОбъектУчета = ВосстановительнаяСтоимостьЦФ.ОбъектУчета
	|			И (втСчетаУчета.СчетУчетаЦФ = ВосстановительнаяСтоимостьЦФ.Счет)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиПоСчетам КАК НакопленнаяАмортизацияЦФ
	|		ПО втТаблицаПоДокументу.ОбъектУчета = НакопленнаяАмортизацияЦФ.ОбъектУчета
	|			И (втСчетаУчета.СчетАмортизацииЦФ = НакопленнаяАмортизацияЦФ.Счет)
	|
	|СГРУППИРОВАТЬ ПО
	|	втТаблицаПоДокументу.ОбъектУчета"+";";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ВременнаяТаблицаПредыдущаяПереоценкаОбъектовСгруппированная(ТекстыЗапроса)
	
	ИмяТаблицы = "втПредыдущаяПереоценкаОбъектовСгруппированная";
	
	Если ПроведениеСервер.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаПоДокументу(ТекстыЗапроса);
	
	Текст =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|//Временная таблица втПредыдущаяПереоценкаОбъектовСгруппированная
	|"+
	"ВЫБРАТЬ
	|	втТаблицаПоДокументу.ОбъектУчета КАК ОбъектУчета,
	|	СУММА(ЕСТЬNULL(ПереоценкаОСБухгалтерскийУчетОбороты.СуммаПереоценкиПриход, 0)) КАК СуммаДооценки,
	|	СУММА(ЕСТЬNULL(ПереоценкаОСБухгалтерскийУчетОбороты.СуммаПереоценкиРасход, 0)) КАК СуммаУценки
	|ПОМЕСТИТЬ втПредыдущаяПереоценкаОбъектовСгруппированная
	|ИЗ
	|	втТаблицаПоДокументу КАК втТаблицаПоДокументу
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПереоценкаОСБухгалтерскийУчет.Обороты(
	|				,
	|				&ГраницаМесяцОкончание,
	|				Регистратор,
	|				(Организация, ОсновноеСредство) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втТаблицаПоДокументу КАК Т)) КАК ПереоценкаОСБухгалтерскийУчетОбороты
	|		ПО втТаблицаПоДокументу.ОбъектУчета = ПереоценкаОСБухгалтерскийУчетОбороты.ОсновноеСредство
	|			И втТаблицаПоДокументу.Организация = ПереоценкаОСБухгалтерскийУчетОбороты.Организация
	|			И (ПереоценкаОСБухгалтерскийУчетОбороты.Регистратор <> &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	втТаблицаПоДокументу.ОбъектУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета" + ";";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ВременнаяТаблицаПредыдущаяПереоценкаОбъектов(ТекстыЗапроса)
	
	ИмяТаблицы = "втПредыдущаяПереоценкаОбъектов";
	
	Если ПроведениеСервер.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаПредыдущаяПереоценкаОбъектовСгруппированная(ТекстыЗапроса);
	
	Текст =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|//Временная таблица втПредыдущаяПереоценкаОбъектов
	|"+
	"ВЫБРАТЬ
	|	втПредыдущаяПереоценкаОбъектовСгруппированная.ОбъектУчета,
	|	ВЫБОР
	|		КОГДА втПредыдущаяПереоценкаОбъектовСгруппированная.СуммаДооценки > втПредыдущаяПереоценкаОбъектовСгруппированная.СуммаУценки
	|			ТОГДА втПредыдущаяПереоценкаОбъектовСгруппированная.СуммаДооценки - втПредыдущаяПереоценкаОбъектовСгруппированная.СуммаУценки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДооценки,
	|	ВЫБОР
	|		КОГДА втПредыдущаяПереоценкаОбъектовСгруппированная.СуммаУценки > втПредыдущаяПереоценкаОбъектовСгруппированная.СуммаДооценки
	|			ТОГДА втПредыдущаяПереоценкаОбъектовСгруппированная.СуммаУценки - втПредыдущаяПереоценкаОбъектовСгруппированная.СуммаДооценки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаУценки
	|ПОМЕСТИТЬ втПредыдущаяПереоценкаОбъектов
	|ИЗ
	|	втПредыдущаяПереоценкаОбъектовСгруппированная КАК втПредыдущаяПереоценкаОбъектовСгруппированная
	|		ЛЕВОЕ СОЕДИНЕНИЕ втТаблицаПоДокументу КАК втТаблицаПоДокументу
	|		ПО втПредыдущаяПереоценкаОбъектовСгруппированная.ОбъектУчета = втТаблицаПоДокументу.ОбъектУчета
	|" + ";";
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ВременнаяТаблицаДанныеДляПроведения(ТекстыЗапроса)
	
	ИмяТаблицы = "втДанныеДляПроведения";
	
	Если ПроведениеСервер.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаПоДокументу(ТекстыЗапроса);
	ВременнаяТаблицаОстаткиСтоимости(ТекстыЗапроса);
	ВременнаяТаблицаАмортизацияПоДокументу(ТекстыЗапроса);
	ВременнаяТаблицаПредыдущаяПереоценкаОбъектов(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втДанныеДляПроведения
	|"+
	"ВЫБРАТЬ
	|	втТаблицаПоДокументу.Ссылка,
	|	втТаблицаПоДокументу.НомерСтроки,
	|	втТаблицаПоДокументу.ОбъектУчета,
	|	втТаблицаПоДокументу.Организация КАК Организация,
	|	втТаблицаПоДокументу.Подразделение КАК Подразделение,
	|	втТаблицаПоДокументу.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЕСТЬNULL(втОстаткиСтоимости.ВосстановительнаяСтоимость, 0) КАК ВосстановительнаяСтоимость,
	|	ЕСТЬNULL(втОстаткиСтоимости.НакопленнаяАмортизация, 0) + ЕСТЬNULL(втАмортизацияПоДокументу.Сумма, 0) КАК НакопленнаяАмортизация,
	|	втТаблицаПоДокументу.Стоимость КАК НоваяСтоимость,
	|	втТаблицаПоДокументу.СтоимостьДляВычисленияАмортизацииБУ КАК СтоимостьДляВычисленияАмортизацииБУ,
	|	ВЫБОР
	|		КОГДА втТаблицаПоДокументу.Стоимость > 
	|				(втОстаткиСтоимости.ВосстановительнаяСтоимость - ЕСТЬNULL(втОстаткиСтоимости.НакопленнаяАмортизация, 0) - ЕСТЬNULL(втАмортизацияПоДокументу.Сумма, 0)) 
	|			ТОГДА  втТаблицаПоДокументу.Стоимость 
	|					- (втОстаткиСтоимости.ВосстановительнаяСтоимость 
	|						- ЕСТЬNULL(втОстаткиСтоимости.НакопленнаяАмортизация, 0) 
	|							- ЕСТЬNULL(втАмортизацияПоДокументу.Сумма, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДооценки,
	|	ВЫБОР
	|		КОГДА втТаблицаПоДокументу.Стоимость < 
	|								(втОстаткиСтоимости.ВосстановительнаяСтоимость 
	|									- ЕСТЬNULL(втОстаткиСтоимости.НакопленнаяАмортизация, 0) 
	|												- ЕСТЬNULL(втАмортизацияПоДокументу.Сумма, 0)) 
	|			ТОГДА  втОстаткиСтоимости.ВосстановительнаяСтоимость 
	|						- ЕСТЬNULL(втОстаткиСтоимости.НакопленнаяАмортизация, 0) 
	|							-ЕСТЬNULL(втАмортизацияПоДокументу.Сумма, 0) 
	|								- втТаблицаПоДокументу.Стоимость
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаУценки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втОстаткиСтоимости.ВосстановительнаяСтоимость, 0) = 0
	|				ИЛИ втТаблицаПоДокументу.Стоимость < (втОстаткиСтоимости.ВосстановительнаяСтоимость - (ЕСТЬNULL(втОстаткиСтоимости.НакопленнаяАмортизация, 0) + ЕСТЬNULL(втАмортизацияПоДокументу.Сумма, 0)))
	|					ИЛИ ЕСТЬNULL(втОстаткиСтоимости.ВосстановительнаяСтоимость, 0) - (ЕСТЬNULL(втОстаткиСтоимости.НакопленнаяАмортизация, 0) + ЕСТЬNULL(втАмортизацияПоДокументу.Сумма, 0)) = 0
	|		ТОГДА 0
	|		ИНАЧЕ - (ЕСТЬNULL(втОстаткиСтоимости.НакопленнаяАмортизация, 0) + ЕСТЬNULL(втАмортизацияПоДокументу.Сумма, 0)) + ВЫРАЗИТЬ(((ЕСТЬNULL(втОстаткиСтоимости.НакопленнаяАмортизация, 0) + ЕСТЬNULL(втАмортизацияПоДокументу.Сумма, 0)) * втТаблицаПоДокументу.Стоимость / (втОстаткиСтоимости.ВосстановительнаяСтоимость - (ЕСТЬNULL(втОстаткиСтоимости.НакопленнаяАмортизация, 0) + ЕСТЬNULL(втАмортизацияПоДокументу.Сумма, 0)))) КАК ЧИСЛО(15, 2)) 
	|	КОНЕЦ КАК СуммаДооценкиАмортизации,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втОстаткиСтоимости.ВосстановительнаяСтоимость, 0) = 0
	|				ИЛИ втТаблицаПоДокументу.Стоимость > (втОстаткиСтоимости.ВосстановительнаяСтоимость - (ЕСТЬNULL(втОстаткиСтоимости.НакопленнаяАмортизация, 0) + ЕСТЬNULL(втАмортизацияПоДокументу.Сумма, 0)))
	|					ИЛИ ЕСТЬNULL(втОстаткиСтоимости.ВосстановительнаяСтоимость, 0) - (ЕСТЬNULL(втОстаткиСтоимости.НакопленнаяАмортизация, 0) + ЕСТЬNULL(втАмортизацияПоДокументу.Сумма, 0)) = 0
	|		ТОГДА 0
	|		ИНАЧЕ (ЕСТЬNULL(втОстаткиСтоимости.НакопленнаяАмортизация, 0) + ЕСТЬNULL(втАмортизацияПоДокументу.Сумма, 0)) - ВЫРАЗИТЬ(((ЕСТЬNULL(втОстаткиСтоимости.НакопленнаяАмортизация, 0) + ЕСТЬNULL(втАмортизацияПоДокументу.Сумма, 0)) * втТаблицаПоДокументу.Стоимость / (втОстаткиСтоимости.ВосстановительнаяСтоимость - (ЕСТЬNULL(втОстаткиСтоимости.НакопленнаяАмортизация, 0) + ЕСТЬNULL(втАмортизацияПоДокументу.Сумма, 0)))) КАК ЧИСЛО(15, 2)) 
	|	КОНЕЦ КАК СуммаУценкиАмортизации,
	|
	|	ЕСТЬNULL(втПредыдущаяПереоценкаОбъектов.СуммаДооценки, 0) КАК СуммаПрошлойДооценки,
	|	ЕСТЬNULL(втПредыдущаяПереоценкаОбъектов.СуммаУценки, 0) КАК СуммаПрошлойУценки
	|ПОМЕСТИТЬ втДанныеДляПроведения
	|ИЗ
	|	втТаблицаПоДокументу КАК втТаблицаПоДокументу
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиСтоимости КАК втОстаткиСтоимости
	|		ПО втТаблицаПоДокументу.ОбъектУчета = втОстаткиСтоимости.ОбъектУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ втАмортизацияПоДокументу КАК втАмортизацияПоДокументу
	|		ПО втТаблицаПоДокументу.ОбъектУчета = втАмортизацияПоДокументу.ОбъектУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПредыдущаяПереоценкаОбъектов КАК втПредыдущаяПереоценкаОбъектов
	|		ПО втТаблицаПоДокументу.ОбъектУчета = втПредыдущаяПереоценкаОбъектов.ОбъектУчета"+";";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ПараметрыАмортизацииОСБухгалтерскийУчет(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ПараметрыАмортизацииОСБухгалтерскийУчет";
	
	Если Не ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаДанныеДляПроведения(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Таблица ПараметрыАмортизацииОСБухгалтерскийУчет
	|"+
	"ВЫБРАТЬ
	|	втДанныеДляПроведения.НомерСтроки,
	|	
	|	&Ссылка КАК Регистратор,
	|	&Период КАК Период,
	|	
	|	&Организация КАК Организация,
	|	втДанныеДляПроведения.ОбъектУчета КАК ОсновноеСредство,
	|	
	|	ПараметрыАмортизацииОСБУ.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ПараметрыАмортизацииОСБУ.ОбъемПродукцииРабот КАК ОбъемПродукцииРабот,
	|	ПараметрыАмортизацииОСБУ.СрокПолезногоИспользования КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизации 
	|		+ втДанныеДляПроведения.СуммаДооценки
	|			- втДанныеДляПроведения.СуммаУценки 
	|				+ втДанныеДляПроведения.СуммаДооценкиАмортизации 
	|					- втДанныеДляПроведения.СуммаУценкиАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОСБУ.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации
	|	
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|		&Период,
	|		Организация = &Организация
	|		И Регистратор<>&Ссылка
	|		И ОсновноеСредство В (ВЫБРАТЬ Т.ОбъектУчета ИЗ втДанныеДляПроведения КАК Т)
	|	) КАК ПараметрыАмортизацииОСБУ
	|	ПО втДанныеДляПроведения.ОбъектУчета = ПараметрыАмортизацииОСБУ.ОсновноеСредство
	|
	|УПОРЯДОЧИТЬ ПО
	|	втДанныеДляПроведения.НомерСтроки"+";";
	
	ТекстыЗапроса.Добавить(Текст, ИмяРегистра, Истина);
	
КонецПроцедуры


Процедура СобытияОСОрганизаций(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "СобытияОСОрганизаций";
	
	Если Не ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаДанныеДляПроведения(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Таблица СобытияОСОрганизаций
	|"+
	"ВЫБРАТЬ
	|	втДанныеДляПроведения.НомерСтроки,
	|	
	|	&Ссылка КАК Регистратор,
	|	&Период КАК Период,
	|	
	|	&Организация КАК Организация,
	|	втДанныеДляПроведения.ОбъектУчета КАК ОсновноеСредство,
	|	
	|	&СобытиеОС КАК Событие,
	|	
	|	&НазваниеДокумента КАК НазваниеДокумента,
	|	&Номер КАК НомерДокумента,
	|	0 КАК СуммаЗатратБУ,
	|	0 КАК СуммаЗатратНУ
	|
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|
	|УПОРЯДОЧИТЬ ПО
	|	втДанныеДляПроведения.НомерСтроки"+";";
	
	ТекстыЗапроса.Добавить(Текст, ИмяРегистра, Истина);
	
КонецПроцедуры

Функция ПрочиеРасходы(ТекстыЗапроса)
	
	ВременнаяТаблицаДанныеДляПроведения(ТекстыЗапроса);

	Возврат
	"ВЫБРАТЬ // Уценка восстановительной стоимости
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	
	|	&Организация КАК Организация,
	|	&НалоговоеНазначениеОрганизации КАК НалоговоеНазначение,
	|	&Подразделение КАК Подразделение,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	втДанныеДляПроведения.СуммаУценки - втДанныеДляПроведения.СуммаПрошлойДооценки КАК СуммаРегл,
	|	0 КАК СуммаРеглБезНДС,
	|	0 КАК НДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	
	|	Неопределено КАК ХозяйственнаяОперация,
	|	Неопределено КАК АналитикаУчетаНоменклатуры
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК ПВХСтатьиРасходов
	|	ПО &СтатьяРасходов = ПВХСтатьиРасходов.Ссылка
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценки > 0
	|	И втДанныеДляПроведения.ВосстановительнаяСтоимость > 0
	|	И втДанныеДляПроведения.СуммаУценки > втДанныеДляПроведения.СуммаПрошлойДооценки 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Дооценка накопленной амортизации из доли уценки
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	
	|	&Организация КАК Организация,
	|	&НалоговоеНазначениеОрганизации КАК НалоговоеНазначение,
	|	&Подразделение КАК Подразделение,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ втДанныеДляПроведения.НакопленнаяАмортизация * (втДанныеДляПроведения.СуммаДооценки / втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК СуммаРегл,
	|	0 КАК СуммаРеглБезНДС,
	|	0 КАК НДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	
	|	Неопределено КАК ХозяйственнаяОперация,
	|	Неопределено КАК АналитикаУчетаНоменклатуры
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК ПВХСтатьиРасходов
	|	ПО &СтатьяРасходов = ПВХСтатьиРасходов.Ссылка
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценки > 0
	|	И втДанныеДляПроведения.ВосстановительнаяСтоимость > 0
	|	И втДанныеДляПроведения.СуммаПрошлойУценки > 0
	|	И втДанныеДляПроведения.СуммаДооценки < втДанныеДляПроведения.СуммаПрошлойУценки 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Дооценка накопленной амортизации из уценки
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	
	|	&Организация КАК Организация,
	|	&НалоговоеНазначениеОрганизации КАК НалоговоеНазначение,	
	|	&Подразделение КАК Подразделение,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ втДанныеДляПроведения.НакопленнаяАмортизация * (втДанныеДляПроведения.СуммаПрошлойУценки / втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК СуммаРегл,
	|	0 КАК СуммаРеглБезНДС,
	|	0 КАК НДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	
	|	Неопределено КАК ХозяйственнаяОперация,
	|	Неопределено КАК АналитикаУчетаНоменклатуры
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК ПВХСтатьиРасходов
	|	ПО &СтатьяРасходов = ПВХСтатьиРасходов.Ссылка
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценки > 0
	|	И втДанныеДляПроведения.ВосстановительнаяСтоимость > 0
	|	И втДанныеДляПроведения.СуммаПрошлойУценки > 0
	|	И втДанныеДляПроведения.СуммаДооценки >= втДанныеДляПроведения.СуммаПрошлойУценки 
	|";	
	
КонецФункции

Функция ПартииПрочихРасходов(ТекстыЗапроса)
	
	ВременнаяТаблицаДанныеДляПроведения(ТекстыЗапроса);
	
	Возврат
	"ВЫБРАТЬ // Уценка восстановительной стоимости
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	&Ссылка КАК ДокументПоступленияРасходов,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартий,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	втДанныеДляПроведения.СуммаУценки - втДанныеДляПроведения.СуммаПрошлойДооценки КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	втДанныеДляПроведения.СуммаУценки - втДанныеДляПроведения.СуммаПрошлойДооценки КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК ПВХСтатьиРасходов
	|	ПО &СтатьяРасходов = ПВХСтатьиРасходов.Ссылка
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценки > 0
	|	И втДанныеДляПроведения.ВосстановительнаяСтоимость > 0
	|	И втДанныеДляПроведения.СуммаУценки > втДанныеДляПроведения.СуммаПрошлойДооценки
	|	И ПВХСтатьиРасходов.ВариантРаспределенияРасходов В (
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Дооценка накопленной амортизации из доли уценки
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	&Ссылка КАК ДокументПоступленияРасходов,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартий,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ втДанныеДляПроведения.НакопленнаяАмортизация * (втДанныеДляПроведения.СуммаДооценки / втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ втДанныеДляПроведения.НакопленнаяАмортизация * (втДанныеДляПроведения.СуммаДооценки / втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК ПВХСтатьиРасходов
	|	ПО &СтатьяРасходов = ПВХСтатьиРасходов.Ссылка
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценки > 0
	|	И втДанныеДляПроведения.ВосстановительнаяСтоимость > 0
	|	И втДанныеДляПроведения.СуммаПрошлойУценки > 0
	|	И втДанныеДляПроведения.СуммаДооценки < втДанныеДляПроведения.СуммаПрошлойУценки
	|	И ПВХСтатьиРасходов.ВариантРаспределенияРасходов В (
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Дооценка накопленной амортизации из уценки
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	&Ссылка КАК ДокументПоступленияРасходов,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартий,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ втДанныеДляПроведения.НакопленнаяАмортизация * (втДанныеДляПроведения.СуммаПрошлойУценки / втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ втДанныеДляПроведения.НакопленнаяАмортизация * (втДанныеДляПроведения.СуммаПрошлойУценки / втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК ПВХСтатьиРасходов
	|	ПО &СтатьяРасходов = ПВХСтатьиРасходов.Ссылка
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценки > 0
	|	И втДанныеДляПроведения.ВосстановительнаяСтоимость > 0
	|	И втДанныеДляПроведения.СуммаПрошлойУценки > 0
	|	И втДанныеДляПроведения.СуммаДооценки >= (втДанныеДляПроведения.СуммаПрошлойУценки)
	|	И ПВХСтатьиРасходов.ВариантРаспределенияРасходов В (
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|	)";
	
КонецФункции

Функция ПереоценкаОСБухгалтерскийУчет(ТекстыЗапроса)
		
	ВременнаяТаблицаДанныеДляПроведения(ТекстыЗапроса);
	
	Возврат
	"ВЫБРАТЬ // Дооценка восстановительной стоимости
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	
	|	&Организация КАК Организация,
	|	втДанныеДляПроведения.ОбъектУчета КАК ОсновноеСредство,
	|	
	|	втДанныеДляПроведения.СуммаДооценки КАК СуммаПереоценки
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|		
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценки > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Уценка восстановительной стоимости
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	
	|	&Организация КАК Организация,
	|	втДанныеДляПроведения.ОбъектУчета КАК ОсновноеСредство,
	|	
	|	втДанныеДляПроведения.СуммаУценки КАК СуммаПереоценки
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|		
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценки > 0
	|
	|";
	
КонецФункции

#КонецОбласти

#Область ПроведениеПоРеглУчету


Функция ТекстЗапросаВТОтраженияВРеглУчетеУКР() Экспорт
	
	Возврат УчетОСВызовСервера.ТекстЗапросаВТОтраженияВРеглУчетеНачисленнойАмортизацииУКР("ПереоценкаОС")
		+ УчетОСВызовСервера.ТекстЗапросаВТОтраженияВРеглУчетеОстаткиПоСчетам()
		+ ВТДанныеДокумента()
		+ ВТПредыдущаяПереоценкаОбъектов()
		+ ВТДанныеДляПроведения();
	
КонецФункции

Функция ВТДанныеДокумента()
	
	Возврат
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|//Временная таблица втТаблицаОбъектов
	|"+
	"ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.НомерСтроки КАК НомерСтроки,
	|	Операция.Дата КАК Дата,
	|	Операция.Организация КАК Организация,
	|	Операция.Подразделение КАК Подразделение,
	|	Строки.ОсновноеСредство КАК ОбъектУчета,
	|	ЕСТЬNULL(Строки.ОсновноеСредство.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	Строки.Стоимость КАК Стоимость,
	|	СчетаБухгалтерскогоУчетаОС.СчетУчетаДооценокОС КАК СчетДооценки,
	|	Операция.СтатьяДоходов,
	|	Операция.АналитикаДоходов,
	|	Операция.СтатьяРасходов,
	|	Операция.АналитикаРасходов
	|ПОМЕСТИТЬ втДанныеДокумента
	|ИЗ
	|	Документ.ПереоценкаОС КАК Операция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереоценкаОС.ОС КАК Строки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаБухгалтерскогоУчетаОС
	|			ПО Строки.ОсновноеСредство = СчетаБухгалтерскогоУчетаОС.ОсновноеСредство
	|		ПО Операция.Ссылка = Строки.Ссылка
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета" + ";";
	
КонецФункции

Функция ВТПредыдущаяПереоценкаОбъектов()
	
	Возврат
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|//Временная таблица втПредыдущаяПереоценкаОбъектов
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетаБухгалтерскогоУчетаОС.СчетУчета КАК Счет
	|ПОМЕСТИТЬ втВсеСчетаУчетаСтоимости
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаБухгалтерскогоУчетаОС
	|		ПО втОбъектыДокумента.ОбъектУчета = СчетаБухгалтерскогоУчетаОС.ОсновноеСредство
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОбъектыДокумента.ОбъектУчета КАК ОбъектУчета,
	|	СУММА(ЕСТЬNULL(ПереоценкаОСБухгалтерскийУчетОбороты.СуммаПереоценкиПриход, 0)) КАК СуммаДооценки,
	|	СУММА(ЕСТЬNULL(ПереоценкаОСБухгалтерскийУчетОбороты.СуммаПереоценкиРасход, 0)) КАК СуммаУценки
	|ПОМЕСТИТЬ  втПредыдущаяПереоценкаСтоимостиСгруппированная
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПереоценкаОСБухгалтерскийУчет.Обороты(
	|				,
	|				&ГраницаМесяцОкончание,
	|				Регистратор,
	|				(Организация, ОсновноеСредство) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втОбъектыДокумента КАК Т)) КАК ПереоценкаОСБухгалтерскийУчетОбороты
	|		ПО втОбъектыДокумента.ОбъектУчета = ПереоценкаОСБухгалтерскийУчетОбороты.ОсновноеСредство
	|			И втОбъектыДокумента.Организация = ПереоценкаОСБухгалтерскийУчетОбороты.Организация
	|			И (ПереоценкаОСБухгалтерскийУчетОбороты.Регистратор <> &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	втОбъектыДокумента.ОбъектУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПредыдущаяПереоценкаСтоимостиСгруппированная.ОбъектУчета,
	|	ВЫБОР
	|		КОГДА втПредыдущаяПереоценкаСтоимостиСгруппированная.СуммаДооценки > втПредыдущаяПереоценкаСтоимостиСгруппированная.СуммаУценки
	|			ТОГДА втПредыдущаяПереоценкаСтоимостиСгруппированная.СуммаДооценки - втПредыдущаяПереоценкаСтоимостиСгруппированная.СуммаУценки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДооценки,
	|	ВЫБОР
	|		КОГДА втПредыдущаяПереоценкаСтоимостиСгруппированная.СуммаУценки > втПредыдущаяПереоценкаСтоимостиСгруппированная.СуммаДооценки
	|			ТОГДА втПредыдущаяПереоценкаСтоимостиСгруппированная.СуммаУценки - втПредыдущаяПереоценкаСтоимостиСгруппированная.СуммаДооценки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаУценки
	|ПОМЕСТИТЬ втПредыдущаяПереоценкаСтоимости
	|ИЗ
	|	втПредыдущаяПереоценкаСтоимостиСгруппированная КАК втПредыдущаяПереоценкаСтоимостиСгруппированная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации КАК Счет
	|ПОМЕСТИТЬ втВсеСчетаУчетаАмортизации
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаБухгалтерскогоУчетаОС
	|		ПО втОбъектыДокумента.ОбъектУчета = СчетаБухгалтерскогоУчетаОС.ОсновноеСредство
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПараметрыЦелевогоФинансированияОС.СчетАмортизации
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЦелевогоФинансированияОС КАК ПараметрыЦелевогоФинансированияОС
	|		ПО втОбъектыДокумента.ОбъектУчета = ПараметрыЦелевогоФинансированияОС.ОсновноеСредство
	|			И (ПараметрыЦелевогоФинансированияОС.ПрименениеЦелевогоФинансирования)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОбъектыДокумента.ОбъектУчета КАК ОбъектУчета,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0)) КАК СуммаДооценки,
	|	0 КАК СуммаУценки
	|ПОМЕСТИТЬ втПредыдущаяПереоценкаАмортизацииДанные
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				,
	|				&ГраницаМесяцОкончание,
	|				Регистратор,
	|				Счет В
	|					(ВЫБРАТЬ
	|						Т.Счет
	|					ИЗ
	|						втВсеСчетаУчетаАмортизации КАК Т),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	|				(Организация, Субконто1) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втОбъектыДокумента КАК Т),
	|				,
	|				) КАК ХозрасчетныйОбороты
	|		ПО втОбъектыДокумента.ОбъектУчета = ХозрасчетныйОбороты.Субконто1
	|			И втОбъектыДокумента.Организация = ХозрасчетныйОбороты.Организация
	|			И (ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПереоценкаОС)
	|			И (ХозрасчетныйОбороты.Регистратор <> &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	втОбъектыДокумента.ОбъектУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втОбъектыДокумента.ОбъектУчета,
	|	0,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0))
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				,
	|				&ГраницаМесяцОкончание,
	|				Регистратор,
	|				Счет В
	|					(ВЫБРАТЬ
	|						Т.Счет
	|					ИЗ
	|						втВсеСчетаУчетаАмортизации КАК Т),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	|				(Организация, Субконто1) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втОбъектыДокумента КАК Т),
	|				,
	|				) КАК ХозрасчетныйОбороты
	|		ПО втОбъектыДокумента.ОбъектУчета = ХозрасчетныйОбороты.Субконто1
	|			И втОбъектыДокумента.Организация = ХозрасчетныйОбороты.Организация
	|			И (ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПереоценкаОС)
	|			И (ХозрасчетныйОбороты.Регистратор <> &Ссылка)
	|			И (ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0) > 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	втОбъектыДокумента.ОбъектУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПредыдущаяПереоценкаАмортизацииДанные.ОбъектУчета КАК ОбъектУчета,
	|	СУММА(втПредыдущаяПереоценкаАмортизацииДанные.СуммаДооценки) КАК СуммаДооценки,
	|	СУММА(втПредыдущаяПереоценкаАмортизацииДанные.СуммаУценки) КАК СуммаУценки
	|ПОМЕСТИТЬ втПредыдущаяПереоценкаАмортизацииСгруппированная
	|ИЗ
	|	втПредыдущаяПереоценкаАмортизацииДанные КАК втПредыдущаяПереоценкаАмортизацииДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	втПредыдущаяПереоценкаАмортизацииДанные.ОбъектУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПредыдущаяПереоценкаАмортизацииСгруппированная.ОбъектУчета,
	|	ВЫБОР
	|		КОГДА втПредыдущаяПереоценкаАмортизацииСгруппированная.СуммаДооценки > втПредыдущаяПереоценкаАмортизацииСгруппированная.СуммаУценки
	|			ТОГДА втПредыдущаяПереоценкаАмортизацииСгруппированная.СуммаДооценки - втПредыдущаяПереоценкаАмортизацииСгруппированная.СуммаУценки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДооценки,
	|	ВЫБОР
	|		КОГДА втПредыдущаяПереоценкаАмортизацииСгруппированная.СуммаУценки > втПредыдущаяПереоценкаАмортизацииСгруппированная.СуммаДооценки
	|			ТОГДА втПредыдущаяПереоценкаАмортизацииСгруппированная.СуммаУценки - втПредыдущаяПереоценкаАмортизацииСгруппированная.СуммаДооценки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаУценки
	|ПОМЕСТИТЬ втПредыдущаяПереоценкаАмортизации
	|ИЗ
	|	втПредыдущаяПереоценкаАмортизацииСгруппированная КАК втПредыдущаяПереоценкаАмортизацииСгруппированная" + ";";
	
КонецФункции

Функция ВТДанныеДляПроведения()
	
	Возврат
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|//Временная таблица втДанныеДляПроведения
	|"+
	"ВЫБРАТЬ
	|	втДанныеДокумента.Ссылка КАК Ссылка,
	|	втДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	втДанныеДокумента.Дата КАК Дата,
	|	втДанныеДокумента.ОбъектУчета,
	|	втДанныеДокумента.Организация КАК Организация,
	|	втДанныеДокумента.Подразделение КАК Подразделение,
	|	втДанныеДокумента.СчетДооценки КАК СчетДооценки,
	|	втДанныеДокумента.СтатьяДоходов КАК СтатьяДоходов,
	|	втДанныеДокумента.АналитикаДоходов КАК АналитикаДоходов,
	|	втДанныеДокумента.СтатьяРасходов КАК СтатьяРасходов,
	|	втДанныеДокумента.АналитикаРасходов КАК АналитикаРасходов,
	|	втСчетаОтражения.СчетУчета КАК СчетУчета,
	|	втСчетаОтражения.СчетНачисленияАмортизации КАК СчетАмортизации,	
	|	втСчетаОтражения.СчетУчетаДооценокОС КАК СчетУчетаДооценокОС,
	|	втДанныеДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ, 0) КАК ВосстановительнаяСтоимость,
	|	ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ, 0) КАК ВосстановительнаяСтоимостьСобственныхСредств,
	|	ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ, 0) КАК НакопленнаяАмортизация,
	|	ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ, 0) КАК НакопленнаяАмортизацияСобственныхСредств,
	|	втДанныеДокумента.Стоимость КАК НоваяСтоимость,
	|	ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ - втОстаткиПоСчетам.НакопленнаяАмортизацияБУ, 0) КАК ОстаточнаяСтоимостьСУчетомАмортизацииБУ,
	|	ВЫБОР
	|		КОГДА втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(втДанныеДокумента.Стоимость/(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ - втОстаткиПоСчетам.НакопленнаяАмортизацияБУ) , 0)
	|	КОНЕЦ КАК КоэффициентПереоценкиАмортизацииБУ,
	|	ВЫБОР
	|		КОГДА втОстаткиПоСчетам.ОбъектУчета ЕСТЬ NULL 
	|				ИЛИ (втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ - втОстаткиПоСчетам.НакопленнаяАмортизацияБУ) > втДанныеДокумента.Стоимость
	|				ИЛИ втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(втДанныеДокумента.Стоимость - (ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ, 0) - ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ, 0)) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаДооценкиСтоимости,
	|	ВЫБОР
	|		КОГДА втОстаткиПоСчетам.ОбъектУчета ЕСТЬ NULL 
	|				ИЛИ (втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ - втОстаткиПоСчетам.НакопленнаяАмортизацияБУ) < втДанныеДокумента.Стоимость
	|				ИЛИ втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ = 0	
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ - ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ, 0) - втДанныеДокумента.Стоимость) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаУценкиСтоимости,
	|	ВЫБОР
	|		КОГДА втОстаткиПоСчетам.ОбъектУчета ЕСТЬ NULL 
	|				ИЛИ (втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ - втОстаткиПоСчетам.НакопленнаяАмортизацияБУ) > втДанныеДокумента.Стоимость
	|				ИЛИ (втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ - втОстаткиПоСчетам.НакопленнаяАмортизацияБУ) = 0
	|				ИЛИ втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((втОстаткиПоСчетам.НакопленнаяАмортизацияБУ)*((втДанныеДокумента.Стоимость/(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ - втОстаткиПоСчетам.НакопленнаяАмортизацияБУ))-1) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаДооценкиАмортизации,
	|	ВЫБОР
	|		КОГДА втОстаткиПоСчетам.ОбъектУчета ЕСТЬ NULL 
	|				ИЛИ (втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ - втОстаткиПоСчетам.НакопленнаяАмортизацияБУ) < втДанныеДокумента.Стоимость
	|				ИЛИ (втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ - втОстаткиПоСчетам.НакопленнаяАмортизацияБУ) = 0
	|				ИЛИ втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ = 0
	|			ТОГДА 0
	|		ИНАЧЕ -ВЫРАЗИТЬ((втОстаткиПоСчетам.НакопленнаяАмортизацияБУ)*((втДанныеДокумента.Стоимость/(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ - втОстаткиПоСчетам.НакопленнаяАмортизацияБУ))-1) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаУценкиАмортизации,
	|	ЕСТЬNULL(втПредыдущаяПереоценкаСтоимости.СуммаДооценки, 0) КАК СуммаПрошлойДооценкиСтоимости,
	|	ЕСТЬNULL(втПредыдущаяПереоценкаСтоимости.СуммаУценки, 0) КАК СуммаПрошлойУценкиСтоимости,
	|	ЕСТЬNULL(втПредыдущаяПереоценкаАмортизации.СуммаДооценки, 0) КАК СуммаПрошлойДооценкиАмортизации,
	|	ЕСТЬNULL(втПредыдущаяПереоценкаАмортизации.СуммаУценки, 0) КАК СуммаПрошлойУценкиАмортизации
	|ПОМЕСТИТЬ втДанныеДляПроведения
	|ИЗ
	|	втДанныеДокумента КАК втДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСчетаОтражения КАК втСчетаОтражения
	|		ПО втДанныеДокумента.ОбъектУчета = втСчетаОтражения.ОбъектУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиПоСчетам КАК втОстаткиПоСчетам
	|		ПО втДанныеДокумента.ОбъектУчета = втОстаткиПоСчетам.ОбъектУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПредыдущаяПереоценкаСтоимости КАК втПредыдущаяПереоценкаСтоимости
	|		ПО втДанныеДокумента.ОбъектУчета = втПредыдущаяПереоценкаСтоимости.ОбъектУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПредыдущаяПереоценкаАмортизации КАК втПредыдущаяПереоценкаАмортизации
	|		ПО втДанныеДокумента.ОбъектУчета = втПредыдущаяПереоценкаАмортизации.ОбъектУчета" + ";";
	
КонецФункции


Функция ТекстОтраженияВРеглУчетеУКР() Экспорт
	
	Разделитель = Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;
	
	Возврат УчетОСВызовСервера.ТекстОтраженияВРеглУчетеНачисленнойАмортизации()
		+ Разделитель + ДооценкаВосстановительнойСтоимости()
		+ Разделитель + ДооценкаВосстановительнойСтоимостиИзДолиУценки()
		+ Разделитель + ДооценкаВосстановительнойСтоимостиИзУценки()		
		+ Разделитель + ДооценкаНакопленнойАмортизации()
		+ Разделитель + УценкаВосстановительнойСтоимости()
		+ Разделитель + УценкаВосстановительнойСтоимостиИзДолиДооценки()
		+ Разделитель + УценкаВосстановительнойСтоимостиИзДооценки()	
		+ Разделитель + УценкаНакопленнойАмортизации();
КонецФункции

Функция ДооценкаВосстановительнойСтоимости()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Дооценка восстановительной стоимости (Дт СчетУчета :: Кт СчетУчетаДооценокОС)
	|ВЫБРАТЬ 
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости - втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости  КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|   НалоговыеНазначенияОС.НалоговоеНазначение КАК НалоговоеНазначениеДт,
	|	
	|	втДанныеДляПроведения.СчетУчета КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|   ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка) КАК НалоговоеНазначениеКт,
	|	
	|	втДанныеДляПроведения.СчетУчетаДооценокОС КАК СчетКт,	
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Переоценка ОС"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТНалоговыеНазначенияОС КАК НалоговыеНазначенияОС
	|		ПО втДанныеДляПроведения.ОбъектУчета = НалоговыеНазначенияОС.ОбъектУчета
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаДооценкиСтоимости > втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости
	|";
КонецФункции

Функция ДооценкаВосстановительнойСтоимостиИзДолиУценки()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Дооценка восстановительной стоимости из уценки (Дт СчетУчета :: Кт 746(742))
	|ВЫБРАТЬ 
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|   НалоговыеНазначенияОС.НалоговоеНазначение КАК НалоговоеНазначениеДт,
	|	
	|	втДанныеДляПроведения.СчетУчета КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	втДанныеДляПроведения.СтатьяДоходов КАК АналитикаУчетаКт,
	|	втДанныеДляПроведения.Подразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|   ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка) КАК НалоговоеНазначениеКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|	втДанныеДляПроведения.СтатьяДоходов КАК СубконтоКт1,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт2,
	|	втДанныеДляПроведения.АналитикаДоходов КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Переоценка ОС"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТНалоговыеНазначенияОС КАК НалоговыеНазначенияОС
	|		ПО втДанныеДляПроведения.ОбъектУчета = НалоговыеНазначенияОС.ОбъектУчета
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаДооценкиСтоимости < втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости
	|";
КонецФункции

Функция ДооценкаВосстановительнойСтоимостиИзУценки()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Дооценка восстановительной стоимости из предыдущей уценки (Дт СчетУчета :: Кт 746(742))
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|   НалоговыеНазначенияОС.НалоговоеНазначение КАК НалоговоеНазначениеДт,
	|	
	|	втДанныеДляПроведения.СчетУчета КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	втДанныеДляПроведения.СтатьяДоходов КАК АналитикаУчетаКт,
	|	втДанныеДляПроведения.Подразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|   ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка) КАК НалоговоеНазначениеКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|	втДанныеДляПроведения.СтатьяДоходов КАК СубконтоКт1,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт2,
	|	втДанныеДляПроведения.АналитикаДоходов КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Переоценка ОС"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТНалоговыеНазначенияОС КАК НалоговыеНазначенияОС
	|		ПО втДанныеДляПроведения.ОбъектУчета = НалоговыеНазначенияОС.ОбъектУчета
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаДооценкиСтоимости >= втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости
	|";
КонецФункции

Функция ДооценкаНакопленнойАмортизации()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Дооценка накопленной амортизации (Дт СчетУчета :: Кт СчетАмортизации)
	|ВЫБРАТЬ 
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаДооценкиАмортизации КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|   НалоговыеНазначенияОС.НалоговоеНазначение КАК НалоговоеНазначениеДт,
	|	
	|	втДанныеДляПроведения.СчетУчета КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|   НалоговыеНазначенияОС.НалоговоеНазначение КАК НалоговоеНазначениеКт,
	|	
	|	втДанныеДляПроведения.СчетАмортизации КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Переоценка ОС"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТНалоговыеНазначенияОС КАК НалоговыеНазначенияОС
	|		ПО втДанныеДляПроведения.ОбъектУчета = НалоговыеНазначенияОС.ОбъектУчета
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценкиАмортизации > 0
	|";
КонецФункции

Функция УценкаВосстановительнойСтоимости()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уценка накопленной амортизации (Дт 975(972) :: Кт СчетУчета)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	втДанныеДляПроведения.СуммаУценкиСтоимости - втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости  КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	втДанныеДляПроведения.СтатьяРасходов КАК АналитикаУчетаДт,
	|	втДанныеДляПроведения.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|   ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка) КАК НалоговоеНазначениеДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	втДанныеДляПроведения.СтатьяРасходов КАК СубконтоДт1,
	|	втДанныеДляПроведения.АналитикаРасходов КАК СубконтоДт2,
	|   ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	| 	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|   НалоговыеНазначенияОС.НалоговоеНазначение КАК НалоговоеНазначениеКт,
	|	
	|	втДанныеДляПроведения.СчетУчета КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	| 	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Переоценка ОС"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО втДанныеДляПроведения.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходов = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТНалоговыеНазначенияОС КАК НалоговыеНазначенияОС
	|		ПО втДанныеДляПроведения.ОбъектУчета = НалоговыеНазначенияОС.ОбъектУчета
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаУценкиСтоимости > втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости
	|";
КонецФункции

Функция УценкаВосстановительнойСтоимостиИзДолиДооценки()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уценка восстановительной стоимости из дооценки (Дт СчетДооценки :: Кт СчетУчета)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаУценкиСтоимости КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|   ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка) КАК НалоговоеНазначениеДт,
	|	
	|	втДанныеДляПроведения.СчетУчетаДооценокОС КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаУценкиСтоимости КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|   НалоговыеНазначенияОС.НалоговоеНазначение КАК НалоговоеНазначениеКт,
	|	
	|	втДанныеДляПроведения.СчетУчета КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаУценкиСтоимости КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Переоценка ОС"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТНалоговыеНазначенияОС КАК НалоговыеНазначенияОС
	|		ПО втДанныеДляПроведения.ОбъектУчета = НалоговыеНазначенияОС.ОбъектУчета
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаУценкиСтоимости < втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости
	|";
КонецФункции

Функция УценкаВосстановительнойСтоимостиИзДооценки()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уценка восстановительной стоимости из предыдущей дооценки (Дт СчетДооценки :: Кт СчетУчета)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|   ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка) КАК НалоговоеНазначениеДт,
	|	
	|	втДанныеДляПроведения.СчетУчетаДооценокОС КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,                                                                                      
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|   НалоговыеНазначенияОС.НалоговоеНазначение КАК НалоговоеНазначениеКт,
	|	
	|	втДанныеДляПроведения.СчетУчета КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Переоценка ОС"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТНалоговыеНазначенияОС КАК НалоговыеНазначенияОС
	|		ПО втДанныеДляПроведения.ОбъектУчета = НалоговыеНазначенияОС.ОбъектУчета
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаУценкиСтоимости >= втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости
	|";
КонецФункции

Функция УценкаНакопленнойАмортизации()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уценка накопленной амортизации (Дт СчетАмортизации :: Кт СчетУчета) 
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаУценкиАмортизации КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|   НалоговыеНазначенияОС.НалоговоеНазначение КАК НалоговоеНазначениеДт,
	|	
	|	втДанныеДляПроведения.СчетАмортизации КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,	
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|   НалоговыеНазначенияОС.НалоговоеНазначение КАК НалоговоеНазначениеКт,
	|	
	|	втДанныеДляПроведения.СчетУчета КАК СчетКт,	
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Переоценка ОС"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТНалоговыеНазначенияОС КАК НалоговыеНазначенияОС
	|		ПО втДанныеДляПроведения.ОбъектУчета = НалоговыеНазначенияОС.ОбъектУчета
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиАмортизации > 0
	|";
КонецФункции


#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область БлокировкаПриОбновленииИБ

Процедура ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(ПредставлениеОперации)
	
	ВходящиеДанные = Новый Соответствие;
	
	УчетОСВызовСервера.ЗаполнитьВходящиеДанныеАмортизации(ВходящиеДанные);
	
	ЗакрытиеМесяцаУТВызовСервера.ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(ВходящиеДанные, ПредставлениеОперации);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
