
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Элементы.ОткрытьСтавкиНалогаНаПрибыль.Видимость =
		ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.СтавкиНалогаНаПрибыль);

	Элементы.ОткрытьНастройкаНумерацииНалоговыхДокументов.Видимость = 
		ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.НастройкаНумерацииНалоговыхДокументов);
	Элементы.ОткрытьНастройкаПечатиНалоговыхДокументов.Видимость = 
		ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.НастройкаПечатиНалоговыхДокументов);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьПланСчетовБухгалтерскогоУчета(Команда)
	
//++ НЕ УТ
	ОткрытьФорму("ПланСчетов.Хозрасчетный.ФормаСписка", , ЭтаФорма);
//-- НЕ УТ
	Возврат; // в УТ11 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтавкиНалогаНаПрибыль(Команда)
	
//++ НЕ УТ
	ОткрытьФорму("РегистрСведений.СтавкиНалогаНаПрибыль.ФормаСписка", , ЭтаФорма);
//-- НЕ УТ
	Возврат; // в УТ11 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУчетныеПолитикиОрганизаций(Команда)
	
	ОткрытьФорму("Справочник.УчетныеПолитикиОрганизаций.ФормаСписка", , ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГодовыеГрафикиАмортизацииОС(Команда)
	
//++ НЕ УТ
	ОткрытьФорму("Справочник.ГодовыеГрафикиАмортизацииОС.ФормаСписка", , ЭтаФорма);
//-- НЕ УТ
	Возврат; // в УТ11 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПоказателиНаработки(Команда)
	
//++ НЕ УТ
	ОткрытьФорму("Справочник.ПоказателиНаработки.ФормаСписка", , ЭтаФорма);
//-- НЕ УТ
	Возврат; // в УТ11 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСобытияОС(Команда)
	
//++ НЕ УТ
	ОткрытьФорму("Справочник.СобытияОС.ФормаСписка", , ЭтаФорма);
//-- НЕ УТ
	Возврат; // в УТ11 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНалоговыеГруппыОС(Команда)
//++ НЕ УТ
	ОткрытьФорму("Справочник.НалоговыеГруппыОсновныхСредств.ФормаСписка", , ЭтаФорма);
//-- НЕ УТ
	Возврат; // в УТ не используется
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыДоговоровПоГК(Команда)
	ОткрытьФорму("Справочник.ВидыДоговоровПоГК.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКлассификаторКодовДляНН(Команда)
	ОткрытьФорму("Справочник.КлассификаторУКТВЭД.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкаНумерацииНалоговыхДокументов(Команда)
	ОткрытьФорму("РегистрСведений.НастройкаНумерацииНалоговыхДокументов.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкаПечатиНалоговыхДокументов(Команда)
	ОткрытьФорму("РегистрСведений.НастройкаПечатиНалоговыхДокументов.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНалоговыеНазначения(Команда)
	ОткрытьФорму("Справочник.НалоговыеНазначенияАктивовИЗатрат.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКлассификаторКОАТУУ(Команда)
	ОткрытьФорму("Справочник.КлассификаторКОАТУУ.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

#КонецОбласти

