////////////////////////////////////////////////////////////////////////////////
// Подсистема "Управление доступом".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет виды доступа, используемые в ограничениях прав доступа.
// Виды доступа Пользователи и ВнешниеПользователи уже заполнены.
// Их можно удалить, если они не требуются для ограничения прав доступа.
//
// Параметры:
//  ВидыДоступа - ТаблицаЗначений - с колонками:
//   * Имя                    - Строка - имя используемое в описании поставляемых
//                                       профилей групп доступа и текстах ОДД.
//   * Представление          - Строка - представляет вид доступа в профилях и группах доступа.
//   * ТипЗначений            - Тип    - тип ссылки значений доступа.
//                                       Например, Тип("СправочникСсылка.Номенклатура").
//   * ТипГруппЗначений       - Тип    - тип ссылки групп значений доступа.
//                                       Например, Тип("СправочникСсылка.ГруппыДоступаНоменклатуры").
//   * НесколькоГруппЗначений - Булево - Истина указывает, что для значения доступа (Номенклатуры), можно
//                                       выбрать несколько групп значений (Групп доступа номенклатуры).
//
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Подразделения";
	ВидДоступа.Представление    = НСтр("ru='Подразделения';uk='Підрозділи'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.СтруктураПредприятия");
	
	//++ НЕ УТ
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ПодразделенияОрганизаций";
	ВидДоступа.Представление    = НСтр("ru='Подразделения организаций';uk='Підрозділи організацій'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.ПодразделенияОрганизаций");
	//-- НЕ УТ	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Склады";
	ВидДоступа.Представление    = НСтр("ru='Склады';uk='Склади'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Склады");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Кассы";
	ВидДоступа.Представление    = НСтр("ru='Кассы';uk='Каси'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Кассы");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "КассыККМ";
	ВидДоступа.Представление    = НСтр("ru='Кассы ККМ';uk='Каси ККМ'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.КассыККМ");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ЭквайринговыеТерминалы";
	ВидДоступа.Представление    = НСтр("ru='Эквайринговые терминалы';uk='Еквайрингові термінали'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.ЭквайринговыеТерминалы");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ВидыЦен";
	ВидДоступа.Представление    = НСтр("ru='Виды цен';uk='Види цін'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.ВидыЦен");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ХозяйственныеОперации";
	ВидДоступа.Представление = НСтр("ru='Хозяйственные операции';uk='Господарські операції'");
	ВидДоступа.ТипЗначений   = Тип("ПеречислениеСсылка.ХозяйственныеОперации");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "СоглашенияСКлиентамиЧтение";
	ВидДоступа.Представление = НСтр("ru='Виды соглашений с клиентами (чтение)';uk='Види оферт клієнтам (читання)'");
	ВидДоступа.ТипЗначений   = Тип("ПеречислениеСсылка.ВидыСоглашенийСКлиентамиДляОграниченияЧтения");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "СоглашенияСКлиентамиИзменение";
	ВидДоступа.Представление = НСтр("ru='Виды соглашений с клиентами (изменение)';uk='Види оферт клієнтам (зміна)'");
	ВидДоступа.ТипЗначений   = Тип("ПеречислениеСсылка.ВидыСоглашенийСКлиентамиДляОграниченияИзменения");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ГруппыНоменклатуры";
	ВидДоступа.Представление    = НСтр("ru='Группы номенклатуры';uk='Групи номенклатури'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Номенклатура");
	ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаНоменклатуры");
	УправлениеДоступом.ДобавитьДополнительныеТипыВидаДоступа(ВидДоступа,
		Тип("СправочникСсылка.ВидыНоменклатуры"),
		Тип("СправочникСсылка.ГруппыДоступаНоменклатуры"));
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ГруппыПартнеров";
	ВидДоступа.Представление    = НСтр("ru='Группы партнеров';uk='Групи партнерів'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Партнеры");
	ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаПартнеров");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ГруппыФизическихЛиц";
	ВидДоступа.Представление    = НСтр("ru='Группы физических лиц';uk='Групи фізичних осіб'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.ФизическиеЛица");
	ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаФизическихЛиц");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ТипыОснованийАктаОРасхождениях";
	ВидДоступа.Представление = НСтр("ru='Типы оснований акта о расхождениях';uk='Типи підстав акта про розбіжності'");
	ВидДоступа.ТипЗначений   = Тип("ПеречислениеСсылка.ТипыОснованияАктаОРасхождении");

	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ВидыОперацийВзаимозачетаЗадолженности";
	ВидДоступа.Представление = НСтр("ru='Виды операций взаимозачета задолженности';uk='Види операцій взаємозаліку заборгованості'");
	ВидДоступа.ТипЗначений   = Тип("ПеречислениеСсылка.ВидыОперацийВзаимозачетаЗадолженности");

КонецПроцедуры

// Заполняет описания поставляемых профилей групп доступа и
// переопределяет параметры обновления профилей и групп доступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  ОписанияПрофилей    - Массив - массив структур, в который нужно добавить описания.
//                        Пустая структура должна быть получена при помощи функции.
//                        УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа.
//
//  ПараметрыОбновления - Структура - структура со свойствами:
//   * ОбновлятьИзмененныеПрофили - Булево - начальное значение Истина.
//   * ЗапретитьИзменениеПрофилей - Булево - начальное значение Истина.
//       Если установить Ложь, тогда поставляемые профили можно не только просматривать, но и редактировать.
//   * ОбновлятьГруппыДоступа     - Булево - начальное значение Истина.
//   * ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево - начальное значение Ложь.
//       Если установить Истина, то настройки значений, выполненные администратором для
//       вида доступа который был удален из профиля, будут также удалены из групп доступа.
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	УправлениеДоступомУТ.ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления);
	//++ НЕ УТ
	УправлениеДоступомКА.ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления);
	//-- НЕ УТ
	//++ НЕ УТКА
	УправлениеДоступомУП.ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления);
	//-- НЕ УТКА
	
КонецПроцедуры

// Заполняет зависимости прав доступа "подчиненного" объекта, например, задачи ЗадачаИсполнителя,
// от "ведущего" объекта, например,  бизнес-процесса Задание, которые отличаются от стандартных.
//
// Зависимости прав используются в стандартном шаблоне ограничения доступа для вида доступа "Объект":
// 1) стандартно при чтении "подчиненного" объекта
//    проверяется наличие права чтения "ведущего" объекта
//    и проверяется отсутствие ограничения чтения "ведущего" объекта;
// 2) стандартно при добавлении, изменении, удалении "подчиненного" объекта
//    проверяется наличие права изменения "ведущего" объекта
//    и проверяется отсутствие ограничения изменения "ведущего" объекта.
//
// Допускается только одно переназначение по сравнению со стандартным:
// в пункте "2)" вместо проверки права изменения "ведущего" объекта установить
// проверку права чтения "ведущего" объекта.
//
// Параметры:
//  ЗависимостиПрав - ТаблицаЗначений - с колонками:
//   * ВедущаяТаблица     - Строка - например, Метаданные.БизнесПроцессы.Задание.ПолноеИмя().
//   * ПодчиненнаяТаблица - Строка - например, Метаданные.Задачи.ЗадачаИсполнителя.ПолноеИмя().
//
Процедура ПриЗаполненииЗависимостейПравДоступа(ЗависимостиПрав) Экспорт
	
	
	
КонецПроцедуры

// Заполняет описания возможных прав, назначаемых для объектов, указанных типов.
// 
// Параметры:
//  ВозможныеПрава - ТаблицаЗначений - с колонками, описание которых см. в комментарии
//                   к функции РегистрыСведений.НастройкиПравОбъектов.ВозможныеПрава().
//
Процедура ПриЗаполненииВозможныхПравДляНастройкиПравОбъектов(ВозможныеПрава) Экспорт
	
КонецПроцедуры

// Определяет вид используемого интерфейса пользователя для настройки доступа.
//
// Параметры:
//  УпрощенныйИнтерфейс - Булево - начальное значение Ложь.
//
Процедура ПриОпределенииИнтерфейсаНастройкиДоступа(УпрощенныйИнтерфейс) Экспорт
	
	УпрощенныйИнтерфейс = ПолучитьФункциональнуюОпцию("БазоваяВерсия");
	
КонецПроцедуры

// Заполняет использование видов доступа в зависимости от функциональных опций конфигурации,
// например, ИспользоватьГруппыДоступаНоменклатуры.
//
// Параметры:
//  ВидДоступа    - Строка - имя вида доступа заданное в процедуре ПриЗаполненииВидовДоступа.
//  Использование - Булево - начальное значение Истина.
// 
Процедура ПриЗаполненииИспользованияВидаДоступа(ВидДоступа, Использование) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ВидДоступа = "ГруппыНоменклатуры" Тогда
		
		Использование = Константы.ИспользоватьГруппыДоступаНоменклатуры.Получить();
		
	ИначеЕсли ВидДоступа = "ГруппыПартнеров" Тогда
		
		Использование = Константы.ИспользоватьГруппыДоступаПартнеров.Получить();
		
	ИначеЕсли ВидДоступа = "ГруппыФизическихЛиц" Тогда
		
		ИмяКонстанты = "ОграничиватьДоступНаУровнеЗаписейФизическиеЛица";
		Если Метаданные.Константы.Найти(ИмяКонстанты) <> Неопределено Тогда
			Использование = Константы[ИмяКонстанты].Получить();
		Иначе
			Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Справочник.ГруппыДоступаФизическихЛиц");
			Использование = НЕ Запрос.Выполнить().Пустой();
		КонецЕсли;
		
	ИначеЕсли ВидДоступа = "ХозяйственныеОперации"
	 ИЛИ ВидДоступа = "СоглашенияСКлиентамиЧтение"
	  ИЛИ ВидДоступа = "СоглашенияСКлиентамиИзменение" Тогда
		
		Использование = Истина;
		
	//++ НЕ УТ 
	ИначеЕсли ВидДоступа = "ПодразделенияОрганизаций" Тогда
		
		Использование = Константы.ОграничиватьДоступНаУровнеЗаписейПодразделенияОрганизаций.Получить();
	//-- НЕ УТ 
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые в шаблонах ограничения доступа
// явно, а виды доступа, используемые в наборах значений доступа могут быть получены из текущего
// состояния регистра сведений НаборыЗначенийДоступа.
//
//  Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  Описание     - Строка - многострочная строка формата <Таблица>.<Право>.<ВидДоступа>[.Таблица объекта].
//                 Например, Документ.ПриходнаяНакладная.Чтение.Организации
//                           Документ.ПриходнаяНакладная.Чтение.Контрагенты
//                           Документ.ПриходнаяНакладная.Изменение.Организации
//                           Документ.ПриходнаяНакладная.Изменение.Контрагенты
//                           Документ.ЭлектронныеПисьма.Чтение.Объект.Документ.ЭлектронныеПисьма
//                           Документ.ЭлектронныеПисьма.Изменение.Объект.Документ.ЭлектронныеПисьма
//                           Документ.Файлы.Чтение.Объект.Справочник.ПапкиФайлов
//                           Документ.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмо
//                           Документ.Файлы.Изменение.Объект.Справочник.ПапкиФайлов
//                           Документ.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмо
//                 Вид доступа Объект предопределен, как литерал. Этот вид доступа используется в
//                 шаблонах ограничений доступа, как "ссылка" на другой объект, по которому
//                 ограничивается текущий объект таблицы.
//                 Когда вид доступа "Объект" задан, также требуется задать типы таблиц,
//                 которые используются для этого вида доступа. Т.е. перечислить типы,
//                 которые соответствуют полю, использованному в шаблоне ограничения доступа
//                 в паре с видом доступа "Объект". При перечислении типов по виду доступа "Объект"
//                 нужно перечислить только те типы поля, которые есть у поля.
//                 РегистрыСведений.НаборыЗначенийДоступа.Объект, остальные типы лишние.
// 
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	//++ НЕ УТКА
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы.Чтение.Склады
	|Справочник.АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы.Изменение.Склады
	|Справочник.АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.БанковскиеСчетаКонтрагентов.Чтение.ВнешниеПользователи
	|Справочник.БанковскиеСчетаКонтрагентов.Изменение.ВнешниеПользователи
	|Справочник.БанковскиеСчетаОрганизаций.Чтение.Организации
	|Справочник.ВариантыКомплектацииНоменклатуры.Изменение.ГруппыНоменклатуры
	|Справочник.ВерсииФайлов.Чтение.ГруппыПартнеров
	|Справочник.ВерсииФайлов.Чтение.ГруппыФизическихЛиц
	|Справочник.ВерсииФайлов.Чтение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ФизическиеЛица
	|Справочник.ВерсииФайлов.Изменение.ГруппыПартнеров
	|Справочник.ВерсииФайлов.Изменение.ГруппыФизическихЛиц
	|Справочник.ВерсииФайлов.Изменение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ФизическиеЛица
	|Справочник.ВзаимозачетЗадолженностиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ВзаимозачетЗадолженностиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВзаимозачетЗадолженностиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ВзаимозачетЗадолженностиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВидыЗапасов.Чтение.Организации
	|Справочник.ВидыНоменклатуры.Изменение.ГруппыНоменклатуры
	|Справочник.ВидыЦен.Чтение.ВидыЦен
	|Справочник.ВидыЦен.Изменение.ВидыЦен
	|Справочник.ВидыЦенПоставщиков.Чтение.ГруппыПартнеров
	|Справочник.ВидыЦенПоставщиков.Изменение.ГруппыПартнеров
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ВыкупВозвратнойТарыУПоставщикаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВыкупВозвратнойТарыУПоставщикаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ГруппыДоступаПартнеров.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентов.Чтение.ВнешниеПользователи
	|Справочник.ДоговорыКонтрагентов.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентов.Чтение.Организации
	|Справочник.ДоговорыКонтрагентов.Чтение.ХозяйственныеОперации
	|Справочник.ДоговорыКонтрагентов.Изменение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентов.Изменение.Организации
	|Справочник.ДоговорыКонтрагентов.Изменение.ХозяйственныеОперации
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Чтение.ХозяйственныеОперации
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Изменение.ХозяйственныеОперации
	|Справочник.ДоговорыКредитовИДепозитов.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыКредитовИДепозитов.Чтение.Организации
	|Справочник.ДоговорыКредитовИДепозитов.Изменение.ГруппыПартнеров
	|Справочник.ДоговорыКредитовИДепозитов.Изменение.Организации
	|Справочник.ДоговорыКредитовИДепозитовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыКредитовИДепозитовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДоговорыКредитовИДепозитовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ДоговорыКредитовИДепозитовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДоговорыЛизинга.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыЛизинга.Чтение.Организации
	|Справочник.ДоговорыЛизингаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыЛизингаПрисоединенныеФайлы.Чтение.Организации	
	|Справочник.ЗаданиеНаПеревозкуПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаданиеНаПеревозкуПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗадачиПроектов.Чтение.Объект.Справочник.МаркетинговыеМероприятия
	|Справочник.ЗадачиПроектов.Чтение.Объект.Справочник.ПретензииКлиентов
	|Справочник.ЗадачиПроектов.Чтение.Объект.Справочник.Проекты
	|Справочник.ЗадачиПроектов.Чтение.Объект.Справочник.СделкиСКлиентами
	|Справочник.ЗадачиПроектов.Изменение.Объект.Справочник.МаркетинговыеМероприятия
	|Справочник.ЗадачиПроектов.Изменение.Объект.Справочник.ПретензииКлиентов
	|Справочник.ЗадачиПроектов.Изменение.Объект.Справочник.Проекты
	|Справочник.ЗадачиПроектов.Изменение.Объект.Справочник.СделкиСКлиентами
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗаказМатериаловВПроизводствоПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказМатериаловВПроизводствоПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаказМатериаловВПроизводствоПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаказМатериаловВПроизводствоПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаказМатериаловВПроизводствоПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаказМатериаловВПроизводствоПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗарплатныеПроекты.Чтение.Организации
	|Справочник.ЗарплатныеПроекты.Изменение.Организации
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.Пользователи
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.ХозяйственныеОперации
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.Пользователи
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.ХозяйственныеОперации
	|Справочник.Кассы.Чтение.Кассы
	|Справочник.Кассы.Чтение.Организации
	|Справочник.КассыККМ.Чтение.КассыККМ
	|Справочник.КассыККМ.Чтение.Организации
	|Справочник.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КонтактныеЛицаПартнеров.Чтение.ВнешниеПользователи
	|Справочник.КонтактныеЛицаПартнеров.Чтение.ГруппыПартнеров
	|Справочник.КонтактныеЛицаПартнеров.Изменение.ВнешниеПользователи
	|Справочник.КонтактныеЛицаПартнеров.Изменение.ГруппыПартнеров
	|Справочник.Контрагенты.Чтение.ВнешниеПользователи
	|Справочник.Контрагенты.Чтение.ГруппыПартнеров
	|Справочник.Контрагенты.Изменение.ВнешниеПользователи
	|Справочник.Контрагенты.Изменение.ГруппыПартнеров
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Чтение.Склады
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Изменение.Склады
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Чтение.Склады
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Изменение.Склады
	|Справочник.НаборыДополнительныхРеквизитовИСведений.Изменение.ГруппыНоменклатуры
	|Справочник.Номенклатура.Изменение.ГруппыНоменклатуры
	|Справочник.НоменклатураПоставщиков.Чтение.ГруппыПартнеров
	|Справочник.НоменклатураПоставщиков.Изменение.ГруппыПартнеров
	|Справочник.НоменклатураПоставщиковПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.НоменклатураПоставщиковПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.НоменклатураПрисоединенныеФайлы.Изменение.ГруппыНоменклатуры
	|Справочник.ОбластиХранения.Чтение.Склады
	|Справочник.ОбластиХранения.Изменение.Склады
	|Справочник.ОбразованиеФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|Справочник.ОбразованиеФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|Справочник.ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы.Чтение.Кассы
	|Справочник.ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы.Изменение.Кассы
	|Справочник.ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы.Изменение.Организации
	|Справочник.Организации.Чтение.Организации
	|Справочник.Организации.Изменение.Организации
	|Справочник.ОрганизацииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтветственныеЛицаОрганизаций.Чтение.Организации
	|Справочник.ОтчетДавальцуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ОтчетДавальцуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтчетДавальцуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ОтчетДавальцуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ОтчетДавальцуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетДавальцуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.Партнеры.Чтение.ВнешниеПользователи
	|Справочник.Партнеры.Чтение.ГруппыПартнеров
	|Справочник.Партнеры.Изменение.ГруппыПартнеров
	|Справочник.ПартнерыПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПартнерыПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПередачаМатериаловВПроизводствоПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПередачаМатериаловВПроизводствоПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПередачаМатериаловВПроизводствоПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПередачаМатериаловВПроизводствоПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПередачаМатериаловВПроизводствоПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПередачаМатериаловВПроизводствоПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПланПродажПоКатегориямПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПланПродажПоКатегориямПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПланПродажПоКатегориямПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПланПродажПоКатегориямПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПланПродажПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПланПродажПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПланПродажПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПланПродажПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПланПродажПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПланПродажПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПланПроизводстваПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПланПроизводстваПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПодпискиНаРассылкиИОповещенияКлиентам.Чтение.ВнешниеПользователи
	|Справочник.ПодпискиНаРассылкиИОповещенияКлиентам.Чтение.ГруппыПартнеров
	|Справочник.ПодпискиНаРассылкиИОповещенияКлиентам.Изменение.ВнешниеПользователи
	|Справочник.ПодпискиНаРассылкиИОповещенияКлиентам.Изменение.ГруппыПартнеров
	|Справочник.ПодразделенияОрганизаций.Чтение.Организации
	|Справочник.ПодразделенияОрганизаций.Изменение.Организации
	|Справочник.ПоступлениеТоваровУслугПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПоступлениеТоваровУслугПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПоступлениеТоваровУслугПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПоступлениеТоваровУслугПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПоступлениеТоваровУслугПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПоступлениеТоваровУслугПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПоступлениеТоваровУслугПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПоступлениеТоваровУслугПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПоступлениеУслугПрочихАктивовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПоступлениеУслугПрочихАктивовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПоступлениеУслугПрочихАктивовПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПоступлениеУслугПрочихАктивовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПоступлениеУслугПрочихАктивовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПоступлениеУслугПрочихАктивовПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПретензииКлиентов.Чтение.ВнешниеПользователи
	|Справочник.ПретензииКлиентов.Чтение.ГруппыПартнеров
	|Справочник.ПретензииКлиентов.Изменение.ВнешниеПользователи
	|Справочник.ПретензииКлиентов.Изменение.ГруппыПартнеров
	|Справочник.ПретензииКлиентовПрисоединенныеФайлы.Чтение.ВнешниеПользователи
	|Справочник.ПретензииКлиентовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПретензииКлиентовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.РабочиеУчастки.Чтение.Склады
	|Справочник.РабочиеУчастки.Изменение.Склады
	|Справочник.РассылкаКлиентамПрисоединенныеФайлы.Чтение.Объект.Документ.РассылкаКлиентам
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Чтение.Склады
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Изменение.Склады
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.РодственникиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|Справочник.РодственникиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|Справочник.СверкаВзаиморасчетовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СверкаВзаиморасчетовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СверкаВзаиморасчетовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СверкаВзаиморасчетовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СделкиСКлиентами.Чтение.Объект.Справочник.СделкиСКлиентами
	|Справочник.СделкиСКлиентами.Изменение.Объект.Справочник.СделкиСКлиентами
	|Справочник.СделкиСКлиентамиПрисоединенныеФайлы.Чтение.Объект.Справочник.СделкиСКлиентами
	|Справочник.СделкиСКлиентамиПрисоединенныеФайлы.Изменение.Объект.Справочник.СделкиСКлиентами
	|Справочник.СкладскиеПомещения.Чтение.Склады
	|Справочник.СкладскиеЯчейки.Чтение.Склады
	|Справочник.СкладскиеЯчейки.Изменение.Склады
	|Справочник.Склады.Чтение.Склады
	|Справочник.Склады.Изменение.Склады
	|Справочник.СоглашенияСКлиентами.Чтение.ВнешниеПользователи
	|Справочник.СоглашенияСКлиентами.Чтение.ГруппыПартнеров
	|Справочник.СоглашенияСКлиентами.Чтение.Организации
	|Справочник.СоглашенияСКлиентами.Чтение.Склады
	|Справочник.СоглашенияСКлиентами.Изменение.ГруппыПартнеров
	|Справочник.СоглашенияСКлиентами.Изменение.Организации
	|Справочник.СоглашенияСКлиентами.Изменение.Склады
	|Справочник.СоглашенияСКлиентами.Изменение.СоглашенияСКлиентамиИзменение
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Чтение.Склады
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Изменение.Склады
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Изменение.СоглашенияСКлиентамиИзменение
	|Справочник.СоглашенияСПоставщиками.Чтение.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщиками.Чтение.Организации
	|Справочник.СоглашенияСПоставщиками.Чтение.Склады
	|Справочник.СоглашенияСПоставщиками.Изменение.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщиками.Изменение.Организации
	|Справочник.СоглашенияСПоставщиками.Изменение.Склады
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Чтение.Склады
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Изменение.Склады
	|Справочник.Сотрудники.Чтение.Объект.Справочник.Сотрудники
	|Справочник.Сотрудники.Изменение.Объект.Справочник.Сотрудники
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Чтение.ХозяйственныеОперации
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Изменение.ХозяйственныеОперации
	|Справочник.СписаниеЗадолженностиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СписаниеЗадолженностиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СписаниеЗадолженностиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СписаниеЗадолженностиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СтруктураПредприятия.Чтение.Организации
	|Справочник.СтруктураПредприятия.Чтение.Подразделения
	|Справочник.СтруктураПредприятия.Чтение.ПодразделенияОрганизаций
	|Справочник.СтруктураПредприятия.Изменение.Организации
	|Справочник.СтруктураПредприятия.Изменение.ПодразделенияОрганизаций
	|Справочник.СчетНаОплатуКлиентуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетНаОплатуКлиентуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетНаОплатуКлиентуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетНаОплатуКлиентуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ТерриторииВыполненияРабот.Чтение.Организации
	|Справочник.ТерриторииВыполненияРабот.Изменение.Организации
	|Справочник.ТиповыеОперацииМеждународныйУчет.Чтение.Организации
	|Справочник.УдалитьДоговорыЭквайринга.Чтение.Организации
	|Справочник.УдалитьДоговорыЭквайрингаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УпаковкиЕдиницыИзмерения.Изменение.ГруппыНоменклатуры
	|Справочник.УсловияОбслуживанияПартнеровТорговымиПредставителями.Чтение.ГруппыПартнеров
	|Справочник.УсловияОбслуживанияПартнеровТорговымиПредставителями.Изменение.ГруппыПартнеров
	|Справочник.УстановкаЦенНоменклатурыПрисоединенныеФайлы.Чтение.Объект.Документ.УстановкаЦенНоменклатуры
	|Справочник.УстановкаЦенНоменклатурыПрисоединенныеФайлы.Изменение.Объект.Документ.УстановкаЦенНоменклатуры
	|Справочник.Файлы.Чтение.ГруппыПартнеров
	|Справочник.Файлы.Чтение.ГруппыФизическихЛиц
	|Справочник.Файлы.Чтение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.Файлы.Чтение.Объект.Справочник.ФизическиеЛица
	|Справочник.Файлы.Изменение.ГруппыПартнеров
	|Справочник.Файлы.Изменение.ГруппыФизическихЛиц
	|Справочник.Файлы.Изменение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.Файлы.Изменение.Объект.Справочник.ФизическиеЛица
	|Справочник.ФизическиеЛица.Чтение.ГруппыФизическихЛиц
	|Справочник.ФизическиеЛица.Изменение.ГруппыФизическихЛиц
	|Справочник.ХарактеристикиНоменклатуры.Изменение.ГруппыНоменклатуры
	|Справочник.ШтатноеРасписание.Чтение.Организации
	|Справочник.ШтатноеРасписание.Чтение.ПодразделенияОрганизаций
	|Справочник.ШтатноеРасписание.Изменение.Организации
	|Справочник.ШтатноеРасписание.Изменение.ПодразделенияОрганизаций
	|Справочник.ЭквайринговыеТерминалы.Чтение.Организации
	|Справочник.ЭквайринговыеТерминалы.Чтение.ЭквайринговыеТерминалы
	|Справочник.ЭкземплярБюджетаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЭкземплярБюджетаПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЭкземплярБюджетаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЭкземплярБюджетаПрисоединенныеФайлы.Изменение.Подразделения
	|Документ.АвансовыйОтчет.Чтение.ГруппыПартнеров
	|Документ.АвансовыйОтчет.Чтение.ГруппыФизическихЛиц
	|Документ.АвансовыйОтчет.Чтение.Организации
	|Документ.АвансовыйОтчет.Чтение.Подразделения
	|Документ.АвансовыйОтчет.Изменение.ГруппыПартнеров
	|Документ.АвансовыйОтчет.Изменение.ГруппыФизическихЛиц
	|Документ.АвансовыйОтчет.Изменение.Организации
	|Документ.АвансовыйОтчет.Изменение.Подразделения
	|Документ.АктВыполненныхРабот.Чтение.ВнешниеПользователи
	|Документ.АктВыполненныхРабот.Чтение.ГруппыПартнеров
	|Документ.АктВыполненныхРабот.Чтение.Организации
	|Документ.АктВыполненныхРабот.Чтение.Подразделения
	|Документ.АктВыполненныхРабот.Изменение.ГруппыПартнеров
	|Документ.АктВыполненныхРабот.Изменение.Организации
	|Документ.АктВыполненныхРабот.Изменение.Подразделения
	|Документ.АктОРасхожденияхПослеОтгрузки.Чтение.ВнешниеПользователи
	|Документ.АктОРасхожденияхПослеОтгрузки.Чтение.ГруппыПартнеров
	|Документ.АктОРасхожденияхПослеОтгрузки.Чтение.Организации
	|Документ.АктОРасхожденияхПослеОтгрузки.Чтение.ТипыОснованийАктаОРасхождениях
	|Документ.АктОРасхожденияхПослеОтгрузки.Изменение.ВнешниеПользователи
	|Документ.АктОРасхожденияхПослеОтгрузки.Изменение.ГруппыПартнеров
	|Документ.АктОРасхожденияхПослеОтгрузки.Изменение.Организации
	|Документ.АктОРасхожденияхПослеОтгрузки.Изменение.ТипыОснованийАктаОРасхождениях
	|Документ.АктОРасхожденияхПослеПеремещения.Чтение.Организации
	|Документ.АктОРасхожденияхПослеПеремещения.Чтение.Склады
	|Документ.АктОРасхожденияхПослеПеремещения.Изменение.Организации
	|Документ.АктОРасхожденияхПослеПеремещения.Изменение.Склады
	|Документ.АктОРасхожденияхПослеПриемки.Чтение.ГруппыПартнеров
	|Документ.АктОРасхожденияхПослеПриемки.Чтение.Организации
	|Документ.АктОРасхожденияхПослеПриемки.Чтение.ТипыОснованийАктаОРасхождениях
	|Документ.АктОРасхожденияхПослеПриемки.Изменение.ГруппыПартнеров
	|Документ.АктОРасхожденияхПослеПриемки.Изменение.Организации
	|Документ.АктОРасхожденияхПослеПриемки.Изменение.ТипыОснованийАктаОРасхождениях
	|Документ.АктПриемкиВыполненныхРаботОказанныхУслуг.Чтение.ГруппыФизическихЛиц
	|Документ.АктПриемкиВыполненныхРаботОказанныхУслуг.Чтение.Организации
	|Документ.АктПриемкиВыполненныхРаботОказанныхУслуг.Изменение.ГруппыФизическихЛиц
	|Документ.АктПриемкиВыполненныхРаботОказанныхУслуг.Изменение.Организации
	|Документ.АктПроверкиСтраховыхВзносов.Чтение.ГруппыФизическихЛиц
	|Документ.АктПроверкиСтраховыхВзносов.Чтение.Организации
	|Документ.АктПроверкиСтраховыхВзносов.Изменение.ГруппыФизическихЛиц
	|Документ.АктПроверкиСтраховыхВзносов.Изменение.Организации
	|Документ.АмортизацияНМА.Чтение.Организации
	|Документ.АмортизацияНМА.Изменение.Организации
	|Документ.АмортизацияНМАМеждународныйУчет.Чтение.Организации
	|Документ.АмортизацияНМАМеждународныйУчет.Изменение.Организации
	|Документ.АмортизацияОС.Чтение.Организации
	|Документ.АмортизацияОС.Изменение.Организации
	|Документ.АмортизацияОСМеждународныйУчет.Чтение.Организации
	|Документ.АмортизацияОСМеждународныйУчет.Изменение.Организации
	|Документ.БольничныйЛист.Чтение.ГруппыФизическихЛиц
	|Документ.БольничныйЛист.Чтение.Организации
	|Документ.БольничныйЛист.Изменение.ГруппыФизическихЛиц
	|Документ.БольничныйЛист.Изменение.Организации
	|Документ.ВводНачальныхОстатковОтпусков.Чтение.ГруппыФизическихЛиц
	|Документ.ВводНачальныхОстатковОтпусков.Чтение.Организации
	|Документ.ВводНачальныхОстатковОтпусков.Изменение.ГруппыФизическихЛиц
	|Документ.ВводНачальныхОстатковОтпусков.Изменение.Организации
	|Документ.ВводОстатков.Чтение.Организации
	|Документ.ВводОстатков.Чтение.Склады
	|Документ.ВводОстатков.Изменение.Организации
	|Документ.ВводОстатков.Изменение.Склады
	|Документ.ВедомостьНаВыплатуЗарплатыВБанк.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыВБанк.Чтение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВБанк.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыВБанк.Изменение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВКассу.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыВКассу.Чтение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВКассу.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыВКассу.Изменение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыПеречислением.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыПеречислением.Чтение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыПеречислением.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыПеречислением.Изменение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком.Чтение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком.Изменение.Организации
	|Документ.ВзаимозачетЗадолженности.Чтение.ГруппыПартнеров
	|Документ.ВзаимозачетЗадолженности.Чтение.Организации
	|Документ.ВзаимозачетЗадолженности.Изменение.ВидыОперацийВзаимозачетаЗадолженности
	|Документ.ВзаимозачетЗадолженности.Изменение.ГруппыПартнеров
	|Документ.ВзаимозачетЗадолженности.Изменение.Организации
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Чтение.Кассы
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Чтение.КассыККМ
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Чтение.Организации
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Изменение.Кассы
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Изменение.КассыККМ
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Изменение.Организации
	|Документ.ВнутреннееПотреблениеТоваров.Чтение.Организации
	|Документ.ВнутреннееПотреблениеТоваров.Чтение.Подразделения
	|Документ.ВнутреннееПотреблениеТоваров.Чтение.Склады
	|Документ.ВнутреннееПотреблениеТоваров.Изменение.Организации
	|Документ.ВнутреннееПотреблениеТоваров.Изменение.Подразделения
	|Документ.ВнутреннееПотреблениеТоваров.Изменение.Склады
	|Документ.ВозвратИзОтпускаПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|Документ.ВозвратИзОтпускаПоУходуЗаРебенком.Чтение.Организации
	|Документ.ВозвратИзОтпускаПоУходуЗаРебенком.Изменение.ГруппыФизическихЛиц
	|Документ.ВозвратИзОтпускаПоУходуЗаРебенком.Изменение.Организации
	|Документ.ВозвратМатериаловИзПроизводства.Чтение.Организации
	|Документ.ВозвратМатериаловИзПроизводства.Чтение.Подразделения
	|Документ.ВозвратМатериаловИзПроизводства.Чтение.Склады
	|Документ.ВозвратМатериаловИзПроизводства.Изменение.Организации
	|Документ.ВозвратМатериаловИзПроизводства.Изменение.Подразделения
	|Документ.ВозвратМатериаловИзПроизводства.Изменение.Склады
	|Документ.ВозвратОСОтАрендатора.Чтение.Организации
	|Документ.ВозвратОСОтАрендатора.Изменение.Организации
	|Документ.ВозвратСырьяДавальцу.Чтение.ГруппыПартнеров
	|Документ.ВозвратСырьяДавальцу.Чтение.Организации
	|Документ.ВозвратСырьяДавальцу.Чтение.Подразделения
	|Документ.ВозвратСырьяДавальцу.Чтение.Склады
	|Документ.ВозвратСырьяДавальцу.Изменение.ГруппыПартнеров
	|Документ.ВозвратСырьяДавальцу.Изменение.Организации
	|Документ.ВозвратСырьяДавальцу.Изменение.Подразделения
	|Документ.ВозвратСырьяДавальцу.Изменение.Склады
	|Документ.ВозвратСырьяОтПереработчика.Чтение.ГруппыПартнеров
	|Документ.ВозвратСырьяОтПереработчика.Чтение.Организации
	|Документ.ВозвратСырьяОтПереработчика.Чтение.Подразделения
	|Документ.ВозвратСырьяОтПереработчика.Чтение.Склады
	|Документ.ВозвратСырьяОтПереработчика.Изменение.ГруппыПартнеров
	|Документ.ВозвратСырьяОтПереработчика.Изменение.Организации
	|Документ.ВозвратСырьяОтПереработчика.Изменение.Подразделения
	|Документ.ВозвратСырьяОтПереработчика.Изменение.Склады
	|Документ.ВозвратТоваровМеждуОрганизациями.Чтение.Организации
	|Документ.ВозвратТоваровМеждуОрганизациями.Изменение.Организации
	|Документ.ВозвратТоваровОтКлиента.Чтение.ВнешниеПользователи
	|Документ.ВозвратТоваровОтКлиента.Чтение.ГруппыПартнеров
	|Документ.ВозвратТоваровОтКлиента.Чтение.Организации
	|Документ.ВозвратТоваровОтКлиента.Чтение.Подразделения
	|Документ.ВозвратТоваровОтКлиента.Чтение.Склады
	|Документ.ВозвратТоваровОтКлиента.Изменение.ГруппыПартнеров
	|Документ.ВозвратТоваровОтКлиента.Изменение.Организации
	|Документ.ВозвратТоваровОтКлиента.Изменение.Подразделения
	|Документ.ВозвратТоваровОтКлиента.Изменение.Склады
	|Документ.ВозвратТоваровПоставщику.Чтение.ГруппыПартнеров
	|Документ.ВозвратТоваровПоставщику.Чтение.Организации
	|Документ.ВозвратТоваровПоставщику.Чтение.Подразделения
	|Документ.ВозвратТоваровПоставщику.Чтение.Склады
	|Документ.ВозвратТоваровПоставщику.Изменение.ГруппыПартнеров
	|Документ.ВозвратТоваровПоставщику.Изменение.Организации
	|Документ.ВозвратТоваровПоставщику.Изменение.Подразделения
	|Документ.ВозвратТоваровПоставщику.Изменение.Склады
	|Документ.ВходящаяСправкаОЗаработкеДляРасчетаПособий.Чтение.ГруппыФизическихЛиц
	|Документ.ВходящаяСправкаОЗаработкеДляРасчетаПособий.Чтение.Организации
	|Документ.ВходящаяСправкаОЗаработкеДляРасчетаПособий.Изменение.ГруппыФизическихЛиц
	|Документ.ВходящаяСправкаОЗаработкеДляРасчетаПособий.Изменение.Организации
	|Документ.ВходящаяСправкаОРасчетеБольничного.Чтение.ГруппыФизическихЛиц
	|Документ.ВходящаяСправкаОРасчетеБольничного.Чтение.Организации
	|Документ.ВходящаяСправкаОРасчетеБольничного.Изменение.ГруппыФизическихЛиц
	|Документ.ВходящаяСправкаОРасчетеБольничного.Изменение.Организации	
	|Документ.ВыбытиеАрендованныхОС.Чтение.Организации
	|Документ.ВыбытиеАрендованныхОС.Изменение.Организации
	|Документ.ВыбытиеДенежныхДокументов.Чтение.ГруппыПартнеров
	|Документ.ВыбытиеДенежныхДокументов.Чтение.Организации
	|Документ.ВыбытиеДенежныхДокументов.Чтение.Подразделения
	|Документ.ВыбытиеДенежныхДокументов.Изменение.ГруппыПартнеров
	|Документ.ВыбытиеДенежныхДокументов.Изменение.Организации
	|Документ.ВыбытиеДенежныхДокументов.Изменение.Подразделения
	|Документ.ВыгрузкаРегламентированныхОтчетов.Чтение.Организации
	|Документ.ВыгрузкаРегламентированныхОтчетов.Изменение.Организации
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Чтение.КассыККМ
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Чтение.Организации
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Изменение.КассыККМ
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Изменение.Организации
	|Документ.ВыкупВозвратнойТарыКлиентом.Чтение.Организации
	|Документ.ВыкупВозвратнойТарыКлиентом.Изменение.Организации
	|Документ.ВыкупВозвратнойТарыУПоставщика.Чтение.Организации
	|Документ.ВыкупВозвратнойТарыУПоставщика.Изменение.Организации
	|Документ.ВыплатаБывшимСотрудникам.Чтение.ГруппыФизическихЛиц
	|Документ.ВыплатаБывшимСотрудникам.Чтение.Организации
	|Документ.ВыплатаБывшимСотрудникам.Изменение.ГруппыФизическихЛиц
	|Документ.ВыплатаБывшимСотрудникам.Изменение.Организации
	|Документ.ВыработкаНМА.Чтение.Организации
	|Документ.ВыработкаНМА.Изменение.Организации
	|Документ.ГрафикОтпусков.Чтение.ГруппыФизическихЛиц
	|Документ.ГрафикОтпусков.Чтение.Организации
	|Документ.ГрафикОтпусков.Изменение.ГруппыФизическихЛиц
	|Документ.ГрафикОтпусков.Изменение.Организации
	|Документ.ДанныеДляРасчетаЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.ДанныеДляРасчетаЗарплаты.Чтение.Организации
	|Документ.ДанныеДляРасчетаЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.ДанныеДляРасчетаЗарплаты.Изменение.Организации
	|Документ.ДвижениеПрочихАктивовПассивов.Чтение.Организации
	|Документ.ДвижениеПрочихАктивовПассивов.Изменение.Организации
	|Документ.ДоверенностьВыданная.Чтение.ГруппыПартнеров
	|Документ.ДоверенностьВыданная.Чтение.ГруппыФизическихЛиц
	|Документ.ДоверенностьВыданная.Чтение.Организации
	|Документ.ДоверенностьВыданная.Изменение.ГруппыПартнеров
	|Документ.ДоверенностьВыданная.Изменение.ГруппыФизическихЛиц
	|Документ.ДоверенностьВыданная.Изменение.Организации
	|Документ.ДоговорАвторскогоЗаказа.Чтение.ГруппыФизическихЛиц
	|Документ.ДоговорАвторскогоЗаказа.Чтение.Организации
	|Документ.ДоговорАвторскогоЗаказа.Изменение.ГруппыФизическихЛиц
	|Документ.ДоговорАвторскогоЗаказа.Изменение.Организации
	|Документ.ДоговорЗаймаСотруднику.Чтение.ГруппыФизическихЛиц
	|Документ.ДоговорЗаймаСотруднику.Чтение.Организации
	|Документ.ДоговорЗаймаСотруднику.Изменение.ГруппыФизическихЛиц
	|Документ.ДоговорЗаймаСотруднику.Изменение.Организации
	|Документ.ДоговорРаботыУслуги.Чтение.ГруппыФизическихЛиц
	|Документ.ДоговорРаботыУслуги.Чтение.Организации
	|Документ.ДоговорРаботыУслуги.Изменение.ГруппыФизическихЛиц
	|Документ.ДоговорРаботыУслуги.Изменение.Организации
	|Документ.ДокументРасчетовСКонтрагентом.Чтение.Организации
	|Документ.ДоходВНатуральнойФорме.Чтение.ГруппыФизическихЛиц
	|Документ.ДоходВНатуральнойФорме.Чтение.Организации
	|Документ.ДоходВНатуральнойФорме.Изменение.ГруппыФизическихЛиц
	|Документ.ДоходВНатуральнойФорме.Изменение.Организации
	|Документ.ЕдиновременноеПособиеЗаСчетФСС.Чтение.ГруппыФизическихЛиц
	|Документ.ЕдиновременноеПособиеЗаСчетФСС.Чтение.Организации
	|Документ.ЕдиновременноеПособиеЗаСчетФСС.Изменение.ГруппыФизическихЛиц
	|Документ.ЕдиновременноеПособиеЗаСчетФСС.Изменение.Организации
	|Документ.ЗаданиеНаПеревозку.Чтение.Склады
	|Документ.ЗаданиеНаПеревозку.Изменение.Склады
	|Документ.ЗаданиеТорговомуПредставителю.Чтение.ГруппыПартнеров
	|Документ.ЗаданиеТорговомуПредставителю.Чтение.Организации
	|Документ.ЗаданиеТорговомуПредставителю.Чтение.Склады
	|Документ.ЗаданиеТорговомуПредставителю.Изменение.ГруппыПартнеров
	|Документ.ЗаданиеТорговомуПредставителю.Изменение.Организации
	|Документ.ЗаданиеТорговомуПредставителю.Изменение.Склады
	|Документ.ЗаказДавальца.Чтение.ГруппыПартнеров
	|Документ.ЗаказДавальца.Чтение.Организации
	|Документ.ЗаказДавальца.Чтение.Подразделения
	|Документ.ЗаказДавальца.Чтение.Склады
	|Документ.ЗаказДавальца.Изменение.ГруппыПартнеров
	|Документ.ЗаказДавальца.Изменение.Организации
	|Документ.ЗаказДавальца.Изменение.Подразделения
	|Документ.ЗаказДавальца.Изменение.Склады
	|Документ.ЗаказКлиента.Чтение.ВнешниеПользователи
	|Документ.ЗаказКлиента.Чтение.ГруппыПартнеров
	|Документ.ЗаказКлиента.Чтение.Организации
	|Документ.ЗаказКлиента.Чтение.Подразделения
	|Документ.ЗаказКлиента.Чтение.Склады
	|Документ.ЗаказКлиента.Изменение.ВнешниеПользователи
	|Документ.ЗаказКлиента.Изменение.ГруппыПартнеров
	|Документ.ЗаказКлиента.Изменение.Организации
	|Документ.ЗаказКлиента.Изменение.Подразделения
	|Документ.ЗаказКлиента.Изменение.Склады
	|Документ.ЗаказМатериаловВПроизводство.Чтение.Организации
	|Документ.ЗаказМатериаловВПроизводство.Чтение.Подразделения
	|Документ.ЗаказМатериаловВПроизводство.Чтение.Склады
	|Документ.ЗаказМатериаловВПроизводство.Изменение.Организации
	|Документ.ЗаказМатериаловВПроизводство.Изменение.Подразделения
	|Документ.ЗаказМатериаловВПроизводство.Изменение.Склады
	|Документ.ЗаказНаВнутреннееПотребление.Чтение.Организации
	|Документ.ЗаказНаВнутреннееПотребление.Чтение.Подразделения
	|Документ.ЗаказНаВнутреннееПотребление.Чтение.Склады
	|Документ.ЗаказНаВнутреннееПотребление.Изменение.Организации
	|Документ.ЗаказНаВнутреннееПотребление.Изменение.Подразделения
	|Документ.ЗаказНаВнутреннееПотребление.Изменение.Склады
	|Документ.ЗаказНаПеремещение.Чтение.Организации
	|Документ.ЗаказНаПеремещение.Чтение.Склады
	|Документ.ЗаказНаПеремещение.Изменение.Организации
	|Документ.ЗаказНаПеремещение.Изменение.Склады
	|Документ.ЗаказНаСборку.Чтение.Организации
	|Документ.ЗаказНаСборку.Чтение.Склады
	|Документ.ЗаказНаСборку.Изменение.Организации
	|Документ.ЗаказНаСборку.Изменение.Склады
	|Документ.ЗаказПереработчику.Чтение.ГруппыПартнеров
	|Документ.ЗаказПереработчику.Чтение.Организации
	|Документ.ЗаказПереработчику.Чтение.Подразделения
	|Документ.ЗаказПереработчику.Чтение.Склады
	|Документ.ЗаказПереработчику.Изменение.ГруппыПартнеров
	|Документ.ЗаказПереработчику.Изменение.Организации
	|Документ.ЗаказПереработчику.Изменение.Подразделения
	|Документ.ЗаказПереработчику.Изменение.Склады
	|Документ.ЗаказПоставщику.Чтение.ГруппыПартнеров
	|Документ.ЗаказПоставщику.Чтение.Организации
	|Документ.ЗаказПоставщику.Чтение.Подразделения
	|Документ.ЗаказПоставщику.Чтение.Склады
	|Документ.ЗаказПоставщику.Изменение.ГруппыПартнеров
	|Документ.ЗаказПоставщику.Изменение.Организации
	|Документ.ЗаказПоставщику.Изменение.Подразделения
	|Документ.ЗаказПоставщику.Изменение.Склады
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Чтение.ВнешниеПользователи
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Чтение.ГруппыПартнеров
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Чтение.Организации
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Чтение.Склады
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Изменение.ВнешниеПользователи
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Изменение.ГруппыПартнеров
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Изменение.Организации
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Изменение.Склады
	|Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников.Чтение.Организации
	|Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников.Изменение.Организации
	|Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников.Чтение.Организации
	|Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников.Изменение.Организации
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.ГруппыПартнеров
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.Организации
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.Подразделения
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.Пользователи
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.ХозяйственныеОперации
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.ГруппыПартнеров
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.Организации
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.Подразделения
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.Пользователи
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.ХозяйственныеОперации
	|Документ.ЗаявлениеНаПредоставлениеЛьготыПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеНаПредоставлениеЛьготыПоНДФЛ.Чтение.Организации
	|Документ.ЗаявлениеНаПредоставлениеЛьготыПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеНаПредоставлениеЛьготыПоНДФЛ.Изменение.Организации
	|Документ.ЗаявлениеРасчетВФСС.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеРасчетВФСС.Чтение.Организации
	|Документ.ЗаявлениеРасчетВФСС.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеРасчетВФСС.Изменение.Организации
	|Документ.ИзменениеАванса.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеАванса.Чтение.Организации
	|Документ.ИзменениеАванса.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеАванса.Изменение.Организации
	|Документ.ИзменениеАссортимента.Чтение.Объект.Документ.ИзменениеАссортимента
	|Документ.ИзменениеАссортимента.Изменение.Объект.Документ.ИзменениеАссортимента
	|Документ.ИзменениеГрафикаРаботыСписком.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеГрафикаРаботыСписком.Чтение.Организации
	|Документ.ИзменениеГрафикаРаботыСписком.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеГрафикаРаботыСписком.Изменение.Организации
	|Документ.ИзменениеКвалификационногоРазряда.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеКвалификационногоРазряда.Чтение.Организации
	|Документ.ИзменениеКвалификационногоРазряда.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеКвалификационногоРазряда.Изменение.Организации
	|Документ.ИзменениеМестРаботы.Чтение.Организации
	|Документ.ИзменениеМестРаботы.Изменение.Организации
	|Документ.ИзменениеОплатыТруда.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеОплатыТруда.Чтение.Организации
	|Документ.ИзменениеОплатыТруда.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеОплатыТруда.Изменение.Организации
	|Документ.ИзменениеПараметровНМА.Чтение.Организации
	|Документ.ИзменениеПараметровНМА.Изменение.Организации
	|Документ.ИзменениеПараметровНМАМеждународныйУчет.Чтение.Организации
	|Документ.ИзменениеПараметровНМАМеждународныйУчет.Изменение.Организации
	|Документ.ИзменениеПараметровОС.Чтение.Организации
	|Документ.ИзменениеПараметровОС.Изменение.Организации
	|Документ.ИзменениеПараметровОСМеждународныйУчет.Чтение.Организации
	|Документ.ИзменениеПараметровОСМеждународныйУчет.Изменение.Организации
	|Документ.ИзменениеПлановыхНачислений.Чтение.Организации
	|Документ.ИзменениеПлановыхНачислений.Изменение.Организации
	|Документ.ИзменениеСостоянияОС.Чтение.Организации
	|Документ.ИзменениеСостоянияОС.Изменение.Организации
	|Документ.ИзменениеУсловийДоговораЗаймаСотруднику.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеУсловийДоговораЗаймаСотруднику.Чтение.Организации
	|Документ.ИзменениеУсловийДоговораЗаймаСотруднику.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеУсловийДоговораЗаймаСотруднику.Изменение.Организации
	|Документ.ИзменениеУсловийИсполнительногоЛиста.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеУсловийИсполнительногоЛиста.Чтение.Организации
	|Документ.ИзменениеУсловийИсполнительногоЛиста.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеУсловийИсполнительногоЛиста.Изменение.Организации
	|Документ.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком.Чтение.Организации
	|Документ.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком.Изменение.Организации
	|Документ.ИзменениеШтатногоРасписания.Чтение.Организации
	|Документ.ИзменениеШтатногоРасписания.Чтение.ПодразделенияОрганизаций
	|Документ.ИзменениеШтатногоРасписания.Изменение.Организации
	|Документ.ИзменениеШтатногоРасписания.Изменение.ПодразделенияОрганизаций
	|Документ.ИнвентаризационнаяОпись.Чтение.Организации
	|Документ.ИнвентаризационнаяОпись.Чтение.Склады
	|Документ.ИнвентаризационнаяОпись.Изменение.Организации
	|Документ.ИнвентаризационнаяОпись.Изменение.Склады
	|Документ.ИнвентаризацияНаличныхДенежныхСредств.Чтение.Организации
	|Документ.ИнвентаризацияНаличныхДенежныхСредств.Изменение.Организации
	|Документ.ИнвентаризацияНМА.Чтение.Организации
	|Документ.ИнвентаризацияНМА.Изменение.Организации
	|Документ.ИнвентаризацияОС.Чтение.Организации
	|Документ.ИнвентаризацияОС.Изменение.Организации
	|Документ.ИндексацияЗаработка.Чтение.ГруппыФизическихЛиц
	|Документ.ИндексацияЗаработка.Чтение.Организации
	|Документ.ИндексацияЗаработка.Изменение.ГруппыФизическихЛиц
	|Документ.ИндексацияЗаработка.Изменение.Организации
	|Документ.ИндексацияШтатногоРасписания.Чтение.Организации
	|Документ.ИндексацияШтатногоРасписания.Чтение.ПодразделенияОрганизаций
	|Документ.ИндексацияШтатногоРасписания.Изменение.Организации
	|Документ.ИндексацияШтатногоРасписания.Изменение.ПодразделенияОрганизаций
	|Документ.ИндивидуальныйГрафик.Чтение.ГруппыФизическихЛиц
	|Документ.ИндивидуальныйГрафик.Чтение.Организации
	|Документ.ИндивидуальныйГрафик.Изменение.ГруппыФизическихЛиц
	|Документ.ИндивидуальныйГрафик.Изменение.Организации
	|Документ.ИсполнительныйЛист.Чтение.ГруппыФизическихЛиц
	|Документ.ИсполнительныйЛист.Чтение.Организации
	|Документ.ИсполнительныйЛист.Изменение.ГруппыФизическихЛиц
	|Документ.ИсполнительныйЛист.Изменение.Организации
	|Документ.КадровыйПеревод.Чтение.ГруппыФизическихЛиц
	|Документ.КадровыйПеревод.Чтение.Организации
	|Документ.КадровыйПеревод.Изменение.ГруппыФизическихЛиц
	|Документ.КадровыйПеревод.Изменение.Организации
	|Документ.КадровыйПереводСписком.Чтение.ГруппыФизическихЛиц
	|Документ.КадровыйПереводСписком.Чтение.Организации
	|Документ.КадровыйПереводСписком.Изменение.ГруппыФизическихЛиц
	|Документ.КадровыйПереводСписком.Изменение.Организации
	|Документ.КассоваяСмена.Чтение.КассыККМ
	|Документ.КассоваяСмена.Чтение.Организации
	|Документ.КассоваяСмена.Чтение.Склады
	|Документ.КассоваяСмена.Изменение.КассыККМ
	|Документ.КассоваяСмена.Изменение.Организации
	|Документ.КассоваяСмена.Изменение.Склады
	|Документ.Командировка.Чтение.ГруппыФизическихЛиц
	|Документ.Командировка.Чтение.Организации
	|Документ.Командировка.Изменение.ГруппыФизическихЛиц
	|Документ.Командировка.Изменение.Организации
	|Документ.КомандировкиСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.КомандировкиСотрудников.Чтение.Организации
	|Документ.КомандировкиСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.КомандировкиСотрудников.Изменение.Организации
	|Документ.КоммерческоеПредложениеКлиенту.Чтение.ГруппыПартнеров
	|Документ.КоммерческоеПредложениеКлиенту.Чтение.Организации
	|Документ.КоммерческоеПредложениеКлиенту.Изменение.ГруппыПартнеров
	|Документ.КоммерческоеПредложениеКлиенту.Изменение.Организации
	|Документ.КомпенсацияЗаЗадержкуЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.КомпенсацияЗаЗадержкуЗарплаты.Чтение.Организации
	|Документ.КомпенсацияЗаЗадержкуЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.КомпенсацияЗаЗадержкуЗарплаты.Изменение.Организации
	|Документ.КорректировкаНазначенияТоваров.Чтение.Организации
	|Документ.КорректировкаНазначенияТоваров.Изменение.Организации
	|Документ.КорректировкаНалоговогоНазначенияЗапасов.Чтение.Организации
	|Документ.КорректировкаНалоговогоНазначенияЗапасов.Изменение.Организации
	|Документ.КорректировкаНалоговогоНазначенияКапитальныхИнвестиций.Чтение.Организации
	|Документ.КорректировкаНалоговогоНазначенияКапитальныхИнвестиций.Изменение.Организации
	|Документ.КорректировкаНалоговогоНазначенияОС.Чтение.Организации
	|Документ.КорректировкаНалоговогоНазначенияОС.Изменение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Чтение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Чтение.Склады
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Изменение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Изменение.Склады
	|Документ.КорректировкаПоОрдеруНаТовары.Чтение.Склады
	|Документ.КорректировкаПоОрдеруНаТовары.Изменение.Склады
	|Документ.КорректировкаПоступления.Чтение.ГруппыПартнеров
	|Документ.КорректировкаПоступления.Чтение.Организации
	|Документ.КорректировкаПоступления.Чтение.Подразделения
	|Документ.КорректировкаПоступления.Чтение.Склады
	|Документ.КорректировкаПоступления.Изменение.ГруппыПартнеров
	|Документ.КорректировкаПоступления.Изменение.Организации
	|Документ.КорректировкаПоступления.Изменение.Подразделения
	|Документ.КорректировкаПоступления.Изменение.Склады
	|Документ.КорректировкаРеализации.Чтение.ВнешниеПользователи
	|Документ.КорректировкаРеализации.Чтение.ГруппыПартнеров
	|Документ.КорректировкаРеализации.Чтение.Организации
	|Документ.КорректировкаРеализации.Чтение.Подразделения
	|Документ.КорректировкаРеализации.Чтение.Склады
	|Документ.КорректировкаРеализации.Изменение.ГруппыПартнеров
	|Документ.КорректировкаРеализации.Изменение.Организации
	|Документ.КорректировкаРеализации.Изменение.Подразделения
	|Документ.КорректировкаРеализации.Изменение.Склады
	|Документ.ЛимитыРасходаДенежныхСредств.Чтение.Организации
	|Документ.ЛимитыРасходаДенежныхСредств.Чтение.Подразделения
	|Документ.ЛимитыРасходаДенежныхСредств.Изменение.Организации
	|Документ.ЛимитыРасходаДенежныхСредств.Изменение.Подразделения
	|Документ.ЛистКассовойКниги.Чтение.Организации
	|Документ.ЛистКассовойКниги.Изменение.Организации
	|Документ.МатериальнаяПомощь.Чтение.ГруппыФизическихЛиц
	|Документ.МатериальнаяПомощь.Чтение.Организации
	|Документ.МатериальнаяПомощь.Изменение.ГруппыФизическихЛиц
	|Документ.МатериальнаяПомощь.Изменение.Организации
	|Документ.МодернизацияНМА.Чтение.Организации
	|Документ.МодернизацияНМА.Изменение.Организации
	|Документ.МодернизацияОС.Чтение.Организации
	|Документ.МодернизацияОС.Изменение.Организации
	|Документ.НазначениеПлановогоНачисления.Чтение.Организации
	|Документ.НазначениеПлановогоНачисления.Изменение.Организации
	|Документ.НазначениеПодработки.Чтение.ГруппыФизическихЛиц
	|Документ.НазначениеПодработки.Чтение.Организации
	|Документ.НазначениеПодработки.Изменение.ГруппыФизическихЛиц
	|Документ.НазначениеПодработки.Изменение.Организации
	|Документ.НалоговаяНакладная.Чтение.ГруппыПартнеров
	|Документ.НалоговаяНакладная.Чтение.Организации
	|Документ.НалоговаяНакладная.Изменение.Организации
	|Документ.НачальнаяЗадолженностьПоЗарплате.Чтение.ГруппыФизическихЛиц
	|Документ.НачальнаяЗадолженностьПоЗарплате.Чтение.Организации
	|Документ.НачальнаяЗадолженностьПоЗарплате.Изменение.ГруппыФизическихЛиц
	|Документ.НачальнаяЗадолженностьПоЗарплате.Изменение.Организации
	|Документ.НачальнаяШтатнаяРасстановка.Чтение.ГруппыФизическихЛиц
	|Документ.НачальнаяШтатнаяРасстановка.Чтение.Организации
	|Документ.НачальнаяШтатнаяРасстановка.Изменение.ГруппыФизическихЛиц
	|Документ.НачальнаяШтатнаяРасстановка.Изменение.Организации
	|Документ.НачислениеЗаПервуюПоловинуМесяца.Чтение.ГруппыФизическихЛиц
	|Документ.НачислениеЗаПервуюПоловинуМесяца.Чтение.Организации
	|Документ.НачислениеЗаПервуюПоловинуМесяца.Изменение.ГруппыФизическихЛиц
	|Документ.НачислениеЗаПервуюПоловинуМесяца.Изменение.Организации
	|Документ.НачислениеЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.НачислениеЗарплаты.Чтение.Организации
	|Документ.НачислениеЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.НачислениеЗарплаты.Изменение.Организации
	|Документ.НачислениеОценочныхОбязательствПоОтпускам.Чтение.ГруппыФизическихЛиц
	|Документ.НачислениеОценочныхОбязательствПоОтпускам.Чтение.Организации
	|Документ.НачислениеОценочныхОбязательствПоОтпускам.Изменение.ГруппыФизическихЛиц
	|Документ.НачислениеОценочныхОбязательствПоОтпускам.Изменение.Организации
	|Документ.НачисленияКредитовИДепозитов.Чтение.Организации
	|Документ.НачисленияКредитовИДепозитов.Изменение.Организации
	|Документ.ОжидаемоеПоступлениеДенежныхСредств.Чтение.Кассы
	|Документ.ОжидаемоеПоступлениеДенежныхСредств.Чтение.Организации
	|Документ.ОжидаемоеПоступлениеДенежныхСредств.Изменение.Кассы
	|Документ.ОжидаемоеПоступлениеДенежныхСредств.Изменение.Организации
	|Документ.ОперацияБух.Чтение.Организации
	|Документ.ОперацияБух.Изменение.Организации
	|Документ.ОперацияМеждународный.Чтение.Организации
	|Документ.ОперацияМеждународный.Изменение.Организации
	|Документ.ОперацияНалоговогоУчетаПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ОперацияНалоговогоУчетаПоНДФЛ.Чтение.Организации
	|Документ.ОперацияНалоговогоУчетаПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ОперацияНалоговогоУчетаПоНДФЛ.Изменение.Организации
	|Документ.ОперацияПоПлатежнойКарте.Чтение.ГруппыПартнеров
	|Документ.ОперацияПоПлатежнойКарте.Чтение.Организации
	|Документ.ОперацияПоПлатежнойКарте.Чтение.ЭквайринговыеТерминалы
	|Документ.ОперацияПоПлатежнойКарте.Изменение.ГруппыПартнеров
	|Документ.ОперацияПоПлатежнойКарте.Изменение.Организации
	|Документ.ОперацияПоПлатежнойКарте.Изменение.ЭквайринговыеТерминалы
	|Документ.ОперацияУчетаПоСтраховымВзносам.Чтение.ГруппыФизическихЛиц
	|Документ.ОперацияУчетаПоСтраховымВзносам.Чтение.Организации
	|Документ.ОперацияУчетаПоСтраховымВзносам.Изменение.ГруппыФизическихЛиц
	|Документ.ОперацияУчетаПоСтраховымВзносам.Изменение.Организации
	|Документ.ОплатаПоСреднемуЗаработку.Чтение.ГруппыФизическихЛиц
	|Документ.ОплатаПоСреднемуЗаработку.Чтение.Организации
	|Документ.ОплатаПоСреднемуЗаработку.Изменение.ГруппыФизическихЛиц
	|Документ.ОплатаПоСреднемуЗаработку.Изменение.Организации
	|Документ.ОприходованиеИзлишковТоваров.Чтение.Организации
	|Документ.ОприходованиеИзлишковТоваров.Чтение.Подразделения
	|Документ.ОприходованиеИзлишковТоваров.Чтение.Склады
	|Документ.ОприходованиеИзлишковТоваров.Изменение.Организации
	|Документ.ОприходованиеИзлишковТоваров.Изменение.Подразделения
	|Документ.ОприходованиеИзлишковТоваров.Изменение.Склады
	|Документ.ОрдерНаОтражениеИзлишковТоваров.Чтение.Склады
	|Документ.ОрдерНаОтражениеИзлишковТоваров.Изменение.Склады
	|Документ.ОрдерНаОтражениеНедостачТоваров.Чтение.Склады
	|Документ.ОрдерНаОтражениеНедостачТоваров.Изменение.Склады
	|Документ.ОрдерНаОтражениеПорчиТоваров.Чтение.Склады
	|Документ.ОрдерНаОтражениеПорчиТоваров.Изменение.Склады
	|Документ.ОрдерНаПеремещениеТоваров.Чтение.Склады
	|Документ.ОрдерНаПеремещениеТоваров.Изменение.Склады
	|Документ.ОтборРазмещениеТоваров.Чтение.Склады
	|Документ.ОтборРазмещениеТоваров.Изменение.Склады
	|Документ.Отгул.Чтение.ГруппыФизическихЛиц
	|Документ.Отгул.Чтение.Организации
	|Документ.Отгул.Изменение.ГруппыФизическихЛиц
	|Документ.Отгул.Изменение.Организации
	|Документ.ОтменаДоплатыДоСреднегоЗаработка.Чтение.ГруппыФизическихЛиц
	|Документ.ОтменаДоплатыДоСреднегоЗаработка.Чтение.Организации
	|Документ.ОтменаДоплатыДоСреднегоЗаработка.Изменение.ГруппыФизическихЛиц
	|Документ.ОтменаДоплатыДоСреднегоЗаработка.Изменение.Организации
	|Документ.ОтменаСовмещения.Чтение.ГруппыФизическихЛиц
	|Документ.ОтменаСовмещения.Чтение.Организации
	|Документ.ОтменаСовмещения.Изменение.ГруппыФизическихЛиц
	|Документ.ОтменаСовмещения.Изменение.Организации
	|Документ.Отпуск.Чтение.ГруппыФизическихЛиц
	|Документ.Отпуск.Чтение.Организации
	|Документ.Отпуск.Изменение.ГруппыФизическихЛиц
	|Документ.Отпуск.Изменение.Организации
	|Документ.ОтпускаСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.ОтпускаСотрудников.Чтение.Организации
	|Документ.ОтпускаСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.ОтпускаСотрудников.Изменение.Организации
	|Документ.ОтпускБезСохраненияОплаты.Чтение.ГруппыФизическихЛиц
	|Документ.ОтпускБезСохраненияОплаты.Чтение.Организации
	|Документ.ОтпускБезСохраненияОплаты.Изменение.ГруппыФизическихЛиц
	|Документ.ОтпускБезСохраненияОплаты.Изменение.Организации
	|Документ.ОтпускПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|Документ.ОтпускПоУходуЗаРебенком.Чтение.Организации
	|Документ.ОтпускПоУходуЗаРебенком.Изменение.ГруппыФизическихЛиц
	|Документ.ОтпускПоУходуЗаРебенком.Изменение.Организации
	|Документ.ОтражениеЗарплатыВФинансовомУчете.Чтение.ГруппыФизическихЛиц
	|Документ.ОтражениеЗарплатыВФинансовомУчете.Чтение.Организации
	|Документ.ОтражениеЗарплатыВФинансовомУчете.Изменение.ГруппыФизическихЛиц
	|Документ.ОтражениеЗарплатыВФинансовомУчете.Изменение.Организации
	|Документ.ОтражениеРасхожденийПриИнкассацииДенежныхСредств.Чтение.Организации
	|Документ.ОтражениеРасхожденийПриИнкассацииДенежныхСредств.Изменение.Организации
	|Документ.ОтчетБанкаПоОперациямЭквайринга.Чтение.Организации
	|Документ.ОтчетБанкаПоОперациямЭквайринга.Чтение.Подразделения
	|Документ.ОтчетБанкаПоОперациямЭквайринга.Изменение.Организации
	|Документ.ОтчетБанкаПоОперациямЭквайринга.Изменение.Подразделения
	|Документ.ОтчетДавальцу.Чтение.ГруппыПартнеров
	|Документ.ОтчетДавальцу.Чтение.Организации
	|Документ.ОтчетДавальцу.Чтение.Подразделения
	|Документ.ОтчетДавальцу.Изменение.ГруппыПартнеров
	|Документ.ОтчетДавальцу.Изменение.Организации
	|Документ.ОтчетДавальцу.Изменение.Подразделения
	|Документ.ОтчетКомиссионера.Чтение.ВнешниеПользователи
	|Документ.ОтчетКомиссионера.Чтение.ГруппыПартнеров
	|Документ.ОтчетКомиссионера.Чтение.Организации
	|Документ.ОтчетКомиссионера.Чтение.Подразделения
	|Документ.ОтчетКомиссионера.Изменение.ВнешниеПользователи
	|Документ.ОтчетКомиссионера.Изменение.ГруппыПартнеров
	|Документ.ОтчетКомиссионера.Изменение.Организации
	|Документ.ОтчетКомиссионера.Изменение.Подразделения
	|Документ.ОтчетКомиссионераОСписании.Чтение.ГруппыПартнеров
	|Документ.ОтчетКомиссионераОСписании.Чтение.Организации
	|Документ.ОтчетКомиссионераОСписании.Чтение.Подразделения
	|Документ.ОтчетКомиссионераОСписании.Изменение.ГруппыПартнеров
	|Документ.ОтчетКомиссионераОСписании.Изменение.Организации
	|Документ.ОтчетКомиссионераОСписании.Изменение.Подразделения
	|Документ.ОтчетКомитенту.Чтение.ГруппыПартнеров
	|Документ.ОтчетКомитенту.Чтение.Организации
	|Документ.ОтчетКомитенту.Чтение.Подразделения
	|Документ.ОтчетКомитенту.Изменение.ГруппыПартнеров
	|Документ.ОтчетКомитенту.Изменение.Организации
	|Документ.ОтчетКомитенту.Изменение.Подразделения
	|Документ.ОтчетКомитентуОСписании.Чтение.ГруппыПартнеров
	|Документ.ОтчетКомитентуОСписании.Чтение.Организации
	|Документ.ОтчетКомитентуОСписании.Чтение.Подразделения
	|Документ.ОтчетКомитентуОСписании.Изменение.ГруппыПартнеров
	|Документ.ОтчетКомитентуОСписании.Изменение.Организации
	|Документ.ОтчетКомитентуОСписании.Изменение.Подразделения
	|Документ.ОтчетОРозничнойВыручке.Чтение.КассыККМ
	|Документ.ОтчетОРозничнойВыручке.Чтение.Организации
	|Документ.ОтчетОРозничнойВыручке.Чтение.Подразделения
	|Документ.ОтчетОРозничнойВыручке.Чтение.Склады
	|Документ.ОтчетОРозничнойВыручке.Изменение.КассыККМ
	|Документ.ОтчетОРозничнойВыручке.Изменение.Организации
	|Документ.ОтчетОРозничнойВыручке.Изменение.Подразделения
	|Документ.ОтчетОРозничнойВыручке.Изменение.Склады
	|Документ.ОтчетОРозничныхПродажах.Чтение.КассыККМ
	|Документ.ОтчетОРозничныхПродажах.Чтение.Организации
	|Документ.ОтчетОРозничныхПродажах.Чтение.Подразделения
	|Документ.ОтчетОРозничныхПродажах.Чтение.Склады
	|Документ.ОтчетОРозничныхПродажах.Изменение.КассыККМ
	|Документ.ОтчетОРозничныхПродажах.Изменение.Организации
	|Документ.ОтчетОРозничныхПродажах.Изменение.Подразделения
	|Документ.ОтчетОРозничныхПродажах.Изменение.Склады
	|Документ.ОтчетПереработчика.Чтение.ГруппыПартнеров
	|Документ.ОтчетПереработчика.Чтение.Организации
	|Документ.ОтчетПереработчика.Чтение.Подразделения
	|Документ.ОтчетПереработчика.Изменение.ГруппыПартнеров
	|Документ.ОтчетПереработчика.Изменение.Организации
	|Документ.ОтчетПереработчика.Изменение.Подразделения
	|Документ.ОтчетПоКомиссииМеждуОрганизациями.Чтение.Организации
	|Документ.ОтчетПоКомиссииМеждуОрганизациями.Изменение.Организации
	|Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании.Чтение.Организации
	|Документ.ПереводКДругомуРаботодателю.Чтение.ГруппыФизическихЛиц
	|Документ.ПереводКДругомуРаботодателю.Чтение.Организации
	|Документ.ПереводКДругомуРаботодателю.Изменение.ГруппыФизическихЛиц
	|Документ.ПереводКДругомуРаботодателю.Изменение.Организации
	|Документ.ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет.Чтение.Организации
	|Документ.ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет.Изменение.Организации
	|Документ.ПередачаДавальцу.Чтение.ГруппыПартнеров
	|Документ.ПередачаДавальцу.Чтение.Организации
	|Документ.ПередачаДавальцу.Чтение.Подразделения
	|Документ.ПередачаДавальцу.Чтение.Склады
	|Документ.ПередачаДавальцу.Изменение.ГруппыПартнеров
	|Документ.ПередачаДавальцу.Изменение.Организации
	|Документ.ПередачаДавальцу.Изменение.Подразделения
	|Документ.ПередачаДавальцу.Изменение.Склады
	|Документ.ПередачаМатериаловВПроизводство.Чтение.Организации
	|Документ.ПередачаМатериаловВПроизводство.Чтение.Подразделения
	|Документ.ПередачаМатериаловВПроизводство.Чтение.Склады
	|Документ.ПередачаМатериаловВПроизводство.Изменение.Организации
	|Документ.ПередачаМатериаловВПроизводство.Изменение.Подразделения
	|Документ.ПередачаМатериаловВПроизводство.Изменение.Склады
	|Документ.ПередачаОСАрендатору.Чтение.Организации
	|Документ.ПередачаОСАрендатору.Изменение.Организации
	|Документ.ПередачаСырьяПереработчику.Чтение.ГруппыПартнеров
	|Документ.ПередачаСырьяПереработчику.Чтение.Организации
	|Документ.ПередачаСырьяПереработчику.Чтение.Подразделения
	|Документ.ПередачаСырьяПереработчику.Чтение.Склады
	|Документ.ПередачаСырьяПереработчику.Изменение.ГруппыПартнеров
	|Документ.ПередачаСырьяПереработчику.Изменение.Организации
	|Документ.ПередачаСырьяПереработчику.Изменение.Подразделения
	|Документ.ПередачаСырьяПереработчику.Изменение.Склады
	|Документ.ПередачаТоваровМеждуОрганизациями.Чтение.Организации
	|Документ.ПередачаТоваровМеждуОрганизациями.Изменение.Организации
	|Документ.ПеремещениеВДругоеПодразделение.Чтение.ГруппыФизическихЛиц
	|Документ.ПеремещениеВДругоеПодразделение.Чтение.Организации
	|Документ.ПеремещениеВДругоеПодразделение.Изменение.ГруппыФизическихЛиц
	|Документ.ПеремещениеВДругоеПодразделение.Изменение.Организации
	|Документ.ПеремещениеВЭксплуатации.Чтение.Организации
	|Документ.ПеремещениеВЭксплуатации.Чтение.Подразделения
	|Документ.ПеремещениеВЭксплуатации.Изменение.Организации
	|Документ.ПеремещениеВЭксплуатации.Изменение.Подразделения
	|Документ.ПеремещениеМеждуТерриториями.Чтение.ГруппыФизическихЛиц
	|Документ.ПеремещениеМеждуТерриториями.Чтение.Организации
	|Документ.ПеремещениеМеждуТерриториями.Изменение.ГруппыФизическихЛиц
	|Документ.ПеремещениеМеждуТерриториями.Изменение.Организации
	|Документ.ПеремещениеНМА.Чтение.Организации
	|Документ.ПеремещениеНМА.Изменение.Организации
	|Документ.ПеремещениеНМАМеждународныйУчет.Чтение.Организации
	|Документ.ПеремещениеНМАМеждународныйУчет.Изменение.Организации
	|Документ.ПеремещениеОС.Чтение.Организации
	|Документ.ПеремещениеОС.Изменение.Организации
	|Документ.ПеремещениеОСМеждународныйУчет.Чтение.Организации
	|Документ.ПеремещениеОСМеждународныйУчет.Изменение.Организации
	|Документ.ПеремещениеТоваров.Чтение.Организации
	|Документ.ПеремещениеТоваров.Чтение.Склады
	|Документ.ПеремещениеТоваров.Изменение.Организации
	|Документ.ПеремещениеТоваров.Изменение.Склады
	|Документ.ПереносДанных.Чтение.Организации
	|Документ.ПереносОтпуска.Чтение.ГруппыФизическихЛиц
	|Документ.ПереносОтпуска.Чтение.Организации
	|Документ.ПереносОтпуска.Изменение.ГруппыФизическихЛиц
	|Документ.ПереносОтпуска.Изменение.Организации
	|Документ.ПереоценкаВалютныхСредств.Чтение.Организации
	|Документ.ПереоценкаВалютныхСредств.Изменение.Организации
	|Документ.ПереоценкаНМА.Чтение.Организации
	|Документ.ПереоценкаНМА.Изменение.Организации
	|Документ.ПереоценкаОС.Чтение.Организации
	|Документ.ПереоценкаОС.Изменение.Организации
	|Документ.ПерерасчетНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ПерерасчетНДФЛ.Чтение.Организации
	|Документ.ПерерасчетНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ПерерасчетНДФЛ.Изменение.Организации
	|Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.Чтение.Организации
	|Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС.Изменение.Организации
	|Документ.ПересортицаТоваров.Чтение.Организации
	|Документ.ПересортицаТоваров.Чтение.Подразделения
	|Документ.ПересортицаТоваров.Чтение.Склады
	|Документ.ПересортицаТоваров.Изменение.Организации
	|Документ.ПересортицаТоваров.Изменение.Подразделения
	|Документ.ПересортицаТоваров.Изменение.Склады
	|Документ.ПересчетТоваров.Чтение.Склады
	|Документ.ПересчетТоваров.Изменение.Склады
	|Документ.ПериодыОплаченныеДоНачалаЭксплуатации.Чтение.ГруппыФизическихЛиц
	|Документ.ПериодыОплаченныеДоНачалаЭксплуатации.Чтение.Организации
	|Документ.ПериодыОплаченныеДоНачалаЭксплуатации.Изменение.ГруппыФизическихЛиц
	|Документ.ПериодыОплаченныеДоНачалаЭксплуатации.Изменение.Организации
	|Документ.ПланЗакупок.Чтение.ГруппыПартнеров
	|Документ.ПланЗакупок.Чтение.Подразделения
	|Документ.ПланЗакупок.Чтение.Склады
	|Документ.ПланЗакупок.Изменение.ГруппыПартнеров
	|Документ.ПланЗакупок.Изменение.Подразделения
	|Документ.ПланЗакупок.Изменение.Склады
	|Документ.ПланПродаж.Чтение.ВнешниеПользователи
	|Документ.ПланПродаж.Чтение.ГруппыПартнеров
	|Документ.ПланПродаж.Чтение.Подразделения
	|Документ.ПланПродаж.Чтение.Склады
	|Документ.ПланПродаж.Изменение.ВнешниеПользователи
	|Документ.ПланПродаж.Изменение.ГруппыПартнеров
	|Документ.ПланПродаж.Изменение.Подразделения
	|Документ.ПланПродаж.Изменение.Склады
	|Документ.ПланПродажПоКатегориям.Чтение.Подразделения
	|Документ.ПланПродажПоКатегориям.Чтение.Склады
	|Документ.ПланПродажПоКатегориям.Изменение.Подразделения
	|Документ.ПланПродажПоКатегориям.Изменение.Склады
	|Документ.ПланПроизводства.Чтение.Подразделения
	|Документ.ПланПроизводства.Изменение.Подразделения
	|Документ.ПодготовкаКПередачеНМА.Чтение.Организации
	|Документ.ПодготовкаКПередачеНМА.Изменение.Организации
	|Документ.ПодготовкаКПередачеОС.Чтение.Организации
	|Документ.ПодготовкаКПередачеОС.Изменение.Организации
	|Документ.ПодтверждениеЗачисленияЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.ПодтверждениеЗачисленияЗарплаты.Чтение.Организации
	|Документ.ПодтверждениеЗачисленияЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.ПодтверждениеЗачисленияЗарплаты.Изменение.Организации
	|Документ.ПодтверждениеОплатыЗаявленияРасчетаВФСС.Чтение.ГруппыФизическихЛиц
	|Документ.ПодтверждениеОплатыЗаявленияРасчетаВФСС.Чтение.Организации
	|Документ.ПодтверждениеОплатыЗаявленияРасчетаВФСС.Изменение.ГруппыФизическихЛиц
	|Документ.ПодтверждениеОплатыЗаявленияРасчетаВФСС.Изменение.Организации
	|Документ.ПодтверждениеВыплатЗаСчетФСС.Чтение.ГруппыФизическихЛиц
	|Документ.ПодтверждениеВыплатЗаСчетФСС.Чтение.Организации
	|Документ.ПодтверждениеВыплатЗаСчетФСС.Изменение.ГруппыФизическихЛиц
	|Документ.ПодтверждениеВыплатЗаСчетФСС.Изменение.Организации
	|Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников.Чтение.Организации
	|Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников.Изменение.Организации
	|Документ.ПоручениеЭкспедитору.Чтение.ГруппыПартнеров
	|Документ.ПоручениеЭкспедитору.Чтение.Подразделения
	|Документ.ПоручениеЭкспедитору.Чтение.Склады
	|Документ.ПоручениеЭкспедитору.Изменение.ГруппыПартнеров
	|Документ.ПоручениеЭкспедитору.Изменение.Подразделения
	|Документ.ПоручениеЭкспедитору.Изменение.Склады
	|Документ.ПорчаТоваров.Чтение.Организации
	|Документ.ПорчаТоваров.Чтение.Подразделения
	|Документ.ПорчаТоваров.Чтение.Склады
	|Документ.ПорчаТоваров.Изменение.Организации
	|Документ.ПорчаТоваров.Изменение.Подразделения
	|Документ.ПорчаТоваров.Изменение.Склады
	|Документ.ПостоянноеУдержаниеВПользуТретьихЛиц.Чтение.ГруппыФизическихЛиц
	|Документ.ПостоянноеУдержаниеВПользуТретьихЛиц.Чтение.Организации
	|Документ.ПостоянноеУдержаниеВПользуТретьихЛиц.Изменение.ГруппыФизическихЛиц
	|Документ.ПостоянноеУдержаниеВПользуТретьихЛиц.Изменение.Организации
	|Документ.ПоступлениеАрендованныхОС.Чтение.Организации
	|Документ.ПоступлениеАрендованныхОС.Изменение.Организации
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Чтение.Организации
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Чтение.ХозяйственныеОперации
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Изменение.Организации
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Изменение.ХозяйственныеОперации
	|Документ.ПоступлениеДенежныхДокументов.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеДенежныхДокументов.Чтение.Организации
	|Документ.ПоступлениеДенежныхДокументов.Чтение.Подразделения
	|Документ.ПоступлениеДенежныхДокументов.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеДенежныхДокументов.Изменение.Организации
	|Документ.ПоступлениеДенежныхДокументов.Изменение.Подразделения
	|Документ.ПоступлениеОтПереработчика.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеОтПереработчика.Чтение.Организации
	|Документ.ПоступлениеОтПереработчика.Чтение.Подразделения
	|Документ.ПоступлениеОтПереработчика.Чтение.Склады
	|Документ.ПоступлениеОтПереработчика.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеОтПереработчика.Изменение.Организации
	|Документ.ПоступлениеОтПереработчика.Изменение.Подразделения
	|Документ.ПоступлениеОтПереработчика.Изменение.Склады
	|Документ.ПоступлениеПредметовЛизинга.Чтение.Организации
	|Документ.ПоступлениеПредметовЛизинга.Изменение.Организации
	|Документ.ПоступлениеСырьяОтДавальца.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеСырьяОтДавальца.Чтение.Организации
	|Документ.ПоступлениеСырьяОтДавальца.Чтение.Подразделения
	|Документ.ПоступлениеСырьяОтДавальца.Чтение.Склады
	|Документ.ПоступлениеСырьяОтДавальца.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеСырьяОтДавальца.Изменение.Организации
	|Документ.ПоступлениеСырьяОтДавальца.Изменение.Подразделения
	|Документ.ПоступлениеСырьяОтДавальца.Изменение.Склады
	|Документ.ПоступлениеТоваровУслуг.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеТоваровУслуг.Чтение.Организации
	|Документ.ПоступлениеТоваровУслуг.Чтение.Подразделения
	|Документ.ПоступлениеТоваровУслуг.Чтение.Склады
	|Документ.ПоступлениеТоваровУслуг.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеТоваровУслуг.Изменение.Организации
	|Документ.ПоступлениеТоваровУслуг.Изменение.Подразделения
	|Документ.ПоступлениеТоваровУслуг.Изменение.Склады
	|Документ.ПоступлениеУслугПоЛизингу.Чтение.Организации
	|Документ.ПоступлениеУслугПоЛизингу.Изменение.Организации
	|Документ.ПоступлениеУслугПрочихАктивов.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеУслугПрочихАктивов.Чтение.Организации
	|Документ.ПоступлениеУслугПрочихАктивов.Чтение.Подразделения
	|Документ.ПоступлениеУслугПрочихАктивов.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеУслугПрочихАктивов.Изменение.Организации
	|Документ.ПоступлениеУслугПрочихАктивов.Изменение.Подразделения
	|Документ.ПрекращениеЛьготПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ПрекращениеЛьготПоНДФЛ.Чтение.Организации
	|Документ.ПрекращениеЛьготПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ПрекращениеЛьготПоНДФЛ.Изменение.Организации
	|Документ.ПрекращениеПлановогоНачисления.Чтение.ГруппыФизическихЛиц
	|Документ.ПрекращениеПлановогоНачисления.Чтение.Организации
	|Документ.ПрекращениеПлановогоНачисления.Изменение.ГруппыФизическихЛиц
	|Документ.ПрекращениеПлановогоНачисления.Изменение.Организации
	|Документ.ПрекращениеПодработки.Чтение.ГруппыФизическихЛиц
	|Документ.ПрекращениеПодработки.Чтение.Организации
	|Документ.ПрекращениеПодработки.Изменение.ГруппыФизическихЛиц
	|Документ.ПрекращениеПодработки.Изменение.Организации
	|Документ.Премия.Чтение.ГруппыФизическихЛиц
	|Документ.Премия.Чтение.Организации
	|Документ.Премия.Изменение.ГруппыФизическихЛиц
	|Документ.Премия.Изменение.Организации
	|Документ.ПриемНаРаботу.Чтение.ГруппыФизическихЛиц
	|Документ.ПриемНаРаботу.Чтение.Организации
	|Документ.ПриемНаРаботу.Изменение.ГруппыФизическихЛиц
	|Документ.ПриемНаРаботу.Изменение.Организации
	|Документ.ПриемНаРаботуСписком.Чтение.ГруппыФизическихЛиц
	|Документ.ПриемНаРаботуСписком.Чтение.Организации
	|Документ.ПриемНаРаботуСписком.Изменение.ГруппыФизическихЛиц
	|Документ.ПриемНаРаботуСписком.Изменение.Организации
	|Документ.ПризПодарок.Чтение.ГруппыФизическихЛиц
	|Документ.ПризПодарок.Чтение.Организации
	|Документ.ПризПодарок.Изменение.ГруппыФизическихЛиц
	|Документ.ПризПодарок.Изменение.Организации
	|Документ.ПриказНаДоплатуДоСреднегоЗаработка.Чтение.ГруппыФизическихЛиц
	|Документ.ПриказНаДоплатуДоСреднегоЗаработка.Чтение.Организации
	|Документ.ПриказНаДоплатуДоСреднегоЗаработка.Изменение.ГруппыФизическихЛиц
	|Документ.ПриказНаДоплатуДоСреднегоЗаработка.Изменение.Организации
	|Документ.Приложение2КНалоговойНакладной.Чтение.ГруппыПартнеров
	|Документ.Приложение2КНалоговойНакладной.Чтение.Организации
	|Документ.Приложение2КНалоговойНакладной.Изменение.Организации	
	|Документ.ПринятиеКУчетуНМА.Чтение.Организации
	|Документ.ПринятиеКУчетуНМА.Изменение.Организации
	|Документ.ПринятиеКУчетуНМАМеждународныйУчет.Чтение.Организации
	|Документ.ПринятиеКУчетуНМАМеждународныйУчет.Изменение.Организации
	|Документ.ПринятиеКУчетуОС.Чтение.Организации
	|Документ.ПринятиеКУчетуОС.Изменение.Организации
	|Документ.ПринятиеКУчетуОСМеждународныйУчет.Чтение.Организации
	|Документ.ПринятиеКУчетуОСМеждународныйУчет.Изменение.Организации
	|Документ.ПриходныйКассовыйОрдер.Чтение.ГруппыПартнеров
	|Документ.ПриходныйКассовыйОрдер.Чтение.ГруппыФизическихЛиц
	|Документ.ПриходныйКассовыйОрдер.Чтение.Кассы
	|Документ.ПриходныйКассовыйОрдер.Чтение.КассыККМ
	|Документ.ПриходныйКассовыйОрдер.Чтение.Организации
	|Документ.ПриходныйКассовыйОрдер.Чтение.ХозяйственныеОперации
	|Документ.ПриходныйКассовыйОрдер.Изменение.ГруппыПартнеров
	|Документ.ПриходныйКассовыйОрдер.Изменение.ГруппыФизическихЛиц
	|Документ.ПриходныйКассовыйОрдер.Изменение.Кассы
	|Документ.ПриходныйКассовыйОрдер.Изменение.КассыККМ
	|Документ.ПриходныйКассовыйОрдер.Изменение.Организации
	|Документ.ПриходныйКассовыйОрдер.Изменение.ХозяйственныеОперации
	|Документ.ПриходныйОрдерНаТовары.Чтение.Склады
	|Документ.ПриходныйОрдерНаТовары.Изменение.Склады
	|Документ.ПрогулНеявка.Чтение.ГруппыФизическихЛиц
	|Документ.ПрогулНеявка.Чтение.Организации
	|Документ.ПрогулНеявка.Изменение.ГруппыФизическихЛиц
	|Документ.ПрогулНеявка.Изменение.Организации
	|Документ.ПродлениеКонтрактаДоговора.Чтение.ГруппыФизическихЛиц
	|Документ.ПродлениеКонтрактаДоговора.Чтение.Организации
	|Документ.ПродлениеКонтрактаДоговора.Изменение.ГруппыФизическихЛиц
	|Документ.ПродлениеКонтрактаДоговора.Изменение.Организации
	|Документ.ПростойСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.ПростойСотрудников.Чтение.Организации
	|Документ.ПростойСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.ПростойСотрудников.Изменение.Организации
	|Документ.ПрочееОприходованиеТоваров.Чтение.Организации
	|Документ.ПрочееОприходованиеТоваров.Чтение.Подразделения
	|Документ.ПрочееОприходованиеТоваров.Чтение.Склады
	|Документ.ПрочееОприходованиеТоваров.Изменение.Организации
	|Документ.ПрочееОприходованиеТоваров.Изменение.Подразделения
	|Документ.ПрочееОприходованиеТоваров.Изменение.Склады
	|Документ.ПрочиеДоходыРасходы.Чтение.Организации
	|Документ.ПрочиеДоходыРасходы.Изменение.Организации
	|Документ.РаботаВВыходныеИПраздничныеДни.Чтение.ГруппыФизическихЛиц
	|Документ.РаботаВВыходныеИПраздничныеДни.Чтение.Организации
	|Документ.РаботаВВыходныеИПраздничныеДни.Изменение.ГруппыФизическихЛиц
	|Документ.РаботаВВыходныеИПраздничныеДни.Изменение.Организации
	|Документ.РаботаСверхурочно.Чтение.ГруппыФизическихЛиц
	|Документ.РаботаСверхурочно.Чтение.Организации
	|Документ.РаботаСверхурочно.Изменение.ГруппыФизическихЛиц
	|Документ.РаботаСверхурочно.Изменение.Организации
	|Документ.РазовоеНачисление.Чтение.ГруппыФизическихЛиц
	|Документ.РазовоеНачисление.Чтение.Организации
	|Документ.РазовоеНачисление.Изменение.ГруппыФизическихЛиц
	|Документ.РазовоеНачисление.Изменение.Организации
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Чтение.Кассы
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Чтение.Организации
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Чтение.ХозяйственныеОперации
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Изменение.Кассы
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Изменение.Организации
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Изменение.ХозяйственныеОперации
	|Документ.РаспределениеДоходовИРасходовПоНаправлениямДеятельности.Чтение.Организации
	|Документ.РаспределениеДоходовИРасходовПоНаправлениямДеятельности.Изменение.Организации
	|Документ.РаспределениеОсновногоЗаработка.Чтение.ГруппыФизическихЛиц
	|Документ.РаспределениеОсновногоЗаработка.Чтение.Организации
	|Документ.РаспределениеОсновногоЗаработка.Изменение.ГруппыФизическихЛиц
	|Документ.РаспределениеОсновногоЗаработка.Изменение.Организации
	|Документ.РаспределениеРасходовБудущихПериодов.Чтение.Организации
	|Документ.РаспределениеРасходовБудущихПериодов.Изменение.Организации
	|Документ.РасходныйКассовыйОрдер.Чтение.ГруппыПартнеров
	|Документ.РасходныйКассовыйОрдер.Чтение.ГруппыФизическихЛиц
	|Документ.РасходныйКассовыйОрдер.Чтение.Кассы
	|Документ.РасходныйКассовыйОрдер.Чтение.КассыККМ
	|Документ.РасходныйКассовыйОрдер.Чтение.Организации
	|Документ.РасходныйКассовыйОрдер.Чтение.ХозяйственныеОперации
	|Документ.РасходныйКассовыйОрдер.Изменение.ГруппыПартнеров
	|Документ.РасходныйКассовыйОрдер.Изменение.ГруппыФизическихЛиц
	|Документ.РасходныйКассовыйОрдер.Изменение.Кассы
	|Документ.РасходныйКассовыйОрдер.Изменение.КассыККМ
	|Документ.РасходныйКассовыйОрдер.Изменение.Организации
	|Документ.РасходныйКассовыйОрдер.Изменение.ХозяйственныеОперации
	|Документ.РасходныйОрдерНаТовары.Чтение.Склады
	|Документ.РасходныйОрдерНаТовары.Изменение.Склады
	|Документ.РасчетСебестоимостиТоваров.Чтение.Организации
	|Документ.РасчетСебестоимостиТоваров.Изменение.Организации
	|Документ.РасчетСпецстажаСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.РасчетСпецстажаСотрудников.Чтение.Организации
	|Документ.РасчетСпецстажаСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.РасчетСпецстажаСотрудников.Изменение.Организации
	|Документ.РеализацияТоваровУслуг.Чтение.ВнешниеПользователи
	|Документ.РеализацияТоваровУслуг.Чтение.ГруппыПартнеров
	|Документ.РеализацияТоваровУслуг.Чтение.Организации
	|Документ.РеализацияТоваровУслуг.Чтение.Подразделения
	|Документ.РеализацияТоваровУслуг.Чтение.Склады
	|Документ.РеализацияТоваровУслуг.Изменение.ГруппыПартнеров
	|Документ.РеализацияТоваровУслуг.Изменение.Организации
	|Документ.РеализацияТоваровУслуг.Изменение.Подразделения
	|Документ.РеализацияТоваровУслуг.Изменение.Склады
	|Документ.РеализацияУслугПрочихАктивов.Чтение.ГруппыПартнеров
	|Документ.РеализацияУслугПрочихАктивов.Чтение.Организации
	|Документ.РеализацияУслугПрочихАктивов.Чтение.Подразделения
	|Документ.РеализацияУслугПрочихАктивов.Изменение.ГруппыПартнеров
	|Документ.РеализацияУслугПрочихАктивов.Изменение.Организации
	|Документ.РеализацияУслугПрочихАктивов.Изменение.Подразделения
	|Документ.РегистрацияВходящегоНалоговогоДокумента.Чтение.ГруппыПартнеров
	|Документ.РегистрацияВходящегоНалоговогоДокумента.Чтение.Организации
	|Документ.РегистрацияВходящегоНалоговогоДокумента.Изменение.ГруппыПартнеров
	|Документ.РегистрацияВходящегоНалоговогоДокумента.Изменение.Организации
	|Документ.РегистрацияПереработок.Чтение.ГруппыФизическихЛиц
	|Документ.РегистрацияПереработок.Чтение.Организации
	|Документ.РегистрацияПереработок.Изменение.ГруппыФизическихЛиц
	|Документ.РегистрацияПереработок.Изменение.Организации
	|Документ.РегистрацияПрочихДоходов.Чтение.ГруппыФизическихЛиц
	|Документ.РегистрацияПрочихДоходов.Чтение.Организации
	|Документ.РегистрацияПрочихДоходов.Изменение.ГруппыФизическихЛиц
	|Документ.РегистрацияПрочихДоходов.Изменение.Организации
	|Документ.РегистрацияСтоимостиПриобретенияОСПропорциональноОблагаемыхНДС.Чтение.Организации
	|Документ.РегистрацияСтоимостиПриобретенияОСПропорциональноОблагаемыхНДС.Изменение.Организации
	|Документ.РегистрацияЦенНоменклатурыПоставщика.Чтение.ГруппыПартнеров
	|Документ.РегистрацияЦенНоменклатурыПоставщика.Изменение.ГруппыПартнеров
	|Документ.РегламентированныйОтчет.Чтение.Организации
	|Документ.РегламентированныйОтчет.Изменение.Организации
	|Документ.РегламентнаяОперация.Чтение.Организации
	|Документ.РегламентнаяОперация.Изменение.Организации
	|Документ.РегламентнаяОперацияМеждународныйУчет.Чтение.Организации
	|Документ.РегламентнаяОперацияМеждународныйУчет.Изменение.Организации
	|Документ.РемонтОС.Чтение.Организации
	|Документ.РемонтОС.Изменение.Организации
	|Документ.СборкаТоваров.Чтение.Организации
	|Документ.СборкаТоваров.Чтение.Склады
	|Документ.СборкаТоваров.Изменение.Организации
	|Документ.СборкаТоваров.Изменение.Склады
	|Документ.СверкаВзаиморасчетов.Чтение.ГруппыПартнеров
	|Документ.СверкаВзаиморасчетов.Чтение.Организации
	|Документ.СверкаВзаиморасчетов.Изменение.ГруппыПартнеров
	|Документ.СверкаВзаиморасчетов.Изменение.Организации
	|Документ.Совмещение.Чтение.ГруппыФизическихЛиц
	|Документ.Совмещение.Чтение.Организации
	|Документ.Совмещение.Изменение.ГруппыФизическихЛиц
	|Документ.Совмещение.Изменение.Организации
	|Документ.СоглашениеСПоставщиком.Чтение.ГруппыПартнеров
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.ГруппыПартнеров
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.ГруппыФизическихЛиц
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.Организации
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.ХозяйственныеОперации
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.ГруппыПартнеров
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.ГруппыФизическихЛиц
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.Организации
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.ХозяйственныеОперации
	|Документ.СписаниеЗадолженности.Чтение.ГруппыПартнеров
	|Документ.СписаниеЗадолженности.Чтение.Организации
	|Документ.СписаниеЗадолженности.Изменение.ГруппыПартнеров
	|Документ.СписаниеЗадолженности.Изменение.Организации
	|Документ.СписаниеИзЭксплуатации.Чтение.Организации
	|Документ.СписаниеИзЭксплуатации.Чтение.Подразделения
	|Документ.СписаниеИзЭксплуатации.Изменение.Организации
	|Документ.СписаниеИзЭксплуатации.Изменение.Подразделения
	|Документ.СписаниеНедостачТоваров.Чтение.Организации
	|Документ.СписаниеНедостачТоваров.Чтение.Подразделения
	|Документ.СписаниеНедостачТоваров.Чтение.Склады
	|Документ.СписаниеНедостачТоваров.Изменение.Организации
	|Документ.СписаниеНедостачТоваров.Изменение.Подразделения
	|Документ.СписаниеНедостачТоваров.Изменение.Склады
	|Документ.СписаниеНМА.Чтение.Организации
	|Документ.СписаниеНМА.Изменение.Организации
	|Документ.СписаниеНМАМеждународныйУчет.Чтение.Организации
	|Документ.СписаниеНМАМеждународныйУчет.Изменение.Организации
	|Документ.СписаниеОС.Чтение.Организации
	|Документ.СписаниеОС.Изменение.Организации
	|Документ.СписаниеОСМеждународныйУчет.Чтение.Организации
	|Документ.СписаниеОСМеждународныйУчет.Изменение.Организации
	|Документ.СчетНаОплатуКлиенту.Чтение.ВнешниеПользователи
	|Документ.СчетНаОплатуКлиенту.Чтение.ГруппыПартнеров
	|Документ.СчетНаОплатуКлиенту.Чтение.Организации
	|Документ.СчетНаОплатуКлиенту.Изменение.ГруппыПартнеров
	|Документ.СчетНаОплатуКлиенту.Изменение.Организации
	|Документ.ТабельУчетаРабочегоВремени.Чтение.ГруппыФизическихЛиц
	|Документ.ТабельУчетаРабочегоВремени.Чтение.Организации
	|Документ.ТабельУчетаРабочегоВремени.Изменение.ГруппыФизическихЛиц
	|Документ.ТабельУчетаРабочегоВремени.Изменение.Организации
	|Документ.ТаможеннаяДекларацияИмпорт.Чтение.ГруппыПартнеров
	|Документ.ТаможеннаяДекларацияИмпорт.Чтение.Организации
	|Документ.ТаможеннаяДекларацияИмпорт.Чтение.Подразделения
	|Документ.ТаможеннаяДекларацияИмпорт.Изменение.ГруппыПартнеров
	|Документ.ТаможеннаяДекларацияИмпорт.Изменение.Организации
	|Документ.ТаможеннаяДекларацияИмпорт.Изменение.Подразделения
	|Документ.ТранспортнаяНакладная.Чтение.Организации
	|Документ.ТранспортнаяНакладная.Изменение.Организации
	|Документ.Увольнение.Чтение.ГруппыФизическихЛиц
	|Документ.Увольнение.Чтение.Организации
	|Документ.Увольнение.Изменение.ГруппыФизическихЛиц
	|Документ.Увольнение.Изменение.Организации
	|Документ.УвольнениеСписком.Чтение.ГруппыФизическихЛиц
	|Документ.УвольнениеСписком.Чтение.Организации
	|Документ.УвольнениеСписком.Изменение.ГруппыФизическихЛиц
	|Документ.УвольнениеСписком.Изменение.Организации
	|Документ.УдалитьАктОРасхожденияхПриПоступленииТоваров.Чтение.ГруппыПартнеров
	|Документ.УдалитьАктОРасхожденияхПриПоступленииТоваров.Чтение.Организации
	|Документ.УдалитьАктОРасхожденияхПриПоступленииТоваров.Изменение.ГруппыПартнеров
	|Документ.УдалитьАктОРасхожденияхПриПоступленииТоваров.Изменение.Организации
	|Документ.УдалитьАктПриемкиТоваров.Чтение.ГруппыПартнеров
	|Документ.УдалитьАктПриемкиТоваров.Чтение.Организации
	|Документ.УдалитьАктПриемкиТоваров.Изменение.ГруппыПартнеров
	|Документ.УдалитьАктПриемкиТоваров.Изменение.Организации
	|Документ.УДАЛИТЬВыпискаПоРасчетномуСчету.Чтение.Организации
	|Документ.УдержаниеВСчетРасчетовПоПрочимОперациям.Чтение.ГруппыФизическихЛиц
	|Документ.УдержаниеВСчетРасчетовПоПрочимОперациям.Чтение.Организации
	|Документ.УдержаниеВСчетРасчетовПоПрочимОперациям.Изменение.ГруппыФизическихЛиц
	|Документ.УдержаниеВСчетРасчетовПоПрочимОперациям.Изменение.Организации
	|Документ.УдержаниеПрофсоюзныхВзносов.Чтение.ГруппыФизическихЛиц
	|Документ.УдержаниеПрофсоюзныхВзносов.Чтение.Организации
	|Документ.УдержаниеПрофсоюзныхВзносов.Изменение.ГруппыФизическихЛиц
	|Документ.УдержаниеПрофсоюзныхВзносов.Изменение.Организации
	|Документ.УстановкаБлокировокЯчеек.Чтение.Склады
	|Документ.УстановкаБлокировокЯчеек.Изменение.Склады
	|Документ.УстановкаЦенНоменклатуры.Чтение.Объект.Документ.УстановкаЦенНоменклатуры
	|Документ.УстановкаЦенНоменклатуры.Изменение.Объект.Документ.УстановкаЦенНоменклатуры
	|Документ.УтверждениеШтатногоРасписания.Чтение.Организации
	|Документ.УтверждениеШтатногоРасписания.Чтение.ПодразделенияОрганизаций
	|Документ.УтверждениеШтатногоРасписания.Изменение.Организации
	|Документ.УтверждениеШтатногоРасписания.Изменение.ПодразделенияОрганизаций
	|Документ.ЧекККМ.Чтение.КассыККМ
	|Документ.ЧекККМ.Чтение.Организации
	|Документ.ЧекККМ.Чтение.Склады
	|Документ.ЧекККМ.Изменение.КассыККМ
	|Документ.ЧекККМ.Изменение.Организации
	|Документ.ЧекККМ.Изменение.Склады
	|Документ.ЧекККМВозврат.Чтение.КассыККМ
	|Документ.ЧекККМВозврат.Чтение.Организации
	|Документ.ЧекККМВозврат.Чтение.Склады
	|Документ.ЧекККМВозврат.Изменение.КассыККМ
	|Документ.ЧекККМВозврат.Изменение.Организации
	|Документ.ЧекККМВозврат.Изменение.Склады
	|Документ.ЭкземплярБюджета.Чтение.Организации
	|Документ.ЭкземплярБюджета.Чтение.Подразделения
	|Документ.ЭкземплярБюджета.Изменение.Организации
	|Документ.ЭкземплярБюджета.Изменение.Подразделения
	|Документ.ЭкземплярФинансовогоОтчета.Чтение.Организации
	|Документ.ЭкземплярФинансовогоОтчета.Изменение.Организации
	|ЖурналДокументов.АвансовыеОтчеты.Чтение.Организации
	|ЖурналДокументов.АлиментыИДругиеПостоянныеУдержания.Чтение.Объект.Документ.ИзменениеУсловийИсполнительногоЛиста
	|ЖурналДокументов.АлиментыИДругиеПостоянныеУдержания.Чтение.Объект.Документ.ИсполнительныйЛист
	|ЖурналДокументов.АлиментыИДругиеПостоянныеУдержания.Чтение.Объект.Документ.ПостоянноеУдержаниеВПользуТретьихЛиц
	|ЖурналДокументов.АлиментыИДругиеПостоянныеУдержания.Чтение.Объект.Документ.УдержаниеВСчетРасчетовПоПрочимОперациям
	|ЖурналДокументов.АлиментыИДругиеПостоянныеУдержания.Чтение.Объект.Документ.УдержаниеПрофсоюзныхВзносов
	|ЖурналДокументов.БезналичныеПлатежи.Чтение.Организации
	|ЖурналДокументов.ВедомостиНаВыплатуЗарплаты.Чтение.Объект.Документ.ВедомостьНаВыплатуЗарплатыВБанк
	|ЖурналДокументов.ВедомостиНаВыплатуЗарплаты.Чтение.Объект.Документ.ВедомостьНаВыплатуЗарплатыВКассу
	|ЖурналДокументов.ВедомостиНаВыплатуЗарплаты.Чтение.Объект.Документ.ВедомостьНаВыплатуЗарплатыПеречислением
	|ЖурналДокументов.ВедомостиНаВыплатуЗарплаты.Чтение.Объект.Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком
	|ЖурналДокументов.ГрафикиПереносыОтпусков.Чтение.Объект.Документ.ГрафикОтпусков
	|ЖурналДокументов.ГрафикиПереносыОтпусков.Чтение.Объект.Документ.ПереносОтпуска
	|ЖурналДокументов.ДанныеНаНачалоЭксплуатации.Чтение.Объект.Документ.НачальнаяЗадолженностьПоЗарплате
	|ЖурналДокументов.ДанныеНаНачалоЭксплуатации.Чтение.Объект.Документ.НачальнаяШтатнаяРасстановка
	|ЖурналДокументов.ДанныеНаНачалоЭксплуатации.Чтение.Объект.Документ.ПериодыОплаченныеДоНачалаЭксплуатации
	|ЖурналДокументов.ДоговорыГражданскоПравовогоХарактера.Чтение.Объект.Документ.АктПриемкиВыполненныхРаботОказанныхУслуг
	|ЖурналДокументов.ДоговорыГражданскоПравовогоХарактера.Чтение.Объект.Документ.ДоговорАвторскогоЗаказа
	|ЖурналДокументов.ДоговорыГражданскоПравовогоХарактера.Чтение.Объект.Документ.ДоговорРаботыУслуги
	|ЖурналДокументов.ДокументыОбменаСБанкамиПоЗарплатнымПроектам.Чтение.Организации
	|ЖурналДокументов.ДокументыПоНДФЛ.Чтение.Объект.Документ.ЗаявлениеНаПредоставлениеЛьготыПоНДФЛ
	|ЖурналДокументов.ДокументыПоНДФЛ.Чтение.Объект.Документ.ОперацияНалоговогоУчетаПоНДФЛ
	|ЖурналДокументов.ДокументыПоНДФЛ.Чтение.Объект.Документ.ПерерасчетНДФЛ
	|ЖурналДокументов.ДокументыПоНДФЛ.Чтение.Объект.Документ.ПрекращениеЛьготПоНДФЛ
	|ЖурналДокументов.ДокументыПоНМА.Чтение.Организации
	|ЖурналДокументов.ДокументыПоНМАМеждународныйУчет.Чтение.Организации
	|ЖурналДокументов.ДокументыПоОС.Чтение.Организации
	|ЖурналДокументов.ДокументыПоОСМеждународныйУчет.Чтение.Организации
	|ЖурналДокументов.ДокументыПродажи.Чтение.ГруппыПартнеров
	|ЖурналДокументов.ДокументыПродажи.Чтение.Организации
	|ЖурналДокументов.ДокументыПродажи.Чтение.Подразделения
	|ЖурналДокументов.ДокументыПродажи.Чтение.Склады
	|ЖурналДокументов.ДокументыУправленияШтатнымРасписанием.Чтение.Организации
	|ЖурналДокументов.ДокументыУправленияШтатнымРасписанием.Чтение.ПодразделенияОрганизаций
	|ЖурналДокументов.ЗаймыСотрудникам.Чтение.Объект.Документ.ДоговорЗаймаСотруднику
	|ЖурналДокументов.ЗаймыСотрудникам.Чтение.Объект.Документ.ИзменениеУсловийДоговораЗаймаСотруднику
	|ЖурналДокументов.ЗаявленияНаЛьготы.Чтение.Объект.Документ.ЗаявлениеНаПредоставлениеЛьготыПоНДФЛ
	|ЖурналДокументов.ЗаявленияНаЛьготы.Чтение.Объект.Документ.ПрекращениеЛьготПоНДФЛ
	|ЖурналДокументов.ЗаявленияОписиИРеестрыНаВыплатуПособий.Чтение.Объект.Документ.ЗаявлениеРасчетВФСС
	|ЖурналДокументов.ЗаявленияОписиИРеестрыНаВыплатуПособий.Чтение.Объект.Документ.ПодтверждениеОплатыЗаявленияРасчетаВФСС
	|ЖурналДокументов.ИзменениеОплатыСотрудников.Чтение.Объект.Документ.ИзменениеГрафикаРаботыСписком
	|ЖурналДокументов.ИзменениеОплатыСотрудников.Чтение.Объект.Документ.ИзменениеКвалификационногоРазряда
	|ЖурналДокументов.ИзменениеОплатыСотрудников.Чтение.Объект.Документ.ИзменениеМестРаботы
	|ЖурналДокументов.ИзменениеОплатыСотрудников.Чтение.Объект.Документ.ИзменениеОплатыТруда
	|ЖурналДокументов.ИзменениеОплатыСотрудников.Чтение.Объект.Документ.ИзменениеПлановыхНачислений
	|ЖурналДокументов.ИзменениеОплатыСотрудников.Чтение.Объект.Документ.ИндексацияЗаработка
	|ЖурналДокументов.ИзменениеОплатыСотрудников.Чтение.Объект.Документ.КадровыйПеревод
	|ЖурналДокументов.ИзменениеОплатыСотрудников.Чтение.Объект.Документ.КадровыйПереводСписком
	|ЖурналДокументов.ИзменениеОплатыСотрудников.Чтение.Объект.Документ.НазначениеПлановогоНачисления
	|ЖурналДокументов.ИзменениеОплатыСотрудников.Чтение.Объект.Документ.ОтменаДоплатыДоСреднегоЗаработка
	|ЖурналДокументов.ИзменениеОплатыСотрудников.Чтение.Объект.Документ.ОтменаСовмещения
	|ЖурналДокументов.ИзменениеОплатыСотрудников.Чтение.Объект.Документ.ПрекращениеПлановогоНачисления
	|ЖурналДокументов.ИзменениеОплатыСотрудников.Чтение.Объект.Документ.ПриказНаДоплатуДоСреднегоЗаработка
	|ЖурналДокументов.ИзменениеОплатыСотрудников.Чтение.Объект.Документ.Совмещение
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.БольничныйЛист
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ВозвратИзОтпускаПоУходуЗаРебенком
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ГрафикОтпусков
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ИзменениеГрафикаРаботыСписком
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ИзменениеКвалификационногоРазряда
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.КадровыйПеревод
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.КадровыйПереводСписком
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.Командировка
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.КомандировкиСотрудников
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ОплатаПоСреднемуЗаработку
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.Отгул
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ОтменаДоплатыДоСреднегоЗаработка
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ОтменаСовмещения
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.Отпуск
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ОтпускаСотрудников
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ОтпускБезСохраненияОплаты
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ОтпускПоУходуЗаРебенком
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ПереводКДругомуРаботодателю
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ПеремещениеВДругоеПодразделение
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ПеремещениеМеждуТерриториями
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ПереносОтпуска
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ПриемНаРаботу
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ПриемНаРаботуСписком
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ПриказНаДоплатуДоСреднегоЗаработка
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ПрогулНеявка
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ПродлениеКонтрактаДоговора
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ПростойСотрудников
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.РаботаВВыходныеИПраздничныеДни
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.РаботаСверхурочно
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.РегистрацияПереработок
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.Совмещение
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.Увольнение
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.УвольнениеСписком
	|ЖурналДокументов.Командировки.Чтение.Объект.Документ.Командировка
	|ЖурналДокументов.Командировки.Чтение.Объект.Документ.КомандировкиСотрудников
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Объект.Документ.БольничныйЛист
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Объект.Документ.ДоходВНатуральнойФорме
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Объект.Документ.ЕдиновременноеПособиеЗаСчетФСС
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Объект.Документ.Командировка
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Объект.Документ.МатериальнаяПомощь
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Объект.Документ.НачислениеЗаПервуюПоловинуМесяца
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Объект.Документ.НачислениеЗарплаты
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Объект.Документ.ОплатаПоСреднемуЗаработку
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Объект.Документ.Отгул
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Объект.Документ.Отпуск
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Объект.Документ.ОтпускБезСохраненияОплаты
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Объект.Документ.Премия
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Объект.Документ.ПрогулНеявка
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Объект.Документ.ПростойСотрудников
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Объект.Документ.РазовоеНачисление
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Объект.Документ.Увольнение
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Объект.Документ.УвольнениеСписком
	|ЖурналДокументов.НезарплатныеДоходы.Чтение.Объект.Документ.ВыплатаБывшимСотрудникам
	|ЖурналДокументов.НезарплатныеДоходы.Чтение.Объект.Документ.РегистрацияПрочихДоходов
	|ЖурналДокументов.Отпуска.Чтение.Объект.Документ.Отпуск
	|ЖурналДокументов.Отпуска.Чтение.Объект.Документ.ОтпускаСотрудников
	|ЖурналДокументов.ОтпускаПоУходуЗаРебенком.Чтение.Объект.Документ.ВозвратИзОтпускаПоУходуЗаРебенком
	|ЖурналДокументов.ОтпускаПоУходуЗаРебенком.Чтение.Объект.Документ.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком
	|ЖурналДокументов.ОтпускаПоУходуЗаРебенком.Чтение.Объект.Документ.ОтпускПоУходуЗаРебенком
	|ЖурналДокументов.Отсутствия.Чтение.Объект.Документ.БольничныйЛист
	|ЖурналДокументов.Отсутствия.Чтение.Объект.Документ.Командировка
	|ЖурналДокументов.Отсутствия.Чтение.Объект.Документ.КомандировкиСотрудников
	|ЖурналДокументов.Отсутствия.Чтение.Объект.Документ.ОплатаПоСреднемуЗаработку
	|ЖурналДокументов.Отсутствия.Чтение.Объект.Документ.Отгул
	|ЖурналДокументов.Отсутствия.Чтение.Объект.Документ.Отпуск
	|ЖурналДокументов.Отсутствия.Чтение.Объект.Документ.ОтпускаСотрудников
	|ЖурналДокументов.Отсутствия.Чтение.Объект.Документ.ОтпускБезСохраненияОплаты
	|ЖурналДокументов.Отсутствия.Чтение.Объект.Документ.ПрогулНеявка
	|ЖурналДокументов.ОтчетыКомиссионеров.Чтение.ГруппыПартнеров
	|ЖурналДокументов.ОтчетыКомиссионеров.Чтение.Организации
	|ЖурналДокументов.ОтчетыКомиссионеров.Чтение.Подразделения
	|ЖурналДокументов.ОтчетыКомитентам.Чтение.ГруппыПартнеров
	|ЖурналДокументов.ОтчетыКомитентам.Чтение.Организации
	|ЖурналДокументов.ОтчетыКомитентам.Чтение.Подразделения
	|ЖурналДокументов.ОтчетыОРозничныхПродажахИВыручке.Чтение.КассыККМ
	|ЖурналДокументов.ОтчетыОРозничныхПродажахИВыручке.Чтение.Организации
	|ЖурналДокументов.ОтчетыОРозничныхПродажахИВыручке.Чтение.Подразделения
	|ЖурналДокументов.ОтчетыОРозничныхПродажахИВыручке.Чтение.Склады
	|ЖурналДокументов.ПередачиВозвратыТоваровМеждуОрганизациями.Чтение.Организации
	|ЖурналДокументов.Подработки.Чтение.Объект.Документ.НазначениеПодработки
	|ЖурналДокументов.Подработки.Чтение.Объект.Документ.ПрекращениеПодработки
	|ЖурналДокументов.ПриемыПереводыУвольнения.Чтение.Объект.Документ.ВозвратИзОтпускаПоУходуЗаРебенком
	|ЖурналДокументов.ПриемыПереводыУвольнения.Чтение.Объект.Документ.ИзменениеГрафикаРаботыСписком
	|ЖурналДокументов.ПриемыПереводыУвольнения.Чтение.Объект.Документ.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком
	|ЖурналДокументов.ПриемыПереводыУвольнения.Чтение.Объект.Документ.КадровыйПеревод
	|ЖурналДокументов.ПриемыПереводыУвольнения.Чтение.Объект.Документ.КадровыйПереводСписком
	|ЖурналДокументов.ПриемыПереводыУвольнения.Чтение.Объект.Документ.ОтпускПоУходуЗаРебенком
	|ЖурналДокументов.ПриемыПереводыУвольнения.Чтение.Объект.Документ.ПереводКДругомуРаботодателю
	|ЖурналДокументов.ПриемыПереводыУвольнения.Чтение.Объект.Документ.ПеремещениеВДругоеПодразделение
	|ЖурналДокументов.ПриемыПереводыУвольнения.Чтение.Объект.Документ.ПеремещениеМеждуТерриториями
	|ЖурналДокументов.ПриемыПереводыУвольнения.Чтение.Объект.Документ.ПриемНаРаботу
	|ЖурналДокументов.ПриемыПереводыУвольнения.Чтение.Объект.Документ.ПриемНаРаботуСписком
	|ЖурналДокументов.ПриемыПереводыУвольнения.Чтение.Объект.Документ.Увольнение
	|ЖурналДокументов.ПриемыПереводыУвольнения.Чтение.Объект.Документ.УвольнениеСписком
	|ЖурналДокументов.РаботаСверхурочно.Чтение.Объект.Документ.РаботаСверхурочно
	|ЖурналДокументов.РаботаСверхурочно.Чтение.Объект.Документ.РегистрацияПереработок
	|ЖурналДокументов.РегламентныеДокументы.Чтение.Организации
	|ЖурналДокументов.СкладскиеОрдера.Чтение.Склады
	|ЖурналДокументов.СкладскиеОрдераНаИзлишкиНедостачиПорчи.Чтение.Склады
	|ЖурналДокументов.ЧекиККМ.Чтение.КассыККМ
	|ЖурналДокументов.ЧекиККМ.Чтение.Организации
	|ЖурналДокументов.ЧекиККМ.Чтение.Склады
	|РегистрСведений.ABCXYZКлассификацияКлиентов.Чтение.ГруппыПартнеров
	|РегистрСведений.ABCXYZКлассификацияКлиентов.Изменение.ГруппыПартнеров
	|РегистрСведений.ABCXYZКлассификацияНоменклатуры.Изменение.ГруппыНоменклатуры
	|РегистрСведений.АрхивДанныхРегламентированнойОтчетности.Чтение.Организации
	|РегистрСведений.АрхивДанныхРегламентированнойОтчетности.Изменение.Организации
	|РегистрСведений.БазовыеПериодыИндексации.Чтение.Организации
	|РегистрСведений.БазовыеПериодыИндексации.Изменение.Организации
	|РегистрСведений.БухучетЗарплатыОрганизаций.Чтение.Организации
	|РегистрСведений.БухучетЗарплатыОрганизаций.Изменение.Организации
	|РегистрСведений.ВариантыОбеспеченияТоварами.Чтение.Склады
	|РегистрСведений.ВариантыОбеспеченияТоварами.Изменение.Склады
	|РегистрСведений.ВоинскийУчет.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ВоинскийУчет.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ГражданствоФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ГражданствоФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ГрафикРаботыСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ГрафикРаботыСотрудников.Чтение.Организации
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.СогласованиеЗакупки
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.СогласованиеЗаявкиНаВозвратТоваровОтКлиента
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.СогласованиеПродажи
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.СогласованиеЦенНоменклатуры
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ТиповаяПродажа
	|РегистрСведений.ДанныеВнутреннихДокументов.Чтение.Организации
	|РегистрСведений.ДанныеВнутреннихДокументов.Чтение.Подразделения
	|РегистрСведений.ДанныеВнутреннихДокументов.Чтение.Склады
	|РегистрСведений.ДанныеОбОплатеТрудаДляПодбораСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДанныеОбОплатеТрудаДляПодбораСотрудников.Чтение.Организации
	|РегистрСведений.ДанныеПервичныхДокументов.Чтение.Организации
	|РегистрСведений.ДанныеСостоянийСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДетиПоПоИсполнительномуДокументу.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДетиПоПоИсполнительномуДокументу.Чтение.Организации
	|РегистрСведений.ДетиПоПоИсполнительномуДокументу.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ДетиПоПоИсполнительномуДокументу.Изменение.Организации
	|РегистрСведений.ДокументыФизическихЛиц.Чтение.ГруппыПартнеров
	|РегистрСведений.ДокументыФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДокументыФизическихЛиц.Изменение.ГруппыПартнеров
	|РегистрСведений.ДокументыФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ДоступностьТоваровДляВнешнихПользователей.Чтение.Склады
	|РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений.Чтение.Склады
	|РегистрСведений.ЕСВСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЕСВСотрудников.Чтение.Организации
	|РегистрСведений.ЕСВСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ЕСВСотрудников.Изменение.Организации
	|РегистрСведений.ЗаданияКРаспределениюРасчетовСКлиентами.Чтение.ГруппыПартнеров
	|РегистрСведений.ЗаданияКРаспределениюРасчетовСКлиентами.Чтение.Организации
	|РегистрСведений.ЗаданияКРаспределениюРасчетовСПоставщиками.Чтение.ГруппыПартнеров
	|РегистрСведений.ЗаданияКРаспределениюРасчетовСПоставщиками.Чтение.Организации
	|РегистрСведений.ЗаданияКФормированиюИсходящихНалоговыхДокументов.Чтение.ГруппыПартнеров
	|РегистрСведений.ЗаданияКФормированиюИсходящихНалоговыхДокументов.Чтение.Организации
	|РегистрСведений.ЗаданияКРасчетуНалоговыхОбязательствДополнительно.Чтение.ГруппыПартнеров
	|РегистрСведений.ЗаданияКРасчетуНалоговыхОбязательствДополнительно.Чтение.Организации
	|РегистрСведений.ЗарплатаКадрыДолиСписанияКосвенныхРасходов.Чтение.Организации
	|РегистрСведений.ЗнаниеЯзыковФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЗнаниеЯзыковФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыОрганизаций.Чтение.Организации
	|РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыПодразделений.Чтение.Организации
	|РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников.Чтение.Организации
	|РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников.Изменение.Организации
	|РегистрСведений.ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя.Чтение.Организации
	|РегистрСведений.ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя.Изменение.Организации
	|РегистрСведений.ЗначенияРазовыхПоказателейРасчетаЗарплатыОрганизаций.Чтение.Организации
	|РегистрСведений.ЗначенияРазовыхПоказателейРасчетаЗарплатыПодразделений.Чтение.Организации
	|РегистрСведений.ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудников.Чтение.Организации
	|РегистрСведений.ЗначенияСовокупныхТарифныхСтавокСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ИсторияЕжегодныхОтпусковПоШтатномуРасписанию.Чтение.Организации
	|РегистрСведений.ИсторияЕжегодныхОтпусковПоШтатномуРасписанию.Чтение.ПодразделенияОрганизаций
	|РегистрСведений.ИсторияИспользованияШтатногоРасписания.Чтение.Организации
	|РегистрСведений.ИсторияИспользованияШтатногоРасписания.Чтение.ПодразделенияОрганизаций
	|РегистрСведений.ИсторияНачисленийПоШтатномуРасписанию.Чтение.Организации
	|РегистрСведений.ИсторияНачисленийПоШтатномуРасписанию.Чтение.ПодразделенияОрганизаций
	|РегистрСведений.ИсторияПоказателейПоШтатномуРасписанию.Чтение.Организации
	|РегистрСведений.ИсторияПоказателейПоШтатномуРасписанию.Чтение.ПодразделенияОрганизаций
	|РегистрСведений.ИсторияСпециальностейПоШтатномуРасписанию.Чтение.Организации
	|РегистрСведений.ИсторияСпециальностейПоШтатномуРасписанию.Чтение.ПодразделенияОрганизаций
	|РегистрСведений.ИсточникиПервичногоИнтереса.Чтение.ГруппыПартнеров
	|РегистрСведений.ИсточникиПервичногоИнтереса.Чтение.Объект.Справочник.СделкиСКлиентами
	|РегистрСведений.КадроваяИсторияСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.КадроваяИсторияСотрудников.Чтение.Организации
	|РегистрСведений.КорзинаПокупателя.Чтение.ВнешниеПользователи
	|РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Чтение.Организации
	|РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Изменение.Организации
	|РегистрСведений.ЛьготыНаДетейНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЛьготыФизическихЛицНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.МестаВыплатыЗарплатыОрганизаций.Чтение.Организации
	|РегистрСведений.МестаВыплатыЗарплатыОрганизаций.Изменение.Организации
	|РегистрСведений.НаградыФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.НаградыФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.НастройкаКонтроляОбеспечения.Чтение.Склады
	|РегистрСведений.НастройкаКонтроляОбеспечения.Изменение.Склады
	|РегистрСведений.НастройкаПередачиТоваровМеждуОрганизациями.Чтение.Организации
	|РегистрСведений.НастройкаПередачиТоваровМеждуОрганизациями.Изменение.Организации
	|РегистрСведений.НастройкиАдресныхСкладов.Чтение.Склады
	|РегистрСведений.НастройкиАдресныхСкладов.Изменение.Склады
	|РегистрСведений.НастройкиЗарплатаКадры.Чтение.Организации
	|РегистрСведений.НастройкиЗарплатаКадры.Изменение.Организации
	|РегистрСведений.НастройкиЗарплатаКадрыРасширенная.Чтение.Организации
	|РегистрСведений.НастройкиЗарплатаКадрыРасширенная.Изменение.Организации
	|РегистрСведений.НастройкиРасчетаРезервовОтпусков.Чтение.Организации
	|РегистрСведений.НастройкиУчетаПособийСоциальногоСтрахования.Чтение.Организации
	|РегистрСведений.НастройкиУчетаПособийСоциальногоСтрахования.Изменение.Организации
	|РегистрСведений.НастройкиУчетаСтраховыхВзносов.Чтение.Организации
	|РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты.Чтение.Организации
	|РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты.Изменение.Организации
	|РегистрСведений.ОплатаПособийСоциальногоСтрахования.Чтение.Организации
	|РегистрСведений.ОплатаПособийСоциальногоСтрахования.Изменение.Организации
	|РегистрСведений.ОплаченныеДоговоры.Чтение.Организации
	|РегистрСведений.ОсновныеДанныеКонтрактаДоговораСотрудника.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ОсновныеДанныеКонтрактаДоговораСотрудника.Чтение.Организации
	|РегистрСведений.ОстаткиНаБанковскихСчетахПоДаннымВыписок.Чтение.Организации
	|РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников.Чтение.Организации
	|РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников.Изменение.Организации
	|РегистрСведений.ОтражениеВРегламентированномУчетеНастройкиОрганизаций.Чтение.Организации
	|РегистрСведений.ОтражениеВРегламентированномУчетеНастройкиОрганизаций.Изменение.Организации
	|РегистрСведений.ОтражениеДокументовВРеглУчете.Чтение.Организации
	|РегистрСведений.ОтражениеДокументовВРеглУчете.Изменение.Организации
	|РегистрСведений.ПараметрыПлатежныхДокументовПоНалогам.Чтение.Организации	
	|РегистрСведений.ПартнерыСегмента.Чтение.ВнешниеПользователи
	|РегистрСведений.ПартнерыСегмента.Чтение.ГруппыПартнеров
	|РегистрСведений.ПартнерыСегмента.Изменение.ГруппыПартнеров
	|РегистрСведений.ПерерасчетЗарплаты.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПерерасчетЗарплаты.Чтение.Организации
	|РегистрСведений.ПерерасчетЗарплаты.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПерерасчетЗарплаты.Изменение.Организации
	|РегистрСведений.ПерерасчетСреднегоЗаработка.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПерерасчетСреднегоЗаработка.Чтение.Организации
	|РегистрСведений.ПерерасчетСреднегоЗаработка.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПерерасчетСреднегоЗаработка.Изменение.Организации
	|РегистрСведений.ПериодыДействияДоговоровГражданскоПравовогоХарактера.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПериодыДействияДоговоровГражданскоПравовогоХарактера.Чтение.Организации
	|РегистрСведений.ПлановыеЕжегодныеОтпуска.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеЕжегодныеОтпуска.Чтение.Организации
	|РегистрСведений.ПлановыеЕжегодныеОтпуска.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеЕжегодныеОтпуска.Изменение.Организации
	|РегистрСведений.ПлановыеНачисления.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеНачисления.Чтение.Организации
	|РегистрСведений.ПлановыеНачисленияПоДоговорам.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеНачисленияПоДоговорам.Чтение.Организации
	|РегистрСведений.ПлановыеУдержания.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеУдержания.Чтение.Организации
	|РегистрСведений.ПлановыеУдержания.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеУдержания.Изменение.Организации
	|РегистрСведений.ПлановыйФОТ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыйФОТ.Чтение.Организации
	|РегистрСведений.ПодчиненностьПодразделенийОрганизаций.Чтение.Организации
	|РегистрСведений.ПодчиненностьПодразделенийОрганизаций.Чтение.ПодразделенияОрганизаций
	|РегистрСведений.ПорядокОтраженияДоходов.Чтение.Организации
	|РегистрСведений.ПорядокОтраженияДоходов.Изменение.Организации
	|РегистрСведений.ПорядокОтраженияНоменклатуры.Чтение.Организации
	|РегистрСведений.ПорядокОтраженияНоменклатуры.Изменение.Организации
	|РегистрСведений.ПорядокОтраженияНоменклатурыПереданнойНаКомиссию.Чтение.Организации
	|РегистрСведений.ПорядокОтраженияНоменклатурыПереданнойНаКомиссию.Изменение.Организации
	|РегистрСведений.ПорядокОтраженияПодарочныхСертификатов.Чтение.Организации
	|РегистрСведений.ПорядокОтраженияПодарочныхСертификатов.Изменение.Организации
	|РегистрСведений.ПорядокОтраженияПрочихОпераций.Чтение.Организации
	|РегистрСведений.ПорядокОтраженияПрочихОпераций.Изменение.Организации
	|РегистрСведений.ПорядокОтраженияРасходов.Чтение.Организации
	|РегистрСведений.ПорядокОтраженияРасходов.Изменение.Организации
	|РегистрСведений.ПорядокОтраженияРасчетовСПартнерами.Чтение.Организации
	|РегистрСведений.ПорядокОтраженияРасчетовСПартнерами.Изменение.Организации
	|РегистрСведений.ПорядокОтраженияТМЦВЭксплуатации.Чтение.Организации
	|РегистрСведений.ПорядокОтраженияТМЦВЭксплуатации.Изменение.Организации
	|РегистрСведений.ПравилаРазмещенияТоваровВЯчейках.Чтение.Склады
	|РегистрСведений.ПравилаРазмещенияТоваровВЯчейках.Изменение.Склады
	|РегистрСведений.ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудников.Чтение.Организации
	|РегистрСведений.ПрогнозыРасходаУпаковок.Чтение.Склады
	|РегистрСведений.ПрогнозыРасходаУпаковок.Изменение.Склады
	|РегистрСведений.ПрофессииФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПрофессииФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.РабочиеМестаДляУчетаСпецстажа.Чтение.Организации
	|РегистрСведений.РабочиеМестаДляУчетаСпецстажа.Изменение.Организации
	|РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.Чтение.Склады
	|РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.Изменение.Склады
	|РегистрСведений.РасчетРезерваОтпусков.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РасчетРезервовПоСомнительнымДолгам.Чтение.Организации
	|РегистрСведений.РеестрКадровыхПриказов.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РеестрОтпусков.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РолиСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РолиСотрудников.Чтение.Организации
	|РегистрСведений.РолиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РолиФизическихЛиц.Чтение.Организации
	|РегистрСведений.РолиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.РолиФизическихЛиц.Изменение.Организации
	|РегистрСведений.СведенияКонтрактаДоговораСотрудника.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияКонтрактаДоговораСотрудника.Чтение.Организации
	|РегистрСведений.СведенияОбИнвалидностиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОбИнвалидностиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОЛицахСДополнительнымиГарантиями.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОЛицахСДополнительнымиГарантиями.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОЛьготахФизическихЛицПострадавшихВАварииЧАЭС.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОЛьготахФизическихЛицПострадавшихВАварииЧАЭС.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Чтение.Организации
	|РегистрСведений.СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Изменение.Организации
	|РегистрСведений.СведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОПенсионерах.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОПенсионерах.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СвязиМеждуПартнерами.Чтение.ГруппыПартнеров
	|РегистрСведений.СвязиМеждуПартнерами.Изменение.ГруппыПартнеров
	|РегистрСведений.СобытияКалендаряБухгалтера.Чтение.Организации
	|РегистрСведений.СобытияКалендаряБухгалтера.Изменение.Организации
	|РегистрСведений.СоставГруппСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СоставГруппСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СостоянияВБракеФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СостоянияВБракеФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СостоянияДокументовЗачисленияЗарплаты.Чтение.Организации
	|РегистрСведений.СостоянияДокументовЗачисленияЗарплаты.Изменение.Организации
	|РегистрСведений.СостоянияДокументовОткрытияЛицевыхСчетов.Чтение.Организации
	|РегистрСведений.СостоянияДокументовОткрытияЛицевыхСчетов.Изменение.Организации
	|РегистрСведений.СостоянияИРеквизитыДоставки.Чтение.ГруппыПартнеров
	|РегистрСведений.СостоянияИРеквизитыДоставки.Чтение.Подразделения
	|РегистрСведений.СостоянияИРеквизитыДоставки.Чтение.Склады
	|РегистрСведений.СостоянияПодработок.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СостоянияПодработок.Чтение.Организации
	|РегистрСведений.СостоянияСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СостоянияСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СпециальностиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СпециальностиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СпецстажСотрудников.Чтение.Организации
	|РегистрСведений.СпецстажСотрудников.Изменение.Организации
	|РегистрСведений.СтажиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтажиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СтоимостьТоваров.Чтение.Организации
	|РегистрСведений.СтроковыеСведенияФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтроковыеСведенияФизическихЛиц.Изменение.ГруппыФизическихЛиц 
	|РегистрСведений.СхемыОбеспечения.Чтение.Склады
	|РегистрСведений.СхемыОбеспечения.Изменение.Склады
	|РегистрСведений.СчетчикиВыгрузок.Чтение.Организации
	|РегистрСведений.СчетчикиВыгрузок.Изменение.Организации
	|РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников.Чтение.Организации
	|РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников.Изменение.Организации
	|РегистрСведений.ТекущиеКадровыеДанныеСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ТекущиеКадровыеДанныеСотрудников.Чтение.Организации
	|РегистрСведений.ТекущиеКадровыеДанныеСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ТекущиеКадровыеДанныеСотрудников.Изменение.Организации
	|РегистрСведений.ТерриторииСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ТерриторииСотрудников.Чтение.Организации
	|РегистрСведений.ТоварныеОграничения.Чтение.Склады
	|РегистрСведений.ТоварныеОграничения.Изменение.Склады
	|РегистрСведений.ТрудоваяДеятельностьФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ТрудоваяДеятельностьФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.УсловияДоговораГПХ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.УсловияДоговораГПХ.Чтение.Организации
	|РегистрСведений.УсловияОплатыОтпускаПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.УсловияОплатыОтпускаПоУходуЗаРебенком.Чтение.Организации
	|РегистрСведений.УсловияУдержанияПоИсполнительномуДокументу.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.УсловияУдержанияПоИсполнительномуДокументу.Чтение.Организации
	|РегистрСведений.УсловияУдержанияПоИсполнительномуДокументу.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.УсловияУдержанияПоИсполнительномуДокументу.Изменение.Организации
	|РегистрСведений.УченыеЗванияФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.УченыеЗванияФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.УченыеСтепениФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.УченыеСтепениФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.УчетнаяПолитикаОрганизаций.Чтение.Организации
	|РегистрСведений.УчетнаяПолитикаОрганизаций.Изменение.Организации
	|РегистрСведений.УчетнаяПолитикаПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ФайлыВРабочемКаталоге.Чтение.Пользователи
	|РегистрСведений.ФайлыВРабочемКаталоге.Изменение.Пользователи
	|РегистрСведений.ФИОФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ФИОФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ХранимыеФайлыВерсий.Чтение.Объект.Справочник.ФизическиеЛица
	|РегистрСведений.ЦеныНоменклатуры.Чтение.ВидыЦен
	|РегистрСведений.ЦеныНоменклатурыПоставщиков.Чтение.ГруппыПартнеров
	|РегистрСведений.ШтрихкодыНоменклатуры.Изменение.ГруппыНоменклатуры
	|РегистрНакопления.БухучетНачисленияУдержанияПоКонтрагентамАкционерам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.БухучетНачисленияУдержанияПоКонтрагентамАкционерам.Чтение.Организации
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникам.Чтение.Организации
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникам.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникам.Изменение.Организации
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникамАвансом.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникамАвансом.Чтение.Организации
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникамАвансом.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникамАвансом.Изменение.Организации
	|РегистрНакопления.ВзаиморасчетыПоЗаймамСотрудникам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ВзаиморасчетыПоЗаймамСотрудникам.Чтение.Организации
	|РегистрНакопления.ВзаиморасчетыССотрудниками.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ВзаиморасчетыССотрудниками.Чтение.Организации
	|РегистрНакопления.ВыплатаОтпусковЗаСчетРезерва.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ВыплатаОтпусковЗаСчетРезерва.Чтение.Организации
	|РегистрНакопления.ВыручкаИСебестоимостьПродаж.Чтение.ГруппыПартнеров
	|РегистрНакопления.ВыручкаИСебестоимостьПродаж.Чтение.Организации
	|РегистрНакопления.ВыручкаИСебестоимостьПродаж.Чтение.Подразделения
	|РегистрНакопления.ГрафикОтгрузкиТоваров.Чтение.Склады
	|РегистрНакопления.ГрафикПоступленияТоваров.Чтение.Склады
	|РегистрНакопления.ДанныеОбУчтенныхСуммахДляРасчетаСреднегоЗаработкаФСС.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Чтение.Организации
	|РегистрНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДвижениеТоваров.Чтение.Склады
	|РегистрНакопления.ДвиженияДенежныеСредстваДоходыРасходы.Чтение.Организации
	|РегистрНакопления.ДвиженияДенежныеСредстваДоходыРасходы.Чтение.Подразделения
	|РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент.Чтение.Организации
	|РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент.Чтение.Подразделения
	|РегистрНакопления.ДвиженияДенежныхСредств.Чтение.Организации
	|РегистрНакопления.ДвиженияДенежныхСредств.Чтение.Подразделения
	|РегистрНакопления.ДвиженияДоходыРасходыПрочиеАктивыПассивы.Чтение.Организации
	|РегистрНакопления.ДвиженияДоходыРасходыПрочиеАктивыПассивы.Чтение.Подразделения
	|РегистрНакопления.ДвиженияНоменклатураДоходыРасходы.Чтение.Организации
	|РегистрНакопления.ДвиженияНоменклатураДоходыРасходы.Чтение.Подразделения
	|РегистрНакопления.ДвиженияНоменклатураДоходыРасходы.Чтение.Склады
	|РегистрНакопления.ДвиженияНоменклатураНоменклатура.Чтение.ГруппыПартнеров
	|РегистрНакопления.ДвиженияНоменклатураНоменклатура.Чтение.Организации
	|РегистрНакопления.ДвиженияНоменклатураНоменклатура.Чтение.Подразделения
	|РегистрНакопления.ДвиженияНоменклатураНоменклатура.Чтение.Склады
	|РегистрНакопления.ДвиженияСерийТоваров.Чтение.Склады
	|РегистрНакопления.ДенежныеДокументы.Чтение.Организации
	|РегистрНакопления.ДенежныеДокументы.Чтение.Подразделения
	|РегистрНакопления.ДенежныеСредстваБезналичные.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваВКассахККМ.Чтение.КассыККМ
	|РегистрНакопления.ДенежныеСредстваВКассахККМ.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваВПути.Чтение.Кассы
	|РегистрНакопления.ДенежныеСредстваВПути.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваКВыплате.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваНаличные.Чтение.Кассы
	|РегистрНакопления.ДенежныеСредстваНаличные.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Чтение.Организации
	|РегистрНакопления.ЗаказыКлиентов.Чтение.ВнешниеПользователи
	|РегистрНакопления.ЗаказыКлиентов.Чтение.ГруппыПартнеров
	|РегистрНакопления.ЗаказыКлиентов.Чтение.Организации
	|РегистрНакопления.ЗаказыКлиентов.Чтение.Склады
	|РегистрНакопления.ЗаказыМатериаловВПроизводство.Чтение.Подразделения
	|РегистрНакопления.ЗаказыМатериаловВПроизводство.Чтение.Склады
	|РегистрНакопления.ЗаказыМатериаловСУчетомКорректировок.Чтение.Организации
	|РегистрНакопления.ЗаказыМатериаловСУчетомКорректировок.Чтение.Подразделения
	|РегистрНакопления.ЗаказыМатериаловСУчетомКорректировок.Чтение.Склады
	|РегистрНакопления.ЗаказыНаВнутреннееПотребление.Чтение.Организации
	|РегистрНакопления.ЗаказыНаВнутреннееПотребление.Чтение.Подразделения
	|РегистрНакопления.ЗаказыНаВнутреннееПотребление.Чтение.Склады
	|РегистрНакопления.ЗаказыНаПеремещение.Чтение.Организации
	|РегистрНакопления.ЗаказыНаПеремещение.Чтение.Склады
	|РегистрНакопления.ЗаказыНаСборку.Чтение.Организации
	|РегистрНакопления.ЗаказыНаСборку.Чтение.Склады
	|РегистрНакопления.ЗаказыПоставщикам.Чтение.ГруппыПартнеров
	|РегистрНакопления.ЗаказыПоставщикам.Чтение.Организации
	|РегистрНакопления.ЗаказыПоставщикам.Чтение.Склады
	|РегистрНакопления.Закупки.Чтение.ГруппыПартнеров
	|РегистрНакопления.Закупки.Чтение.Организации
	|РегистрНакопления.Закупки.Чтение.Подразделения
	|РегистрНакопления.Закупки.Чтение.Склады
	|РегистрНакопления.ЗанятыеПозицииШтатногоРасписания.Чтение.Организации
	|РегистрНакопления.ЗанятыеПозицииШтатногоРасписания.Чтение.ПодразделенияОрганизаций
	|РегистрНакопления.ЗанятыеПозицииШтатногоРасписания.Изменение.Организации
	|РегистрНакопления.ЗанятыеПозицииШтатногоРасписания.Изменение.ПодразделенияОрганизаций
	|РегистрНакопления.ЗарплатаКВыплате.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ЗарплатаКВыплате.Чтение.Организации
	|РегистрНакопления.ЗарплатаКВыплатеАвансом.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ЗарплатаКВыплатеАвансом.Чтение.Организации
	|РегистрНакопления.ЗарплатаКВыплатеАвансом.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.ЗарплатаКВыплатеАвансом.Изменение.Организации
	|РегистрНакопления.ЗаявкиНаВозвратТоваровОтКлиентов.Чтение.ГруппыПартнеров
	|РегистрНакопления.ЗаявкиНаВозвратТоваровОтКлиентов.Чтение.Организации
	|РегистрНакопления.ЗаявкиНаВозвратТоваровОтКлиентов.Чтение.Склады
	|РегистрНакопления.ЗначенияОперативныхПоказателейРасчетаЗарплатыОрганизаций.Чтение.Организации
	|РегистрНакопления.ЗначенияОперативныхПоказателейРасчетаЗарплатыПодразделений.Чтение.Организации
	|РегистрНакопления.ЗначенияОперативныхПоказателейРасчетаЗарплатыСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ЗначенияОперативныхПоказателейРасчетаЗарплатыСотрудников.Чтение.Организации
	|РегистрНакопления.ИсчисленныеСтраховыеВзносы.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ИсчисленныеСтраховыеВзносы.Чтение.Организации
	|РегистрНакопления.ИсчисленныеСтраховыеВзносыАвансом.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ИсчисленныеСтраховыеВзносыАвансом.Чтение.Организации
	|РегистрНакопления.ИсчисленныйНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ИсчисленныйНДФЛ.Чтение.Организации
	|РегистрНакопления.ИсчисленныйНДФЛАвансом.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ИсчисленныйНДФЛАвансом.Чтение.Организации
	|РегистрНакопления.КнигаДоходовРасходовПоЕдиномуНалогу.Чтение.Организации
	|РегистрНакопления.ЛимитыРасходаДенежныхСредств.Чтение.Организации
	|РегистрНакопления.ЛимитыРасходаДенежныхСредств.Чтение.Подразделения
	|РегистрНакопления.МатериалыИРаботыВПроизводстве.Чтение.Организации
	|РегистрНакопления.НачисленияПоДоговорамГПХ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияПоДоговорамГПХ.Чтение.Организации
	|РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам.Чтение.Организации
	|РегистрНакопления.НачисленияУдержанияПоСотрудникам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияУдержанияПоСотрудникам.Чтение.Организации
	|РегистрНакопления.НачисленияУдержанияПоСотрудникам.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияУдержанияПоСотрудникам.Изменение.Организации
	|РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом.Чтение.Организации
	|РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом.Изменение.Организации
	|РегистрНакопления.НДСНоменклатурныйСоставДляНалоговыхНакладных.Чтение.ГруппыПартнеров
	|РегистрНакопления.НДСНоменклатурныйСоставДляНалоговыхНакладных.Чтение.Организации
	|РегистрНакопления.НДСРасчетНалоговогоКредита.Чтение.ГруппыПартнеров
	|РегистрНакопления.НДСРасчетНалоговогоКредита.Чтение.Организации
	|РегистрНакопления.НДСРасчетНалоговыхОбязательств.Чтение.ГруппыПартнеров
	|РегистрНакопления.НДСРасчетНалоговыхОбязательств.Чтение.Организации
	|РегистрНакопления.НДСРеестрВыданныхНалоговыхДокументов.Чтение.ГруппыПартнеров
	|РегистрНакопления.НДСРеестрВыданныхНалоговыхДокументов.Чтение.Организации
	|РегистрНакопления.НДСРеестрПолученныхНалоговыхДокументов.Чтение.ГруппыПартнеров
	|РегистрНакопления.НДСРеестрПолученныхНалоговыхДокументов.Чтение.Организации
	|РегистрНакопления.НДССоставПоставкиДляРегистрацииВходящихНалоговыхДокументов.Чтение.ГруппыПартнеров
	|РегистрНакопления.НДССоставПоставкиДляРегистрацииВходящихНалоговыхДокументов.Чтение.Организации
	|РегистрНакопления.НДСУсловныеПродажи.Чтение.Организации
	|РегистрНакопления.ОбеспечениеЗаказов.Чтение.Склады
	|РегистрНакопления.ОборотыБюджетов.Чтение.Организации
	|РегистрНакопления.ОборотыБюджетов.Чтение.Подразделения
	|РегистрНакопления.ОтработанноеВремяПоСотрудникам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ОтработанноеВремяПоСотрудникам.Чтение.Организации
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамАвансом.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамАвансом.Чтение.Организации
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамАвансом.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамАвансом.Изменение.Организации
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамКорректировка.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамКорректировка.Чтение.Организации
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамКорректировка.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамКорректировка.Изменение.Организации
	|РегистрНакопления.ОценочныеОбязательства.Чтение.Организации
	|РегистрНакопления.ПартииЗатратНаВыпуск.Чтение.Организации
	|РегистрНакопления.ПартииНезавершенногоПроизводства.Чтение.Организации
	|РегистрНакопления.ПартииПроизводственныхЗатрат.Чтение.Организации
	|РегистрНакопления.ПартииПрочихРасходов.Чтение.Организации
	|РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров.Чтение.Организации
	|РегистрНакопления.ПартииТоваровОрганизаций.Чтение.Организации
	|РегистрНакопления.ПартииТоваровПереданныеНаКомиссию.Чтение.Организации
	|РегистрНакопления.ПереданнаяВозвратнаяТара.Чтение.ГруппыПартнеров
	|РегистрНакопления.ПереданнаяВозвратнаяТара.Чтение.Организации
	|РегистрНакопления.ПереданнаяВозвратнаяТара.Чтение.Склады
	|РегистрНакопления.ПринятаяВозвратнаяТара.Чтение.ГруппыПартнеров
	|РегистрНакопления.ПринятаяВозвратнаяТара.Чтение.Организации
	|РегистрНакопления.ПринятаяВозвратнаяТара.Чтение.Склады
	|РегистрНакопления.ПрочиеАктивыПассивы.Чтение.Организации
	|РегистрНакопления.ПрочиеДоходы.Чтение.Организации
	|РегистрНакопления.ПрочиеДоходы.Чтение.Подразделения
	|РегистрНакопления.ПрочиеРасходы.Чтение.Организации
	|РегистрНакопления.ПрочиеРасходы.Чтение.Подразделения
	|РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Чтение.Организации
	|РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов.Чтение.Организации
	|РегистрНакопления.РасчетыПоЭквайрингу.Чтение.Организации
	|РегистрНакопления.РасчетыПоЭквайрингу.Чтение.ЭквайринговыеТерминалы
	|РегистрНакопления.РасчетыСКлиентами.Чтение.ВнешниеПользователи
	|РегистрНакопления.РасчетыСКлиентами.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСКлиентами.Чтение.Организации
	|РегистрНакопления.РасчетыСКлиентамиПоДокументам.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСКлиентамиПоДокументам.Чтение.Организации
	|РегистрНакопления.РасчетыСПоставщиками.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСПоставщиками.Чтение.Организации
	|РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Чтение.Организации
	|РегистрНакопления.РасчетыСФондамиПоПособиям.Чтение.Организации
	|РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам.Чтение.Организации
	|РегистрНакопления.РозничныеПродажиПодакцизныхТоваров.Чтение.Организации	
	|РегистрНакопления.СведенияОДоходахНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СведенияОДоходахНДФЛ.Чтение.Организации
	|РегистрНакопления.СведенияОДоходахСтраховыеВзносы.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СведенияОДоходахСтраховыеВзносы.Чтение.Организации
	|РегистрНакопления.СвободныеОстатки.Чтение.Склады
	|РегистрНакопления.СебестоимостьТоваров.Чтение.Организации
	|РегистрНакопления.СтоимостьПриобретенияОСПропорциональноОблагаемыхНДС.Чтение.Организации
	|РегистрНакопления.СтраховыеВзносыПоФизическимЛицам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СтраховыеВзносыПоФизическимЛицам.Чтение.Организации
	|РегистрНакопления.СуммыКорректировокПропорциональногоНДС.Чтение.Организации
	|РегистрНакопления.СуммыКорректировокПропорциональногоНДС.Изменение.Организации
	|РегистрНакопления.ТМЦВЭксплуатации.Чтение.Организации
	|РегистрНакопления.ТМЦВЭксплуатации.Чтение.Подразделения
	|РегистрНакопления.ТоварыВЯчейках.Чтение.Склады
	|РегистрНакопления.ТоварыКОтгрузке.Чтение.Склады
	|РегистрНакопления.ТоварыКОформлениюИзлишковНедостач.Чтение.Склады
	|РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту.Чтение.ГруппыПартнеров
	|РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту.Чтение.Организации
	|РегистрНакопления.ТоварыКОформлениюПоступления.Чтение.Склады
	|РегистрНакопления.ТоварыКПоступлению.Чтение.Склады
	|РегистрНакопления.ТоварыНаСкладах.Чтение.Склады
	|РегистрНакопления.ТоварыОрганизаций.Чтение.Организации
	|РегистрНакопления.ТоварыОрганизацийКОформлению.Чтение.ГруппыПартнеров
	|РегистрНакопления.ТоварыОрганизацийКОформлению.Чтение.Организации
	|РегистрНакопления.ТоварыОрганизацийКПередаче.Чтение.Организации
	|РегистрНакопления.ТоварыПереданныеНаКомиссию.Чтение.Организации
	|РегистрНакопления.УдержанияПоИсполнительнымДокументам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.УдержанияПоИсполнительнымДокументам.Чтение.Организации
	|РегистрНакопления.ФактическиеДанныеБюджетирования.Чтение.Организации
	|РегистрНакопления.ФактическиеДанныеБюджетирования.Чтение.Подразделения
	|РегистрНакопления.ФинансовыеРезультаты.Чтение.Организации
	|РегистрНакопления.ФинансовыеРезультаты.Чтение.Подразделения
	|БизнесПроцесс.СогласованиеЦенНоменклатуры.Изменение.Пользователи
	|БизнесПроцесс.ТиповаяПродажа.Чтение.ГруппыПартнеров
	|БизнесПроцесс.ТиповаяПродажа.Чтение.Пользователи
	|БизнесПроцесс.ТиповаяПродажа.Изменение.ГруппыПартнеров
	|БизнесПроцесс.ТиповаяПродажа.Изменение.Пользователи
	|Задача.БюджетнаяЗадача.Чтение.Пользователи
	|Задача.БюджетнаяЗадача.Изменение.Пользователи
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.СогласованиеЗакупки
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.СогласованиеЗаявкиНаВозвратТоваровОтКлиента
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.СогласованиеПродажи
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.СогласованиеЦенНоменклатуры
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ТиповаяПродажа
	|РегистрБухгалтерии.Международный.Чтение.Организации
	|РегистрБухгалтерии.Международный.Изменение.Организации
	|РегистрБухгалтерии.Хозрасчетный.Чтение.Организации
	|РегистрБухгалтерии.Хозрасчетный.Изменение.Организации
	|РегистрРасчета.Начисления.Чтение.ГруппыФизическихЛиц
	|РегистрРасчета.Начисления.Чтение.Организации
	|РегистрРасчета.Удержания.Чтение.ГруппыФизическихЛиц
	|РегистрРасчета.Удержания.Чтение.Организации
	//-- НЕ УТКА
	|";
	
КонецПроцедуры

// Позволяет реализовать перезапись зависимых наборов значений доступа других объектов.
//
//  Вызывается из процедур:
// УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа(),
// УправлениеДоступомСлужебный.ЗаписатьЗависимыеНаборыЗначенийДоступа().
//
// Параметры:
//  Ссылка       - СправочникСсылка, ДокументСсылка, ... - ссылка на объект для которого
//                 записаны наборы значений доступа.
//
//  СсылкиНаЗависимыеОбъекты - Массив - массив элементов типа СправочникСсылка, ДокументСсылка, ...
//                 Содержит ссылки на объекты с зависимыми наборами значений доступа.
//                 Начальное значение - пустой массив.
//
Процедура ПриИзмененииНаборовЗначенийДоступа(Ссылка, СсылкиНаЗависимыеОбъекты) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
