
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//++ НЕ УТКА
	УстановитьУсловноеОформление();
	//-- НЕ УТКА
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	//++ НЕ УТКА
	Если ЗначениеЗаполнено(Параметры.Организация) Тогда
		Элементы.ГрафикПроизводстваОрганизация.Видимость = Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.Склад) Тогда
		Элементы.ГрафикПроизводстваСклад.Видимость = Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.Партнер) Тогда
		Элементы.ГрафикПроизводстваПереработчик.Видимость = Ложь;
	КонецЕсли;
	
	ЗаполнитьГрафикПроизводства();

	//-- НЕ УТКА
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	СтруктураПоиска = Новый Структура("Пометка", Истина);
 	СписокСтрок = ГрафикПроизводства.НайтиСтроки(СтруктураПоиска);
	
	Если СписокСтрок.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru='Необходимо выбрать заказы.';uk='Необхідно вибрати замовлення.'"));
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = ПроизводствоКлиент.ДанныеДляФормированияЗаказовПереработчикам(СписокСтрок);
	
	Закрыть(ДанныеЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПродукцию(Команда)
	
	Для каждого ТекущиеДанные Из ГрафикПроизводства Цикл
		ТекущиеДанные.Пометка = Истина;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьПродукцию(Команда)
	
	Для каждого ТекущиеДанные Из ГрафикПроизводства Цикл
		ТекущиеДанные.Пометка = Ложь;
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

//++ НЕ УТКА

#Область СлужебныеПроцедурыИФункции

#Область Прочее

&НаСервере
Процедура УстановитьУсловноеОформление()

	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма, 
																			 "ГрафикПроизводстваХарактеристика",
																		     "ГрафикПроизводства.ХарактеристикиИспользуются");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрафикПроизводства()

	ГрафикПроизводства.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыГрафика.ЗаказНаПроизводство   КАК ЗаказНаПроизводство,
	|	ЭтапыГрафика.КодСтрокиЭтапыГрафик  КАК КодСтрокиЭтапыГрафик,
	|	ЭтапыГрафика.Номенклатура          КАК Номенклатура,
	|	ЭтапыГрафика.Характеристика        КАК Характеристика,
	|	ЭтапыГрафика.Склад                 КАК Склад,
	|	СУММА(ЭтапыГрафика.Количество)     КАК Количество
	|ПОМЕСТИТЬ ПродукцияКЗаказу
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЭтапыГрафика.ЗаказНаПроизводство   КАК ЗаказНаПроизводство,
	|		ЭтапыГрафика.КодСтрокиЭтапыГрафик  КАК КодСтрокиЭтапыГрафик,
	|		ЭтапыГрафика.Номенклатура          КАК Номенклатура,
	|		ЭтапыГрафика.Характеристика        КАК Характеристика,
	|		ЭтапыГрафика.Склад                 КАК Склад,
	|		ЭтапыГрафика.КЗаказуОстаток        КАК Количество
	|	ИЗ
	|		РегистрНакопления.ПереработкаПоГрафикуПроизводства.Остатки(
	|			,
	|			&Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|				ИЛИ Склад В ИЕРАРХИИ(&Склад)) КАК ЭтапыГрафика
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ЭтапыГрафика.ЗаказНаПроизводство   КАК ЗаказНаПроизводство,
	|		ЭтапыГрафика.КодСтрокиЭтапыГрафик  КАК КодСтрокиЭтапыГрафик,
	|		ЭтапыГрафика.Номенклатура          КАК Номенклатура,
	|		ЭтапыГрафика.Характеристика        КАК Характеристика,
	|		ЭтапыГрафика.Склад                 КАК Склад,
	|		ЭтапыГрафика.КЗаказу               КАК Количество
	|	ИЗ
	|		РегистрНакопления.ПереработкаПоГрафикуПроизводства КАК ЭтапыГрафика
	|	ГДЕ
	|		ЭтапыГрафика.Регистратор = &Ссылка
	|		И ЭтапыГрафика.Активность
	|		И (&Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|				ИЛИ ЭтапыГрафика.Склад В ИЕРАРХИИ(&Склад))
	|
	|	) КАК ЭтапыГрафика
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапыГрафика.ЗаказНаПроизводство,
	|	ЭтапыГрафика.КодСтрокиЭтапыГрафик,
	|	ЭтапыГрафика.Номенклатура,
	|	ЭтапыГрафика.Характеристика,
	|	ЭтапыГрафика.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПереработкаПоГрафику.ЗаказНаПроизводство.Организация         КАК Организация,
	|	ПереработкаПоГрафику.ЗаказНаПроизводство                     КАК Распоряжение,
	|	ПереработкаПоГрафику.ЗаказНаПроизводство.Номер               КАК НомерРаспоряжения,
	|	ПереработкаПоГрафику.ЗаказНаПроизводство.Дата                КАК ДатаРаспоряжения,
	|	ЗаказЭтапы.Подразделение                                     КАК Подразделение,
	|	ЗаказЭтапы.Партнер                                           КАК Переработчик,
	|	ПереработкаПоГрафику.КодСтрокиЭтапыГрафик                    КАК КодСтрокиЭтапыГрафик,
	|	ПереработкаПоГрафику.Номенклатура                            КАК Номенклатура,
	|	ПереработкаПоГрафику.Характеристика                          КАК Характеристика,
	|	ПереработкаПоГрафику.Склад                                   КАК Склад,
	|	ПереработкаПоГрафику.Склад.Родитель                          КАК ГруппаСкладов,
	|	ЕСТЬNULL(ПереработкаПоГрафику.Склад.Родитель.ВыборГруппы, НЕОПРЕДЕЛЕНО) КАК ВыборГруппы,
	|	ПереработкаПоГрафику.Количество                              КАК Количество,
	|	ЗаказЭтапыГрафик.Этап.Представление                          КАК ЭтапПредставление,
	|	ЗаказНаПроизводствоПродукция.Спецификация.Представление      КАК СпецификацияПредставление,
	|	ЗаказНаПроизводствоПродукция.Спецификация.МногоэтапныйПроизводственныйПроцесс КАК МногоэтапныйПроизводственныйПроцесс,
	|	ЗаказЭтапыГрафик.НачалоПредварительногоБуфера                КАК Начало,
	|	ВЫБОР
	|		КОГДА ЗаказНаПроизводствоПродукция.Номенклатура.ИспользованиеХарактеристик В (
	|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры), 
	|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры), 
	|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                                        КАК ХарактеристикиИспользуются,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ЗаказЭтапыГрафик.НачалоПредварительногоБуфера, ДЕНЬ) < &ТекущаяДата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                                        КАК ДатаЗапускаПросрочена,
	|	ПереработкаПоГрафику.ЗаказНаПроизводство.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ИЗ
	|	ПродукцияКЗаказу КАК ПереработкаПоГрафику
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство КАК ДокЗаказНаПроизводство
	|		ПО (ДокЗаказНаПроизводство.Ссылка = ПереработкаПоГрафику.ЗаказНаПроизводство)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство.ЭтапыГрафик КАК ЗаказЭтапыГрафик
	|		ПО (ЗаказЭтапыГрафик.Ссылка = ПереработкаПоГрафику.ЗаказНаПроизводство)
	|			И (ЗаказЭтапыГрафик.КодСтроки = ПереработкаПоГрафику.КодСтрокиЭтапыГрафик)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство.Этапы КАК ЗаказЭтапы
	|		ПО (ЗаказЭтапы.Ссылка = ЗаказЭтапыГрафик.Ссылка)
	|			И (ЗаказЭтапы.КлючСвязи = ЗаказЭтапыГрафик.КлючСвязиЭтапы)
	|			И (ЗаказЭтапы.КлючСвязиПродукция = ЗаказЭтапыГрафик.КлючСвязиПродукция)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство.Продукция КАК ЗаказНаПроизводствоПродукция
	|		ПО (ЗаказНаПроизводствоПродукция.Ссылка = ЗаказЭтапыГрафик.Ссылка)
	|			И (ЗаказНаПроизводствоПродукция.КлючСвязи = ЗаказЭтапыГрафик.КлючСвязиПродукция)
	|ГДЕ
	|	(&Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ИЛИ ДокЗаказНаПроизводство.Организация = &Организация)
	|
	|	И (&Переработчик = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			ИЛИ ЗаказЭтапы.Партнер = &Переработчик
	|			ИЛИ ЗаказЭтапы.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка))
	|
	|	И (&Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|				ИЛИ ЗаказЭтапы.Подразделение = &Подразделение)
	|	И (&НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|				ИЛИ ДокЗаказНаПроизводство.НаправлениеДеятельности = &НаправлениеДеятельности)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказЭтапыГрафик.НачалоПредварительногоБуфера";

	Запрос.УстановитьПараметр("ТекущаяДата",   ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Ссылка",        Параметры.Ссылка);
	Запрос.УстановитьПараметр("Организация",   Параметры.Организация);
	Запрос.УстановитьПараметр("Склад",         Параметры.Склад);
	Запрос.УстановитьПараметр("Переработчик",  Параметры.Партнер);
	Запрос.УстановитьПараметр("Подразделение", Параметры.Подразделение);
	Запрос.УстановитьПараметр("НаправлениеДеятельности", Параметры.НаправлениеДеятельности);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	СтруктураПоиска = Новый Структура("Распоряжение,КодСтрокиЭтапыГрафик,Номенклатура,Характеристика");
	Пока Выборка.Следующий() Цикл
		
		ДанныеСтроки = ГрафикПроизводства.Добавить();
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, Выборка);
		
		СпецификацияСтрока = УправлениеДаннымиОбИзделияхКлиентСервер.ПредставлениеЭтапа(
										Выборка.СпецификацияПредставление,
										Выборка.ЭтапПредставление,
										Выборка.МногоэтапныйПроизводственныйПроцесс);
										
		ДанныеСтроки.РаспоряжениеПредставление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
														НСтр("ru='Заказ № %1 от %2 (%3)';uk='Замовлення № %1 від %2 (%3)'"),
														ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Выборка.НомерРаспоряжения, Ложь, Истина),
														Формат(Выборка.ДатаРаспоряжения, "ДЛФ=D"),
														СпецификацияСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

//-- НЕ УТКА