#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоступностьВидовРабочихЦентров.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ДоступностьВидовРабочихЦентров КАК ДоступностьВидовРабочихЦентров
		|ГДЕ
		|	(ДоступностьВидовРабочихЦентров.ВидРабочегоЦентра.Подразделение <> ДоступностьВидовРабочихЦентров.Подразделение
		|			ИЛИ НЕ ДоступностьВидовРабочихЦентров.ЭтоДвижениеЗаказаНаПроизводство
		|				И ДоступностьВидовРабочихЦентров.Регистратор ССЫЛКА Документ.ЗаказНаПроизводство
		|			ИЛИ НЕ ДоступностьВидовРабочихЦентров.ЭтоДвижениеМаршрутногоЛиста
		|				И ДоступностьВидовРабочихЦентров.Регистратор ССЫЛКА Документ.МаршрутныйЛистПроизводства
		|			ИЛИ НЕ ДоступностьВидовРабочихЦентров.ЭтоДвижениеВводаДоступности
		|				И ДоступностьВидовРабочихЦентров.Регистратор ССЫЛКА Документ.ДоступностьВидаРабочихЦентров
		|			ИЛИ НЕ ДоступностьВидовРабочихЦентров.ЭтоДвижениеВводаДоступности
		|				И ДоступностьВидовРабочихЦентров.Регистратор ССЫЛКА Документ.ДоступностьРабочихЦентров)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаИнтервалы.Ссылка
		|ИЗ
		|	Документ.ДоступностьРабочихЦентров.Интервалы КАК ТаблицаИнтервалы
		|ГДЕ
		|	ТаблицаИнтервалы.ВремяОкончания = ДАТАВРЕМЯ(1, 1, 1, 23, 59, 59)");

	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяРегистра());
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Регистраторы = Новый Массив;
	Регистраторы.Добавить("Документ.ЗаказНаПроизводство");
	Регистраторы.Добавить("Документ.МаршрутныйЛистПроизводства");
	Регистраторы.Добавить("Документ.ДоступностьВидаРабочихЦентров");
	Регистраторы.Добавить("Документ.ДоступностьРабочихЦентров");

	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазыУТ.ПерезаписатьДвиженияИзОчереди(Регистраторы, ПолноеИмяРегистра(), Параметры.Очередь);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Функция ПолноеИмяРегистра()
	
	Возврат "РегистрНакопления.ДоступностьВидовРабочихЦентров";
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли