#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс



// Вызывается в обработчике "ПередЗагрузкойВариантаНаСервере"
//   формы отчета до выполнения кода формы.
//
// Подробнее - см. ОтчетыПереопределяемый.ПередЗагрузкойВариантаНаСервере
//
Процедура ПередЗагрузкойВариантаНаСервере(ЭтаФорма, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ПараметрВидЦены = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НовыеПользовательскиеНастройкиКД, "ВидЦены");
	ВидЦены = ПараметрВидЦены.Значение;
	Если Не ЗначениеЗаполнено(ВидЦены) Тогда
		ВидЦены = Константы.ВидЦеныПлановойСтоимостиМатериаловРабот.Получить();
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеПользовательскиеНастройкиКД, "ВидЦены", ВидЦены);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
