#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Настройки вариантов этого отчета.
// Подробнее - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	ПодсистемаЗарплата = Метаданные.НайтиПоПолномуИмени("Подсистема.Зарплата.Подсистема.ВыплатыПеречисления");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КнигаУчетаДепонентов");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьНачислениеЗарплаты");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.ГруппироватьПоОтчету = Ложь;
	ОписаниеВарианта.Размещение.Очистить();
	ОписаниеВарианта.Размещение.Вставить(ПодсистемаЗарплата);
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "АнализДепонированнойЗарплаты");
	ОписаниеВарианта.Описание = НСтр("ru='Состояние расчетов организации с депонентами: перечень депонентов на начало,
    |образовавшиеся депоненты, месяца выплаты для каждого депонента.'
    |;uk='Стан розрахунків організації з депонентами: перелік депонентів на початок,
    |депоненти, які утворилися, місяця виплати для кожного депонента.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьНачислениеЗарплаты");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Ложь;
	ОписаниеВарианта.ГруппироватьПоОтчету = Ложь;
	ОписаниеВарианта.Размещение.Очистить();
	ОписаниеВарианта.Размещение.Вставить(ПодсистемаЗарплата);
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СписокДепонентов");
	ОписаниеВарианта.Описание = НСтр("ru='Сводный список депонированных сумм и выплат по сотрудникам организации.';uk='Зведений список депонованих сум і виплат співробітникам організації.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьНачислениеЗарплаты");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Ложь;
	ОписаниеВарианта.ГруппироватьПоОтчету = Ложь;
	ОписаниеВарианта.Размещение.Очистить();
	ОписаниеВарианта.Размещение.Вставить(ПодсистемаЗарплата);
	
	ПодсистемаРегл = Метаданные.НайтиПоПолномуИмени("Подсистема.РегламентированныйУчет.Подсистема.БухгалтерскийУчет");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КнигаУчетаДепонентовРегл");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеИспользоватьРасчетЗарплатыРасширенная");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.ГруппироватьПоОтчету = Ложь;
	ОписаниеВарианта.Размещение.Очистить();
	ОписаниеВарианта.Размещение.Вставить(ПодсистемаРегл);
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "АнализДепонированнойЗарплатыРегл");
	ОписаниеВарианта.Описание = НСтр("ru='Состояние расчетов организации с депонентами: перечень депонентов на начало,
    |образовавшиеся депоненты, месяца выплаты для каждого депонента.'
    |;uk='Стан розрахунків організації з депонентами: перелік депонентів на початок,
    |депоненти, які утворилися, місяця виплати для кожного депонента.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеИспользоватьРасчетЗарплатыРасширенная");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Ложь;
	ОписаниеВарианта.ГруппироватьПоОтчету = Ложь;
	ОписаниеВарианта.Размещение.Очистить();
	ОписаниеВарианта.Размещение.Вставить(ПодсистемаРегл);
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СписокДепонентовРегл");
	ОписаниеВарианта.Описание = НСтр("ru='Сводный список депонированных сумм и выплат по сотрудникам организации.';uk='Зведений список депонованих сум і виплат співробітникам організації.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеИспользоватьРасчетЗарплатыРасширенная");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Ложь;
	ОписаниеВарианта.ГруппироватьПоОтчету = Ложь;
	ОписаниеВарианта.Размещение.Очистить();
	ОписаниеВарианта.Размещение.Вставить(ПодсистемаРегл);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли