
&НаКлиенте
Процедура Сохранить(Команда)

	Если ЗаписатьНастройкуЗначенийПоказателей() Тогда
		Оповестить("Установка_НастройкаЗначенийПоказателейДляРаспределенияРасходов");
		Структура = Новый Структура("Подразделение, Показатель, ЗначениеПоказателя, Период",
		Подразделение,
		Показатель,
		ЗначениеПоказателя,
		Период);
		Закрыть(Структура);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗаписатьНастройкуЗначенийПоказателей()
	
	Попытка
		МенеджерЗаписи = РегистрыСведений.ЗначенияПоказателейДляРаспределенияРасходов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = Период;
		МенеджерЗаписи.Подразделение = Подразделение;
		МенеджерЗаписи.Показатель = Показатель;
		МенеджерЗаписи.ЗначениеПоказателя = ЗначениеПоказателя;
		МенеджерЗаписи.Записать();
	Исключение
		Возврат ЛОЖЬ;
	КонецПопытки;
	
	Возврат ИСТИНА;
	
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Если Параметры = Неопределено Тогда
		Отказ = ИСТИНА;
	Иначе
		Подразделение = Параметры.Подразделение;
		Показатель = Параметры.Показатель;
		ЗначениеПоказателя = Параметры.ЗначениеПоказателя;
		Период = Параметры.ДействуетС;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДействуетСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("МесяцСтрокаНачалоВыбораЗавершение", ЭтотОбъект);
	ОбщегоНазначенияУТКлиент.НачалоВыбораПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, Период, ЭтаФорма, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокаНачалоВыбораЗавершение(ВыбранныйПериод, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйПериод <> Неопределено Тогда
		Период = ВыбранныйПериод;
		МесяцСтрока = ОбщегоНазначенияУТКлиент.ПолучитьПредставлениеПериодаРегистрации(Период);

	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДействуетСРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ОбщегоНазначенияУТКлиент.РегулированиеПредставленияПериодаРегистрации(Направление, СтандартнаяОбработка, Период, МесяцСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МесяцСтрока = ОбщегоНазначенияУТКлиент.ПолучитьПредставлениеПериодаРегистрации(Период);;
	
КонецПроцедуры




