#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов


// Добавляет новый показатель расчета зарплаты, 
// используемый для ввода оперативных данных.
//
// Параметры:
//	Идентификатор - строковый идентификатор показателя, 
//		используется в формуле начислений, 
//		а также для идентификации показателя в исходном коде.
//	Представление - пользовательское представление показателя.
//	КраткоеПредставление - пользовательское представление, 
//		используемое для заголовков колонок в документах ввода.
//	Валюта - валюта показателя, по умолчанию - валюта учета.
//	Точность - точность значения показателя по умолчанию - целое число.
//
// Возвращаемое значение:
//	Ссылка на созданный показатель.
//
Функция СоздатьОперативныйПоказатель(Идентификатор, Представление, 
			КраткоеПредставление = Неопределено, Валюта = Неопределено, Точность = Неопределено) Экспорт
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	
	ОписаниеПоказателя.Идентификатор = Идентификатор;
	ОписаниеПоказателя.Наименование = Представление;
	ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
	ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Разовое;
	ОписаниеПоказателя.СпособВводаЗначений = Перечисления.СпособыВводаЗначенийПоказателейРасчетаЗарплаты.НакапливаетсяПоОтдельнымЗначениям;
	ОписаниеПоказателя.Предопределенный = Ложь;
	
	Если КраткоеПредставление = Неопределено Тогда
		КраткоеПредставление = Представление;
	КонецЕсли;
	ОписаниеПоказателя.КраткоеНаименование = КраткоеПредставление;
	
	Если Точность <> Неопределено Тогда
		ОписаниеПоказателя.Точность = Точность;
	КонецЕсли;
	
	Возврат ЗаписатьПоказатель(ОписаниеПоказателя);
	
КонецФункции

// Показатели, имеющие отношение к учету времени.
// Возвращаемое значение:
//  Массив - список показателей, имеющих отношение к учету времени.
//
Функция ПоказателиУчетаВремени() Экспорт
	
	Показатели = Новый Массив;
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ВремяВДнях"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ВремяВЧасах"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ВремяВДняхЧасах"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ДнейЧасовВыходногоПособия"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.КалендарныеДни"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.КалендарныеДниБезПраздников"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.КоличествоДнейОтпуска"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.НормаВремениВДнях"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.НормаДней"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.НормаВремениВЧасах"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ОтработаноДней"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ОтработаноЧасов"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ОтработаноСверхурочно"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ОтработаноСверхурочноВПределах2Часов"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ДоляНеполногоРабочегоВремени"));

	Возврат Показатели;
	
КонецФункции

// Показатели расчета времени по часам.
// Возвращаемое значение:
//  Массив - список показателей расчета времени по часам.
//
Функция ПоказателиУчетаВремениВЧасах() Экспорт
	
	Показатели = Новый Массив;
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ВремяВЧасах"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.НормаВремениВЧасах"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ОтработаноЧасов"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ОтработаноСверхурочно"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ОтработаноСверхурочноВПределах2Часов"));
	
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.СреднечасовойЗаработок"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.СтоимостьЧаса"));

	Возврат Показатели;
	
КонецФункции

// Предопределенные показатели, значения которых рассчитываются автоматически 
// именно на этапе расчета, а не на этапе заполнения.
// Возвращаемое значение:
//  Массив - список показателей, значения которых рассчитываются автоматически на этапе расчета.
// 
Функция ПоказателиОпределяемыеПриРасчете() Экспорт
	
	Показатели = Новый Массив;
	
	// Это все показатели учета времени.
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Показатели, ПоказателиУчетаВремени());
	
	// И некоторые специализированные.
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.РасчетнаяБаза"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.СдельныйЗаработок"));

	Возврат Показатели;
	
КонецФункции

// Предопределенные показатели, характеризующие расчет по среднему заработку
// Возвращаемое значение:
//  Массив - список показателей, характеризующих расчет по среднему заработку.
//
Функция ПоказателиОбщегоСреднегоЗаработка() Экспорт
	Показатели = Новый Массив;
	                                                                                                                             
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.СреднедневнойЗаработок"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.СреднечасовойЗаработок"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.СреднийЗаработокОбщий"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.СреднийЗаработокОтпуск"));

	Возврат Показатели;
	
КонецФункции

// Предопределенные показатели, расчет которых требует значения совокупной ставки
// Возвращаемое значение:
//  Массив - список показателей, расчет которых требует значения совокупной ставки.
//
Функция ПоказателиРасчетПоСовокупнойСтавке() Экспорт
	
	Показатели = Новый Массив;
	
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.СтоимостьЧаса"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.СтоимостьДня"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.СтоимостьДняЧаса"));

	Возврат Показатели;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Формирует значения типа ОписаниеТипов, содержащее тип значения показателя расчета зарплаты.
//
Функция ОписаниеТиповЗначенияПоказателяРасчетаЗарплаты() Экспорт
	
	Возврат Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ЗначениеПоказателяРасчетаЗарплаты.Тип);
	
КонецФункции

// Показатели, определяемые в зависимости от территории и/или условий труда.
//
Функция ПоказателиПоТерриториямУсловиямТруда() Экспорт
	Возврат ЗарплатаКадрыРасширенныйПовтИсп.ПоказателиПоТерриториямУсловиямТруда();
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ПервоначальногоЗаполненияИОбновленияИБ

// Процедура заполняет справочник показателей т.н. псевдопредопределенными элементами, 
// идентифицируемыми из кода
//
Процедура СоздатьПоказателиПоНастройкам(НастройкиРасчетаЗарплаты = Неопределено, ПараметрыПланаВидовРасчета = Неопределено) Экспорт
	
	Если НастройкиРасчетаЗарплаты = Неопределено Тогда
		НастройкиРасчетаЗарплаты = РасчетЗарплатыРасширенный.НастройкиРасчетаЗарплаты();
	КонецЕсли;
	
	Если ПараметрыПланаВидовРасчета = Неопределено Тогда
		ПараметрыПланаВидовРасчета = РасчетЗарплатыРасширенный.ОписаниеПараметровПланаВидовРасчета();
	КонецЕсли;
	ПараметрыПоказателей = ПараметрыПланаВидовРасчета.ПараметрыПоказателей;
	
	СозданныеЭлементы = ПараметрыПланаВидовРасчета.СсылкиПоказателиРасчетаЗарплаты;
	Если СозданныеЭлементы = Неопределено Тогда 
		СозданныеЭлементы = СсылкиПоказателиРасчетаЗарплатыНачальнойНастройкиПрограммы();
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	// Безусловно создаем показатели.
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "ВремяВДнях";
	ОписаниеПоказателя.Наименование = НСтр("ru='Время в днях';uk='Час в днях'");
	ОписаниеПоказателя.ОтображатьВДокументахНачисления = Ложь;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "ВремяВДняхЧасах";
	ОписаниеПоказателя.Наименование = НСтр("ru='Время в днях (или часах)';uk='Час в днях (або годинах)'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Время в днях (часах)';uk='Час в днях (годинах)'");
	ОписаниеПоказателя.ОтображатьВДокументахНачисления = Ложь;
	ОписаниеПоказателя.Точность = 3;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "НормаДнейПоГрафикуПолногоРабочегоВремени";
	ОписаниеПоказателя.ИмяПредопределенныхДанных = "НормаВремениВДнях";
	ОписаниеПоказателя.Наименование = НСтр("ru='Норма дней по графику полного рабочего времени';uk='Норма днів за графіком повного робочого часу'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Норма дн. полн.граф.';uk='Норма дн. повн.граф.'");
	ОписаниеПоказателя.ОтображатьВДокументахНачисления = Ложь;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
	СоздатьПоказательНормаДней();
	СоздатьПоказательДоляНеполногоРабочегоВремени();
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "КалендарныеДни";
	ОписаниеПоказателя.Наименование = НСтр("ru='Календарные дни';uk='Календарні дні'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Календ. дн.';uk='Календ. дн.'");
	ОписаниеПоказателя.ОтображатьВДокументахНачисления = Ложь;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "КалендарныеДниМесяца";
	ОписаниеПоказателя.Наименование = НСтр("ru='Календарные дни месяца';uk='Календарні дні місяця'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Календ. дн. (мес)';uk='Календ. дн. (міс)'");
	ОписаниеПоказателя.ОтображатьВДокументахНачисления = Ложь;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "КалендарныеДниБезПраздников";
	ОписаниеПоказателя.Наименование = НСтр("ru='Календарные дни без праздников';uk='Календарні дні без свят'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Кал. дн. без праздн.';uk='Кал. дн. без святк.'");
	ОписаниеПоказателя.ОтображатьВДокументахНачисления = Ложь;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "МРОТ";
	ОписаниеПоказателя.Наименование = НСтр("ru='МРОТ';uk='МРОТ'");
	ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
	ОписаниеПоказателя.НазначениеПоказателя = Перечисления.НазначенияПоказателейРасчетаЗарплаты.ДляОрганизации;
	ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "МЧТС";
	ОписаниеПоказателя.Наименование = НСтр("ru='МЧТС';uk='МЧТС'");
	ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
	ОписаниеПоказателя.НазначениеПоказателя = Перечисления.НазначенияПоказателейРасчетаЗарплаты.ДляОрганизации;
	ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
	ЗаписатьПоказатель(ОписаниеПоказателя);


	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "ПрожиточныйМинимум";
	ОписаниеПоказателя.Наименование = НСтр("ru='Прожиточный минимум';uk='Прожитковий мінімум'");
	ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
	ОписаниеПоказателя.НазначениеПоказателя = Перечисления.НазначенияПоказателейРасчетаЗарплаты.ДляОрганизации;
	ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
	ЗаписатьПоказатель(ОписаниеПоказателя);	
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "КоэффициентИндексации";
	ОписаниеПоказателя.Наименование = НСтр("ru='Коэффициент индексации';uk='Індекс'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Коэф. индексации';uk='Коеф. індексації'");
	ОписаниеПоказателя.Точность = 3;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "РасчетнаяБаза";
	ОписаниеПоказателя.Наименование = НСтр("ru='Расчетная база';uk='Розрахункова база'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Расч. база';uk='Розрах. база'");
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "СреднийЗаработокОбщий";
	ОписаниеПоказателя.Наименование = НСтр("ru='Средний заработок (общий)';uk='Середній заробіток (загальний)'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Ср. заработок (общ.)';uk='Ср. заробіток (заг.)'");
	ОписаниеПоказателя.Точность = 2;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "СреднийЗаработокОтпуск";
	ОписаниеПоказателя.Наименование = НСтр("ru='Средний заработок (отпуск)';uk='Середній заробіток (відпуск)'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Ср. заработок (отп.)';uk='Ср. заробіток (отп.)'");
	ОписаниеПоказателя.Точность = 2;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
	СоздатьПоказательСреднедневнойЗаработок();
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "СреднийЗаработокФСС";
	ОписаниеПоказателя.Наименование = НСтр("ru='Средний заработок ФСС';uk='Середній заробіток ФСС'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Ср. заработок (ФСС)';uk='Ср. заробіток (ФСС)'");
	ОписаниеПоказателя.Точность = 2;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
	// Оклад
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "Оклад";
	ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
	ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
	ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
	ОписаниеПоказателя.Точность = ПараметрыПоказателей.ОкладТарифТочность;
	ОписаниеПоказателя.ВидТарифнойСтавки = Перечисления.ВидыТарифныхСтавок.МесячнаяТарифнаяСтавка;
	ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
	// Тарифная ставка дневная
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "ТарифнаяСтавкаДневная";
	ОписаниеПоказателя.Наименование = НСтр("ru='Тарифная ставка (дневная)';uk='Тарифна ставка (денна)'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Дневн. тариф';uk='Ден. тариф'");
	ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
	ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
	ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
	ОписаниеПоказателя.Точность = ПараметрыПоказателей.ОкладТарифТочность;
	ОписаниеПоказателя.ВидТарифнойСтавки = Перечисления.ВидыТарифныхСтавок.ДневнаяТарифнаяСтавка;
	ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
	ЗаписатьПоказатель(ОписаниеПоказателя);

	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "СтоимостьДня";
	ОписаниеПоказателя.Наименование = НСтр("ru='Стоимость дня';uk='Вартість дня'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Дневн. стоим.';uk='Ден. варт.'");
	ЗаписатьПоказатель(ОписаниеПоказателя);

	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "СтоимостьЧаса";
	ОписаниеПоказателя.Наименование = НСтр("ru='Стоимость часа';uk='Вартість години'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Час. стоим.';uk='Годину. стоїмо.'");
	ОписаниеПоказателя.Точность = 3;
	ЗаписатьПоказатель(ОписаниеПоказателя);

	СоздатьПоказательСтоимостьДняЧаса();
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "ОтработаноДней";
	ОписаниеПоказателя.Наименование = НСтр("ru='Отработано дней, в т.ч. сверхурочно';uk='Відпрацьовано днів, в т. ч. понаднормово'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Отраб. (дни)';uk='Відпрац. (дні)'");
	ОписаниеПоказателя.ОтображатьВДокументахНачисления = Ложь;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
	// Натуральная оплата
	Если ПараметрыПланаВидовРасчета.НатуральныеДоходы.ОплатаТрудаВНатуральнойФорме Тогда
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "НатуральнаяОплата";
		ОписаниеПоказателя.Наименование = НСтр("ru='Натуральная оплата';uk='Натуральна оплата'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Натур. оплата';uk='Натур. оплата'");
		ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.Точность = 0;
		ОписаниеПоказателя.Предопределенный = Ложь;
		ОписаниеПоказателя.ВидТарифнойСтавки = Перечисления.ВидыТарифныхСтавок.МесячнаяТарифнаяСтавка;
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
	Иначе
		НачальнаяНастройкаОтключитьИспользованиеПоказателя(СозданныеЭлементы, "НатуральнаяОплата");
	КонецЕсли;
	
	// Натуральный доход
	Если НастройкиРасчетаЗарплаты.ИспользоватьДоходыВНатуральнойФорме Тогда
		СоздатьПоказательНатуральныйДоход();
	Иначе
		ОтключитьИспользованиеПредопределенногоЭлемента("НатуральныйДоход");
	КонецЕсли;
	
	// Совмещение
	Если НастройкиРасчетаЗарплаты.ИспользоватьСовмещениеПрофессийДолжностей Тогда
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "РазмерДоплатыЗаСовмещение";
		ОписаниеПоказателя.Наименование = НСтр("ru='Размер доплаты за совмещение';uk='Розмір доплати за сумісництво'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='За совмещ.';uk='За сумісн.'");
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.Точность = 2;
		ЗаписатьПоказатель(ОписаниеПоказателя);
	Иначе
		ОтключитьИспользованиеПредопределенногоЭлемента("РазмерДоплатыЗаСовмещение");
	КонецЕсли;
	
	// Сверхурочные часы
	Если НастройкиРасчетаЗарплаты.ИспользоватьОплатуСверхурочных Тогда
		// Сверхурочно всего
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "ОтработаноСверхурочно";
		ОписаниеПоказателя.Наименование = НСтр("ru='Отработано сверхурочно';uk='Відпрацьовано понаднормово'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Сверхурочно (всего)';uk='Понаднормово (всього)'");
		ЗаписатьПоказатель(ОписаниеПоказателя);
		// Сверхурочно в пределах 2 часов.
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "ОтработаноСверхурочноВПределах2Часов";
		ОписаниеПоказателя.Наименование = НСтр("ru='Отработано сверхурочно в пределах 2 часов';uk='Відпрацьовано понаднормово в межах 2 годин'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Сверхурочно (до 2 ч)';uk='Понаднормово (до 2 год)'");
		ЗаписатьПоказатель(ОписаниеПоказателя);
	Иначе
		ОтключитьИспользованиеПредопределенногоЭлемента("ОтработаноСверхурочно");
		ОтключитьИспользованиеПредопределенногоЭлемента("ОтработаноСверхурочноВПределах2Часов");
	КонецЕсли;
	
	СоздатьПоказателиСуммированногоУчета();
	
	// Сдельный заработок
	Если НастройкиРасчетаЗарплаты.ИспользоватьСдельныйЗаработок Тогда
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "СдельныйЗаработок";
		ОписаниеПоказателя.Наименование = НСтр("ru='Сдельный заработок';uk='Відрядний заробіток'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Сдельно';uk='Відрядно'");
		ОписаниеПоказателя.Точность = 2;
		ОписаниеПоказателя.СпособВводаЗначений = Перечисления.СпособыВводаЗначенийПоказателейРасчетаЗарплаты.НакапливаетсяПоОтдельнымЗначениям;
		ЗаписатьПоказатель(ОписаниеПоказателя);
	Иначе
		ОтключитьИспользованиеПредопределенногоЭлемента("СдельныйЗаработок");
	КонецЕсли;
	
	// Ежемесячная премия
	ПараметрыПремия = ПараметрыПланаВидовРасчета.ЕжемесячнаяПремия;
	Если ПараметрыПремия.ИспользоватьПремиюПроцентом Тогда
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		ОписаниеПоказателя.Идентификатор = "ПроцентЕжемесячнойПремии";
		ОписаниеПоказателя.Наименование = НСтр("ru='Процент ежемесячной премии';uk='Відсоток щомісячної премії'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='% прем.';uk='% прем.'");
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.Точность = 2;
		ОписаниеПоказателя.Предопределенный = Ложь;
		ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
	Иначе 
		НачальнаяНастройкаОтключитьИспользованиеПоказателя(СозданныеЭлементы, "ПроцентЕжемесячнойПремии");
	КонецЕсли;
	
	Если ПараметрыПремия.ИспользоватьПремиюСуммой Тогда
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		ОписаниеПоказателя.Идентификатор = "РазмерЕжемесячнойПремии";
		ОписаниеПоказателя.Наименование = НСтр("ru='Сумма ежемесячной премии';uk='Сума щомісячної премії'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Сумма прем.';uk='Сума прем.'");
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.Точность = 2;
		ОписаниеПоказателя.Предопределенный = Ложь;
		ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
	Иначе 
		НачальнаяНастройкаОтключитьИспользованиеПоказателя(СозданныеЭлементы, "РазмерЕжемесячнойПремии");
	КонецЕсли;
	
	// Годовая премия
	ПараметрыПремия = ПараметрыПланаВидовРасчета.ГодоваяПремия;
	Если ПараметрыПремия.ИспользоватьПремиюСуммой И ПараметрыПремия.НачисляетсяПоЗначениюПоказателей Тогда
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		ОписаниеПоказателя.Идентификатор = "РазмерГодовойПремии";
		ОписаниеПоказателя.Наименование = НСтр("ru='Сумма годовой премии';uk='Сума річної премії'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Сумма прем.';uk='Сума прем.'");
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
		ОписаниеПоказателя.Точность = 2;
		ОписаниеПоказателя.Предопределенный = Ложь;
		ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
	Иначе 
		НачальнаяНастройкаОтключитьИспользованиеПоказателя(СозданныеЭлементы, "РазмерГодовойПремии");
	КонецЕсли;
	
	Если ПараметрыПремия.ИспользоватьПремиюПроцентом Тогда
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		ОписаниеПоказателя.Идентификатор = "ПроцентГодовойПремии";
		ОписаниеПоказателя.Наименование = НСтр("ru='Процент годовой премии';uk='Відсоток річної премії'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='% прем.';uk='% прем.'");
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.Точность = 2;
		ОписаниеПоказателя.Предопределенный = Ложь;
		Если ПараметрыПремия.НачисляетсяВМесяцах Тогда
			ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ИначеЕсли ПараметрыПремия.НачисляетсяОтдельнымДокументом Тогда 
			ОписаниеПоказателя.СпособВводаЗначений = Перечисления.СпособыВводаЗначенийПоказателейРасчетаЗарплаты.ВводитсяПриРасчете;
		КонецЕсли;
		ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
	Иначе 
		НачальнаяНастройкаОтключитьИспользованиеПоказателя(СозданныеЭлементы, "ПроцентГодовойПремии");
	КонецЕсли;
	
	// Квартальная премия
	ПараметрыПремия = ПараметрыПланаВидовРасчета.КвартальнаяПремия;
	Если ПараметрыПремия.ИспользоватьПремиюСуммой И ПараметрыПремия.НачисляетсяПоЗначениюПоказателей Тогда
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		ОписаниеПоказателя.Идентификатор = "РазмерКвартальнойПремии";
		ОписаниеПоказателя.Наименование = НСтр("ru='Сумма квартальной премии';uk='Сума квартальної премії'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Сумма прем.';uk='Сума прем.'");
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
		ОписаниеПоказателя.Точность = 2;
		ОписаниеПоказателя.Предопределенный = Ложь;
		ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
	Иначе 
		НачальнаяНастройкаОтключитьИспользованиеПоказателя(СозданныеЭлементы, "РазмерКвартальнойПремии");
	КонецЕсли;
	
	Если ПараметрыПремия.ИспользоватьПремиюПроцентом Тогда
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		ОписаниеПоказателя.Идентификатор = "ПроцентКвартальнойПремии";
		ОписаниеПоказателя.Наименование = НСтр("ru='Процент квартальной премии';uk='Відсоток квартальної премії'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='% прем.';uk='% прем.'");
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.Точность = 2;
		ОписаниеПоказателя.Предопределенный = Ложь;
		Если ПараметрыПремия.НачисляетсяВМесяцах Тогда
			ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ИначеЕсли ПараметрыПремия.НачисляетсяОтдельнымДокументом Тогда 
			ОписаниеПоказателя.СпособВводаЗначений = Перечисления.СпособыВводаЗначенийПоказателейРасчетаЗарплаты.ВводитсяПриРасчете;
		КонецЕсли;
		ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
	Иначе 
		НачальнаяНастройкаОтключитьИспользованиеПоказателя(СозданныеЭлементы, "ПроцентКвартальнойПремии");
	КонецЕсли;
	
	// Разовая премия
	ПараметрыПремия = ПараметрыПланаВидовРасчета.РазоваяПремия;
	Если ПараметрыПремия.ИспользоватьПремиюСуммой И ПараметрыПремия.НачисляетсяПоЗначениюПоказателей Тогда 
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		ОписаниеПоказателя.Идентификатор = "РазмерРазовойПремии";
		ОписаниеПоказателя.Наименование = НСтр("ru='Размер разовой премии';uk='Розмір разової премії'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Сумма прем.';uk='Сума прем.'");
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
		ОписаниеПоказателя.Предопределенный = Ложь;
		ОписаниеПоказателя.Точность = 2;
		ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
	Иначе 
		НачальнаяНастройкаОтключитьИспользованиеПоказателя(СозданныеЭлементы, "РазмерРазовойПремии");
	КонецЕсли;
	
	Если ПараметрыПремия.ИспользоватьПремиюПроцентом Тогда 
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		ОписаниеПоказателя.Идентификатор = "ПроцентРазовойПремии";
		ОписаниеПоказателя.Наименование = НСтр("ru='Процент разовой премии';uk='Відсоток разової премії'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='% прем.';uk='% прем.'");
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.Предопределенный = Ложь;
		ОписаниеПоказателя.Точность = 2;
		Если ПараметрыПремия.НачисляетсяОтдельнымДокументом Тогда 
			ОписаниеПоказателя.СпособВводаЗначений = Перечисления.СпособыВводаЗначенийПоказателейРасчетаЗарплаты.ВводитсяПриРасчете;
		КонецЕсли;
		ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
	Иначе 
		НачальнаяНастройкаОтключитьИспользованиеПоказателя(СозданныеЭлементы, "ПроцентРазовойПремии");
	КонецЕсли;
	
	// Выручка от реализации
	Если ПараметрыПланаВидовРасчета.ИспользоватьДоплатуЗаВыручкуОтРеализации Тогда
		// Выручка
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		ОписаниеПоказателя.Идентификатор = "Выручка";
		ОписаниеПоказателя.Наименование = НСтр("ru='Выручка';uk='Виторг'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Выручка';uk='Виторг'");
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
		ОписаниеПоказателя.Предопределенный = Ложь;
		ОписаниеПоказателя.Точность = 2;
		ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
		
		// Процент доплаты
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		ОписаниеПоказателя.Идентификатор = "ПроцентДоплатыЗаВыручку";
		ОписаниеПоказателя.Наименование = НСтр("ru='Процент доплаты за выручку';uk='Відсоток доплати за виторг'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='% за выручку';uk='% за виторг'");
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.НазначениеПоказателя = Перечисления.НазначенияПоказателейРасчетаЗарплаты.ДляОрганизации;
		ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Числовой;
		ОписаниеПоказателя.Точность = 2;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.Предопределенный = Ложь;
		ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
	Иначе 
		НачальнаяНастройкаОтключитьИспользованиеПоказателя(СозданныеЭлементы, "Выручка");
		НачальнаяНастройкаОтключитьИспользованиеПоказателя(СозданныеЭлементы, "ПроцентДоплатыЗаВыручку");
	КонецЕсли;
	
	// Выполнение плана
	Если ПараметрыПланаВидовРасчета.ИспользоватьДоплатуЗаВыполнениеПлана Тогда
		// Выполнение плана
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		ОписаниеПоказателя.Идентификатор = "ВыполнениеПлана";
		ОписаниеПоказателя.Наименование = НСтр("ru='Выполнение плана';uk='Виконання плану'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Вып. плана';uk='Вик. плану'");
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Числовой;
		ОписаниеПоказателя.Точность = 2;
		ОписаниеПоказателя.Предопределенный = Ложь;
		ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
		
		// План
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "План";
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		ОписаниеПоказателя.Наименование = НСтр("ru='План';uk='План'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='План';uk='План'");
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.НазначениеПоказателя = Перечисления.НазначенияПоказателейРасчетаЗарплаты.ДляПодразделения;
		ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Числовой;
		ОписаниеПоказателя.Точность = 2;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.Предопределенный = Ложь;
		ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
	Иначе 
		НачальнаяНастройкаОтключитьИспользованиеПоказателя(СозданныеЭлементы, "ВыполнениеПлана");
		НачальнаяНастройкаОтключитьИспользованиеПоказателя(СозданныеЭлементы, "План");
	КонецЕсли;
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "КоличествоДнейОтпуска";
	ОписаниеПоказателя.Наименование = НСтр("ru='Количество дней отпуска';uk='Кількість днів відпустки'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Дней отпуска';uk='Днів відпустки'");
	ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Истина;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "КоличествоДнейКомпенсации";
	ОписаниеПоказателя.Наименование = НСтр("ru='Количество дней компенсации отпуска';uk='Кількість днів компенсації відпустки'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Дней компенсац.';uk='Днів компенсац.'");
	ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Истина;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "ДнейЧасовВыходногоПособия";
	ОписаниеПоказателя.Наименование = НСтр("ru='Количество оплачиваемых дней (часов) выходного пособия';uk='Кількість оплачуваних днів (годин) вихідної допомоги'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Дней(часов) вых. пособия.';uk='Днів(годин) вих. допомоги.'");
	ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Истина;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "РазмерПособияПоУходуЗаРебенкомДоТрехЛет";
	ОписаниеПоказателя.Наименование = НСтр("ru='Размер пособия по уходу за ребенком до трех лет';uk='Розмір допомоги по догляду за дитиною до трьох років'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Пособие до трех лет';uk='Допомога до трьох років'");
	ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
	ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "ПроцентОплатыПоСреднему";
	ОписаниеПоказателя.Наименование = НСтр("ru='Процент оплаты по среднему заработку';uk='Відсоток оплати по середньому заробітку'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='% оплаты по сред.';uk='% оплати за серед..'");
	ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Истина;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "ПроцентДоплатыЗаДниНетрудоспособности";
	ОписаниеПоказателя.Наименование = НСтр("ru='Процент доплаты за дни нетрудоспособности';uk='Відсоток доплати за дні непрацездатності'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='% доплаты до сред.';uk='% доплати до серед.'");
	ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Истина;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
	
	СоздатьПоказателиДляНадбавок(ПараметрыПланаВидовРасчета);
	
	СоздатьПоказателиДляКомпенсационныхВыплат(ПараметрыПланаВидовРасчета);
	
	СоздатьПоказателиДляУчетаВремениСотрудниковВЧасах(НастройкиРасчетаЗарплаты, ПараметрыПланаВидовРасчета);
	
	СоздатьПоказательКоэффициентИндексацииСреднегоЗаработка();
	
	// Процент профсоюзных взносов.
	Если НастройкиРасчетаЗарплаты.ИспользоватьПрофсоюзныеВзносы Тогда
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "ПроцентПрофсоюзныхВзносов";
		ОписаниеПоказателя.Наименование = НСтр("ru='Процент профсоюзных взносов';uk='Відсоток профспілкових внесків'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='% профвзносов';uk='% профвнесків'");
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.Точность = 2;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ЗаписатьПоказатель(ОписаниеПоказателя);
	Иначе
		ОтключитьИспользованиеПредопределенногоЭлемента("ПроцентПрофсоюзныхВзносов");
	КонецЕсли;
	
	// Тарифные группы, базовый тариф группы.
	СоздатьПоказательБазовыйТарифГруппы();
	
	СоздатьПоказательКвалификационнаяНадбавка(НастройкиРасчетаЗарплаты);		
	СоздатьПоказательДолжностнаяНадбавка(НастройкиРасчетаЗарплаты);	
	СоздатьПоказательОкладПоДолжности(ПараметрыПланаВидовРасчета);
	СоздатьПоказательДневнойТарифПоДолжности(ПараметрыПланаВидовРасчета);
	СоздатьПоказательНадбавкаЗаВредность(НастройкиРасчетаЗарплаты);
	
	// Размер надбавки за квалификацию
	Если НастройкиРасчетаЗарплаты.ИспользоватьТарифныеСеткиПриРасчетеЗарплаты Тогда
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "РазмерДоплатыЗаКвалификацию";
		ОписаниеПоказателя.Наименование = НСтр("ru='Размер доплаты за квалификацию';uk='Розмір доплати за кваліфікацію'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Доплата за квалиф.';uk='Доплата за кваліф.'");
		ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.Точность = ПараметрыПоказателей.ОкладТарифТочность;
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		ЗаписатьПоказатель(ОписаниеПоказателя);
	Иначе
		ОтключитьИспользованиеПредопределенногоЭлемента("РазмерДоплатыЗаКвалификацию");
	КонецЕсли;
	
	// Размер дневной надбавки за квалификацию
	Если НастройкиРасчетаЗарплаты.ИспользоватьТарифныеСеткиПриРасчетеЗарплаты Тогда
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "РазмерДневнойДоплатыЗаКвалификацию";
		ОписаниеПоказателя.Наименование = НСтр("ru='Размер дневной доплаты за квалификацию';uk='Розмір денної доплати за кваліфікацію'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Дн. допл. за квалиф.';uk='Дн. допл. за кваліф.'");
		ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.Точность = ПараметрыПоказателей.ОкладТарифТочность;
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		ЗаписатьПоказатель(ОписаниеПоказателя);
	Иначе
		ОтключитьИспользованиеПредопределенногоЭлемента("РазмерДневнойДоплатыЗаКвалификацию");
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.РасчетДенежногоСодержания") Тогда 
		Модуль = ОбщегоНазначения.ОбщийМодуль("РасчетДенежногоСодержания");
		Модуль.СоздатьПоказателиНачисленийДенежногоСодержания(ПараметрыПланаВидовРасчета);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.РасчетДенежногоДовольствия") Тогда 
		Модуль = ОбщегоНазначения.ОбщийМодуль("РасчетДенежногоДовольствия");
		Модуль.СоздатьПоказателиНачисленийДенежногоДовольствия(ПараметрыПланаВидовРасчета);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КлючевыеПоказателиЭффективности") Тогда 
		Модуль = ОбщегоНазначения.ОбщийМодуль("КлючевыеПоказателиЭффективности");
		Модуль.СоздатьПоказательЭффективностиСотрудника();
	КонецЕсли;	
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОбразовательныеУчреждения") Тогда 
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОбразовательныеУчреждения");
		Модуль.СоздатьПоказателиОбразовательныхУчреждений(ПараметрыПланаВидовРасчета);
	КонецЕсли;	
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	ОбновитьПоказателиПредопределенныхСпособовРасчета();
	
КонецПроцедуры

Процедура ЗаполнитьШкалуСтажаНадбавкиЗаВыслугуЛет(Показатель, КатегорииСтажа) Экспорт

	Если КатегорииСтажа = Перечисления.КатегорииСтажа.ВыслугаЛетНаГосударственнойСлужбе Тогда
		
		ПоказательОбъект = Показатель.ПолучитьОбъект();
		
		ПоказательОбъект.ШкалаОценкиСтажа.Очистить();
		НоваяСтрока = ПоказательОбъект.ШкалаОценкиСтажа.Добавить();
		НоваяСтрока.ВерхняяГраницаИнтервалаСтажа = 12;
		НоваяСтрока.ЗначениеПоказателя = 0;
		
		НоваяСтрока = ПоказательОбъект.ШкалаОценкиСтажа.Добавить();
		НоваяСтрока.ВерхняяГраницаИнтервалаСтажа = 60;
		НоваяСтрока.ЗначениеПоказателя = 10;
		
		НоваяСтрока = ПоказательОбъект.ШкалаОценкиСтажа.Добавить();
		НоваяСтрока.ВерхняяГраницаИнтервалаСтажа = 120;
		НоваяСтрока.ЗначениеПоказателя = 15;
		
		НоваяСтрока = ПоказательОбъект.ШкалаОценкиСтажа.Добавить();
		НоваяСтрока.ВерхняяГраницаИнтервалаСтажа = 180;
		НоваяСтрока.ЗначениеПоказателя = 20;
		
		НоваяСтрока = ПоказательОбъект.ШкалаОценкиСтажа.Добавить();
		НоваяСтрока.ВерхняяГраницаИнтервалаСтажа = 0;
		НоваяСтрока.ЗначениеПоказателя = 30;
		
		ПоказательОбъект.ОбменДанными.Загрузка = Истина;
		ПоказательОбъект.Записать();
		
	ИначеЕсли КатегорииСтажа = Перечисления.КатегорииСтажа.ВыслугаЛетНаВоеннойСлужбе Тогда
		
		ПоказательОбъект = Показатель.ПолучитьОбъект();
		
		ПоказательОбъект.ШкалаОценкиСтажа.Очистить();
		НоваяСтрока = ПоказательОбъект.ШкалаОценкиСтажа.Добавить();
		НоваяСтрока.ВерхняяГраницаИнтервалаСтажа = 24;
		НоваяСтрока.ЗначениеПоказателя = 0;
		
		НоваяСтрока = ПоказательОбъект.ШкалаОценкиСтажа.Добавить();
		НоваяСтрока.ВерхняяГраницаИнтервалаСтажа = 60;
		НоваяСтрока.ЗначениеПоказателя = 10;
		
		НоваяСтрока = ПоказательОбъект.ШкалаОценкиСтажа.Добавить();
		НоваяСтрока.ВерхняяГраницаИнтервалаСтажа = 120;
		НоваяСтрока.ЗначениеПоказателя = 15;
		
		НоваяСтрока = ПоказательОбъект.ШкалаОценкиСтажа.Добавить();
		НоваяСтрока.ВерхняяГраницаИнтервалаСтажа = 180;
		НоваяСтрока.ЗначениеПоказателя = 20;
		
		НоваяСтрока = ПоказательОбъект.ШкалаОценкиСтажа.Добавить();
		НоваяСтрока.ВерхняяГраницаИнтервалаСтажа = 240;
		НоваяСтрока.ЗначениеПоказателя = 25;
		
		НоваяСтрока = ПоказательОбъект.ШкалаОценкиСтажа.Добавить();
		НоваяСтрока.ВерхняяГраницаИнтервалаСтажа = 300;
		НоваяСтрока.ЗначениеПоказателя = 30;
		
		НоваяСтрока = ПоказательОбъект.ШкалаОценкиСтажа.Добавить();
		НоваяСтрока.ВерхняяГраницаИнтервалаСтажа = 0;
		НоваяСтрока.ЗначениеПоказателя = 40;
		
		ПоказательОбъект.ОбменДанными.Загрузка = Истина;
		ПоказательОбъект.Записать();	
		
	КонецЕсли;

КонецПроцедуры

Процедура СоздатьПоказательДолжностнаяНадбавка(НастройкиРасчетаЗарплаты = Неопределено) Экспорт	
	
	Если НастройкиРасчетаЗарплаты = Неопределено Тогда
		ИспользоватьКвалификационнуюНадбавку = ПолучитьФункциональнуюОпцию("ИспользоватьКвалификационнуюНадбавку");
	Иначе
		ИспользоватьКвалификационнуюНадбавку = НастройкиРасчетаЗарплаты.ИспользоватьКвалификационнуюНадбавку;
	КонецЕсли;
	
	Если ИспользоватьКвалификационнуюНадбавку Тогда
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "ДолжностнаяНадбавка";
		ОписаниеПоказателя.Наименование = НСтр("ru='Должностная надбавка';uk='Посадова надбавка'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Должн. надбавка';uk='Посад. надбавка'");
		ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ЗаписатьПоказатель(ОписаниеПоказателя);
	Иначе
		ОтключитьИспользованиеПредопределенногоЭлемента("ДолжностнаяНадбавка");
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьПоказательКвалификационнаяНадбавка(НастройкиРасчетаЗарплаты = Неопределено) Экспорт	
	
	Если НастройкиРасчетаЗарплаты = Неопределено Тогда
		ИспользоватьКвалификационнуюНадбавку = ПолучитьФункциональнуюОпцию("ИспользоватьКвалификационнуюНадбавку");
	Иначе
		ИспользоватьКвалификационнуюНадбавку = НастройкиРасчетаЗарплаты.ИспользоватьКвалификационнуюНадбавку;
	КонецЕсли;
	
	Если ИспользоватьКвалификационнуюНадбавку Тогда
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "КвалификационнаяНадбавка";
		ОписаниеПоказателя.Наименование = НСтр("ru='Квалификационная надбавка';uk='Кваліфікаційна надбавка'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Квалиф. надбавка';uk='Кваліф. надбавка'");
		ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ЗаписатьПоказатель(ОписаниеПоказателя);
	Иначе
		ОтключитьИспользованиеПредопределенногоЭлемента("КвалификационнаяНадбавка");
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьПоказательНадбавкаЗаВредность(НастройкиРасчетаЗарплаты = Неопределено) Экспорт
	
	Если НастройкиРасчетаЗарплаты = Неопределено Тогда
		ИспользоватьНадбавкуЗаВредность = ПолучитьФункциональнуюОпцию("ИспользоватьНадбавкуЗаВредность");
	Иначе
		ИспользоватьНадбавкуЗаВредность = НастройкиРасчетаЗарплаты.ИспользоватьНадбавкуЗаВредность;
	КонецЕсли;
	
	Если ИспользоватьНадбавкуЗаВредность Тогда
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "ПроцентНадбавкиЗаВредность";
		ОписаниеПоказателя.Наименование = НСтр("ru='Процент надбавки за вредность';uk='Відсоток надбавки за шкідливість'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='% надб.';uk='% надб.'");
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.Точность = 2;
		ЗаписатьПоказатель(ОписаниеПоказателя);
	Иначе
		ОтключитьИспользованиеПредопределенногоЭлемента("ПроцентНадбавкиЗаВредность");
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьПоказательОкладПоДолжности(ПараметрыПланаВидовРасчета = Неопределено) Экспорт
	
	Если ПараметрыПланаВидовРасчета = Неопределено Тогда
		ПараметрыПланаВидовРасчета = РасчетЗарплатыРасширенный.ОписаниеПараметровПланаВидовРасчета();
	КонецЕсли;
	ПараметрыПоказателей = ПараметрыПланаВидовРасчета.ПараметрыПоказателей;

	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "ОкладПоДолжности";
	ОписаниеПоказателя.Наименование = НСтр("ru='Оклад по должности';uk='Оклад за посадою'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Оклад по должн.';uk='Оклад за повинн.'");
	ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
	ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
	ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
	ОписаниеПоказателя.ВидТарифнойСтавки = Перечисления.ВидыТарифныхСтавок.МесячнаяТарифнаяСтавка;
	ОписаниеПоказателя.Точность = ПараметрыПоказателей.ОкладТарифТочность;
	ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
	ЗаписатьПоказатель(ОписаниеПоказателя);

КонецПроцедуры

Процедура СоздатьПоказательЧасовойТарифПоДолжности(ПараметрыПланаВидовРасчета = Неопределено, НастройкиРасчетаЗарплаты = Неопределено) Экспорт
	
	Если НастройкиРасчетаЗарплаты = Неопределено Тогда
		НастройкиРасчетаЗарплаты = РасчетЗарплатыРасширенный.НастройкиРасчетаЗарплаты();
	КонецЕсли;

	Если ПараметрыПланаВидовРасчета = Неопределено Тогда
		ПараметрыПланаВидовРасчета = РасчетЗарплатыРасширенный.ОписаниеПараметровПланаВидовРасчета();
	КонецЕсли;
	ПараметрыПоказателей = ПараметрыПланаВидовРасчета.ПараметрыПоказателей;
	
	Если НастройкиРасчетаЗарплаты.ИспользоватьУчетВремениСотрудниковВЧасах 
		Или НастройкиРасчетаЗарплаты.ИспользоватьСдельныйЗаработок Тогда
	
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "ЧасовойТарифПоДолжности";
		ОписаниеПоказателя.Наименование = НСтр("ru='Тарифная ставка по должности (часовая)';uk='Тарифна ставка з посади (цілодобово)'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Час. тариф по долж.';uk='Годину. тариф за долж.'");
		ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.Точность = ПараметрыПоказателей.ОкладТарифЧасовойТочность;
		ОписаниеПоказателя.ВидТарифнойСтавки = Перечисления.ВидыТарифныхСтавок.ЧасоваяТарифнаяСтавка;
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		ЗаписатьПоказатель(ОписаниеПоказателя);
		
	Иначе
		ОтключитьИспользованиеПредопределенногоЭлемента("ЧасовойТарифПоДолжности");
	КонецЕсли;

КонецПроцедуры

Процедура СоздатьПоказательДневнойТарифПоДолжности(ПараметрыПланаВидовРасчета = Неопределено) Экспорт
	
	Если ПараметрыПланаВидовРасчета = Неопределено Тогда
		ПараметрыПланаВидовРасчета = РасчетЗарплатыРасширенный.ОписаниеПараметровПланаВидовРасчета();
	КонецЕсли;
	ПараметрыПоказателей = ПараметрыПланаВидовРасчета.ПараметрыПоказателей;
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "ДневнойТарифПоДолжности";
	ОписаниеПоказателя.Наименование = НСтр("ru='Тарифная ставка по должности (дневная)';uk='Тарифна ставка з посади (денна)'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Днев. тариф по долж.';uk='Ден. тариф за посад.'");
	ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
	ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
	ОписаниеПоказателя.ВидТарифнойСтавки = Перечисления.ВидыТарифныхСтавок.ДневнаяТарифнаяСтавка;
	ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
	ОписаниеПоказателя.Точность = ПараметрыПоказателей.ОкладТарифТочность;
	ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
	ЗаписатьПоказатель(ОписаниеПоказателя);

КонецПроцедуры

Процедура СоздатьПоказательБазовыйТарифГруппы(НастройкиРасчетаЗарплаты = Неопределено) Экспорт
	
	Если НастройкиРасчетаЗарплаты = Неопределено Тогда
		НастройкиРасчетаЗарплаты = РасчетЗарплатыРасширенный.НастройкиРасчетаЗарплаты();
	КонецЕсли;

	Если НастройкиРасчетаЗарплаты.ИспользоватьТарифныеСеткиПриРасчетеЗарплаты Тогда
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "БазовыйТарифГруппы";
		ОписаниеПоказателя.Наименование = НСтр("ru='Базовый тариф группы';uk='Базовий тариф групи'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Баз. тариф группы';uk='Баз. тариф групи'");
		ОписаниеПоказателя.НазначениеПоказателя = Перечисления.НазначенияПоказателейРасчетаЗарплаты.ДляСотрудника;
		ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
		ОписаниеПоказателя.ВидТарифнойСтавки = Перечисления.ВидыТарифныхСтавок.МесячнаяТарифнаяСтавка;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ЗаписатьПоказатель(ОписаниеПоказателя);
	Иначе
		ОтключитьИспользованиеПредопределенногоЭлемента("БазовыйТарифГруппы");
	КонецЕсли;

КонецПроцедуры

Функция СоздатьПоказательДоплатаЗаРаботуВНочноеВремя() Экспорт
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "ПроцентДоплатыЗаРаботуВНочноеВремя";
	ОписаниеПоказателя.Наименование = НСтр("ru='Процент доплаты за работу в ночное время';uk='Відсоток доплати за роботу в нічний час'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='% допл. за ночн.';uk='% допл. за нічн.'");
	ОписаниеПоказателя.НазначениеПоказателя = Перечисления.НазначенияПоказателейРасчетаЗарплаты.ДляОрганизации;
	ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
	Возврат ЗаписатьПоказатель(ОписаниеПоказателя);

КонецФункции

Функция СоздатьПоказательДоплатаЗаРаботуВВечернееВремя() Экспорт
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "ПроцентДоплатыЗаРаботуВВечернееВремя";
	ОписаниеПоказателя.Наименование = НСтр("ru='Процент доплаты за работу в вечернее время';uk='Відсоток доплати за роботу у вечірній час'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='% допл. за вечерн.';uk='% допл. за вечірн.'");
	ОписаниеПоказателя.НазначениеПоказателя = Перечисления.НазначенияПоказателейРасчетаЗарплаты.ДляОрганизации;
	ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
	Возврат ЗаписатьПоказатель(ОписаниеПоказателя);

КонецФункции

Процедура СоздатьПоказательКоэффициентИндексацииСреднегоЗаработка() Экспорт
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "КоэффициентИндексацииСреднегоЗаработка";
	ОписаниеПоказателя.Наименование = НСтр("ru='Коэффициент индексации среднего заработка';uk='Коефіцієнт індексації середнього заробітку'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Коэф. индекс. средн.';uk='Коеф. індекс. середн.'");
	ОписаниеПоказателя.Точность = 2;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
КонецПроцедуры

Процедура СоздатьПоказательПроцентДоплатыЗаДниНетрудоспособности() Экспорт
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "ПроцентДоплатыЗаДниНетрудоспособности";
	ОписаниеПоказателя.Наименование = НСтр("ru='Процент доплаты за дни нетрудоспособности';uk='Відсоток доплати за дні непрацездатності'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='% доплаты до сред.';uk='% доплати до серед.'");
	ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Истина;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
КонецПроцедуры

Процедура СоздатьПоказательДнейЧасовВыходногоПособия() Экспорт
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "ДнейЧасовВыходногоПособия";
	ОписаниеПоказателя.Наименование = НСтр("ru='Количество оплачиваемых дней (часов) выходного пособия';uk='Кількість оплачуваних днів (годин) вихідної допомоги'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Дней(часов) вых. пособия.';uk='Днів(годин) вих. допомоги.'");
	ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Истина;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
КонецПроцедуры

Процедура СоздатьПоказательНатуральныйДоход() Экспорт
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "НатуральныйДоход";
	ОписаниеПоказателя.Наименование = НСтр("ru='Натуральный доход';uk='Натуральний дохід'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Натур. доход';uk='Натур. дохід'");
	ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
	ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
	ОписаниеПоказателя.Точность = 0;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
КонецПроцедуры

Функция СоздатьПоказательСтоимостьДняЧаса() Экспорт
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "СтоимостьДняЧаса";
	ОписаниеПоказателя.Наименование = НСтр("ru='Стоимость часа (или дня)';uk='Вартість години (або дня)'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Час. или дн. стоим.';uk='Год. або дн. варт.'");
	ОписаниеПоказателя.Точность = 3;
	Возврат ЗаписатьПоказатель(ОписаниеПоказателя);
	
КонецФункции

Функция СоздатьПоказательСреднечасовойЗаработок() Экспорт
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "СреднечасовойЗаработок";
	ОписаниеПоказателя.Наименование = НСтр("ru='Среднечасовой заработок';uk='Середньогодинний заробіток'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Ср. час. заработок';uk='Ср. годину. заробіток'");
	ОписаниеПоказателя.Точность = 2;
	Возврат ЗаписатьПоказатель(ОписаниеПоказателя);
	
КонецФункции

Функция СоздатьПоказательСреднедневнойЗаработок() Экспорт
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "СреднедневнойЗаработок";
	ОписаниеПоказателя.Наименование = НСтр("ru='Среднедневной заработок';uk='Середньоденний заробіток'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Ср. дн. заработок';uk='Ср. дн. заробіток'");
	ОписаниеПоказателя.Точность = 2;
	Возврат ЗаписатьПоказатель(ОписаниеПоказателя);
	
КонецФункции

// Процедура помечает на удаление ранее созданные элементы, идентифицируемые из кода.
//
Процедура УдалитьПотерявшиеАктуальностьПоказатели() Экспорт
	
	УдалитьПотерявшийАктуальностьПоказатель("ТарифнаяСтавкаНормированнаяНаЧасы");
	УдалитьПотерявшийАктуальностьПоказатель("ОтработаноВБазовомПериодеДней");
	УдалитьПотерявшийАктуальностьПоказатель("НормаВремениБазовогоПериодаВДнях");
	УдалитьПотерявшийАктуальностьПоказатель("ОтработаноВБазовомПериодеЧасов");
	УдалитьПотерявшийАктуальностьПоказатель("НормаВремениБазовогоПериодаВЧасах");
	
КонецПроцедуры

Функция СоздатьПоказательНадбавкаЗаВыслугуЛет() Экспорт

	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "ПроцентНадбавкиЗаВыслугуЛет";
	ОписаниеПоказателя.Наименование = НСтр("ru='Процент надбавки за выслугу лет';uk='Відсоток надбавки за вислугу років'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='% надб.';uk='% надб.'");
	ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
	ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
	ОписаниеПоказателя.Точность = 2;
	ОписаниеПоказателя.ВидСтажа = Справочники.ВидыСтажа.СоздатьВидСтажаЗаВыслугуЛет();
	ОписаниеПоказателя.Предопределенный = Ложь;
	ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.ЧисловойЗависящийОтСтажа;
	
	Возврат ЗаписатьПоказатель(ОписаниеПоказателя);

КонецФункции

Процедура УдалитьПроцентПочтовогоСбора() Экспорт
	
	УдалитьПотерявшийАктуальностьПоказатель("ПроцентПочтовогоСбора");
	
КонецПроцедуры

Процедура УдалитьПотерявшиеАктуальностьПоказателиПрожиточногоМинимума() Экспорт
	
	УдалитьПотерявшийАктуальностьПоказатель("ПрожиточныйМинимумПолучателя");
	УдалитьПотерявшийАктуальностьПоказатель("ПрожиточныйМинимумСотрудника");
	
КонецПроцедуры

Процедура УдалитьПотерявшийАктуальностьПоказательРасчетнойБазыВзносовВНПФ() Экспорт
	
	УдалитьПотерявшийАктуальностьПоказатель("РасчетнаяБазаВзносыВНПФ");
	
КонецПроцедуры

Процедура ЗаполнитьПорядокЭлементов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоказателиРасчетаЗарплаты.Ссылка
		|ИЗ
		|	Справочник.ПоказателиРасчетаЗарплаты КАК ПоказателиРасчетаЗарплаты
		|ГДЕ
		|	ПоказателиРасчетаЗарплаты.РеквизитДопУпорядочивания = 0";
		
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ОбъектСправочника = Выборка.Ссылка.получитьОбъект();
			НастройкаПорядкаЭлементов.ЗаполнитьЗначениеРеквизитаУпорядочивания(ОбъектСправочника, Ложь);
			
			ОбъектСправочника.ОбменДанными.Загрузка = Истина;
			ОбъектСправочника.Записать();
			
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура СоздатьПоказательНормаДней()
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "НормаДней";
	ОписаниеПоказателя.Наименование = НСтр("ru='Норма дней';uk='Норма днів'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Норма (дн.)';uk='Норма (дн.)'");
	ОписаниеПоказателя.ОтображатьВДокументахНачисления = Ложь;
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
КонецПроцедуры

Процедура СоздатьПоказательДоляНеполногоРабочегоВремени()
	
	ОписаниеПоказателя = ОписаниеПоказателяДоляНеполногоРабочегоВремени();
	ЗаписатьПоказатель(ОписаниеПоказателя);
	
КонецПроцедуры

Функция ОписаниеПоказателяДоляНеполногоРабочегоВремени()
	
	ОписаниеПоказателя = ОписаниеПоказателя();
	ОписаниеПоказателя.Идентификатор = "ДоляНеполногоРабочегоВремени";
	ОписаниеПоказателя.Наименование = НСтр("ru='Доля неполного рабочего времени';uk='Частка неповного робочого часу'");
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Доля неполн. времени';uk='Частка неповн. часу'");
	ОписаниеПоказателя.ОтображатьВДокументахНачисления = Истина;
	ОписаниеПоказателя.Точность = 4;
	
	Возврат ОписаниеПоказателя;
	
КонецФункции

Процедура ОбновитьПоказательДоляНеполногоРабочегоВремени() Экспорт
	
	Показатель = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ДоляНеполногоРабочегоВремени");
	Если Показатель <> Неопределено
		И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Показатель, "ОтображатьВДокументахНачисления") Тогда
		
		ПоказательОбъект = Показатель.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ПоказательОбъект, ОписаниеПоказателяДоляНеполногоРабочегоВремени(), "ОтображатьВДокументахНачисления");
		
		ПоказательОбъект.ОбменДанными.Загрузка = Истина;
		ПоказательОбъект.Записать();
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура УстановитьТочностьПоказателяДоляНеполногоРабочегоВремени() Экспорт
	
	Показатель = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ДоляНеполногоРабочегоВремени");
	Если Показатель <> Неопределено
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Показатель, "Точность") < 4 Тогда
		
		ПоказательОбъект = Показатель.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ПоказательОбъект, ОписаниеПоказателяДоляНеполногоРабочегоВремени(), "Точность");

		ПоказательОбъект.ОбменДанными.Загрузка = Истина;
		ПоказательОбъект.Записать();
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура СоздатьПоказателиСуммированногоУчета() Экспорт

	// Суммированный учет (переработки)
	НастройкиРасчетаЗарплаты				 = РасчетЗарплатыРасширенный.НастройкиРасчетаЗарплаты();
	ИспользоватьОплатуПереработокСуммированногоУчета		 = НастройкиРасчетаЗарплаты.ИспользоватьОплатуПереработокСуммированногоУчета;
	ИспользоватьУчетВремениСотрудниковВЧасах				 = НастройкиРасчетаЗарплаты.ИспользоватьУчетВремениСотрудниковВЧасах;
	
	Если ИспользоватьУчетВремениСотрудниковВЧасах И ИспользоватьОплатуПереработокСуммированногоУчета Тогда
		// Переработки всего
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "ПереработаноПоСуммированномуУчету";
		ОписаниеПоказателя.Наименование = НСтр("ru='Переработано по суммированному учету';uk='Перероблено за підсумованим обліком'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Переработки (всего)';uk='Переробітки (всього)'");
		ЗаписатьПоказатель(ОписаниеПоказателя);
		// Переработки в пределах 2 часов.
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "ПереработаноПоСуммированномуУчетуВПределах2Часов";
		ОписаниеПоказателя.Наименование = НСтр("ru='Переработано по суммированному учету в пределах 2 часов';uk='Перероблено за підсумованим обліком в межах 2 годин'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Переработки (до 2 ч)';uk='Переробітки (до 2 год)'");
		ЗаписатьПоказатель(ОписаниеПоказателя);
	Иначе
		ОтключитьИспользованиеПредопределенногоЭлемента("ПереработаноПоСуммированномуУчету");
		ОтключитьИспользованиеПредопределенногоЭлемента("ПереработаноПоСуммированномуУчетуВПределах2Часов");
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();

КонецПроцедуры

Процедура ВыполнитьПереименованиеПоказателейУчетаВремени() Экспорт
	
	СоздатьПоказательНормаДней();
	СоздатьПоказательДоляНеполногоРабочегоВремени();
	
	ПоказательНормаДнейПоГрафикуПолногоРабочегоВремени = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.НормаВремениВДнях");
	Если ЗначениеЗаполнено(ПоказательНормаДнейПоГрафикуПолногоРабочегоВремени) Тогда
		
		Если ПоказательНормаДнейПоГрафикуПолногоРабочегоВремени.Идентификатор = "НормаВремениВДнях" Тогда
			
			ПоказательОбъект = ПоказательНормаДнейПоГрафикуПолногоРабочегоВремени.ПолучитьОбъект();
			
			ПоказательОбъект.Идентификатор = "НормаДнейПоГрафикуПолногоРабочегоВремени";
			ПоказательОбъект.ИдентификаторСлужебный = ВРег(ПоказательОбъект.Идентификатор);
			
			ПоказательОбъект.Наименование = НСтр("ru='Норма дней по графику полного рабочего времени';uk='Норма днів за графіком повного робочого часу'");
			ПоказательОбъект.КраткоеНаименование = НСтр("ru='Норма дн. полн.граф.';uk='Норма дн. повн.граф.'");
			
			ПоказательОбъект.ОбменДанными.Загрузка = Истина;
			ПоказательОбъект.Записать();
			
			ЗаменитьИдентификаторыПоказателяВФормулахВидовРасчета(
				ПоказательНормаДнейПоГрафикуПолногоРабочегоВремени, "НормаВремениВДнях", "НормаДнейПоГрафикуПолногоРабочегоВремени");
			
		КонецЕсли; 
		
	КонецЕсли;
	
	ПоказательНормаЧасов = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.НормаВремениВЧасах");
	Если ЗначениеЗаполнено(ПоказательНормаЧасов) Тогда
		
		Если ПоказательНормаЧасов.Идентификатор = "НормаВремениВЧасах" Тогда
			
			ПоказательОбъект = ПоказательНормаЧасов.ПолучитьОбъект();
			
			ПоказательОбъект.Идентификатор = "НормаЧасов";
			ПоказательОбъект.ИдентификаторСлужебный = ВРег(ПоказательОбъект.Идентификатор);
			
			ПоказательОбъект.Наименование = НСтр("ru='Норма часов';uk='Норма годин'");
			ПоказательОбъект.КраткоеНаименование = ПоказательОбъект.Наименование;
			
			ПоказательОбъект.ОбменДанными.Загрузка = Истина;
			ПоказательОбъект.Записать();
			
			ЗаменитьИдентификаторыПоказателяВФормулахВидовРасчета(
				ПоказательНормаЧасов, "НормаВремениВЧасах", "НормаЧасов");
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаменитьИдентификаторыПоказателяВФормулахВидовРасчета(Показатель, СтарыйИдентификатор, НовыйИдентификатор)
	
	Запрос = Новый запрос;
	Запрос.УстановитьПараметр("Показатель", Показатель);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НачисленияПоказатели.Ссылка
		|ИЗ
		|	ПланВидовРасчета.Начисления.Показатели КАК НачисленияПоказатели
		|ГДЕ
		|	НачисленияПоказатели.Показатель = &Показатель
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УдержанияПоказатели.Ссылка
		|ИЗ
		|	ПланВидовРасчета.Удержания.Показатели КАК УдержанияПоказатели
		|ГДЕ
		|	УдержанияПоказатели.Показатель = &Показатель";
		
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ВидРасчетаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ФормулаРасчета = СокрЛП(ВидРасчетаОбъект.ФормулаРасчета);
			НоваяФормулаРасчета = "";
			
			НоваяФормулаФормировалась = Ложь;
			ПозицияСтарогоПоказателя = СтрНайти(ВРег(ФормулаРасчета), ВРег(СтарыйИдентификатор));
			Пока ПозицияСтарогоПоказателя > 0 Цикл
				
				НоваяФормулаФормировалась = Истина;
				
				НачалоИдентификатора = Ложь;
				ЭтоСтарыйИдентификатор = Ложь;
				
				Если ПозицияСтарогоПоказателя = 1
					ИЛИ СтроковыеФункцииКлиентСервер.ЭтоРазделительСлов(КодСимвола(Сред(ФормулаРасчета, ПозицияСтарогоПоказателя - 1, 1))) Тогда
					
					НачалоИдентификатора = Истина;
					
				КонецЕсли; 
				
				Если НачалоИдентификатора Тогда
					
					Если СтрДлина(ФормулаРасчета) = ПозицияСтарогоПоказателя + СтрДлина(СтарыйИдентификатор) - 1
						ИЛИ СтроковыеФункцииКлиентСервер.ЭтоРазделительСлов(КодСимвола(Сред(ФормулаРасчета, ПозицияСтарогоПоказателя + СтрДлина(СтарыйИдентификатор), 1))) Тогда
						
						ЭтоСтарыйИдентификатор = Истина;
					
					КонецЕсли;
					
				КонецЕсли;
				
				Если ЭтоСтарыйИдентификатор Тогда
					НоваяФормулаРасчета = НоваяФормулаРасчета + Лев(ФормулаРасчета, ПозицияСтарогоПоказателя - 1) + НовыйИдентификатор;
				Иначе
					НоваяФормулаРасчета = НоваяФормулаРасчета + Лев(ФормулаРасчета, ПозицияСтарогоПоказателя + СтрДлина(СтарыйИдентификатор) - 1);
				КонецЕсли;
				
				ФормулаРасчета = Сред(ФормулаРасчета, ПозицияСтарогоПоказателя + СтрДлина(СтарыйИдентификатор));
				ПозицияСтарогоПоказателя = СтрНайти(ВРег(ФормулаРасчета), ВРег(СтарыйИдентификатор));
				
			КонецЦикла;
			
			Если НоваяФормулаФормировалась Тогда
				
				НоваяФормулаРасчета = НоваяФормулаРасчета + ФормулаРасчета;
				
				Если ЗначениеЗаполнено(НоваяФормулаРасчета) Тогда
					
					Результаты = РасчетЗарплатыРасширенный.ПараметрыВыполненияФормулы(НоваяФормулаРасчета, Истина);
					Если Результаты <> Неопределено Тогда
						
						ВидРасчетаОбъект.ФормулаРасчета = НоваяФормулаРасчета;
						ВидРасчетаОбъект.ФормулаРасчетаДляВыполнения = Результаты.ФормулаДляВыполнения;
						
						ВидРасчетаОбъект.ОбменДанными.Загрузка = Истина;
						ВидРасчетаОбъект.Записать();
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЕсли; 

		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

Процедура СоздатьПоказателиДляНадбавок(ПараметрыПланаВидовРасчета)

	Надбавки = ПараметрыПланаВидовРасчета.Надбавки;
	
	Если Надбавки.ИспользоватьНадбавкуЗаВыслугуЛет Тогда
		ПоказательСсылка = ЗарплатаКадрыРасширенный.ПоказательПоИдентификатору("ПроцентНадбавкиЗаВыслугуЛет");
		Если Не ЗначениеЗаполнено(ПоказательСсылка) Тогда
			СоздатьПоказательНадбавкаЗаВыслугуЛет();
		КонецЕсли;
	КонецЕсли;
	
	ПрочиеНадбавкиПроцентом = Надбавки.НадбавкиПроцентом;
	Если ПрочиеНадбавкиПроцентом.Количество() > 0 Тогда
		
		Для каждого Надбавка Из ПрочиеНадбавкиПроцентом Цикл
			
			Если ПустаяСтрока(Надбавка) Тогда
				Надбавки.ИдентификаторыНадбавокПроцентом.Добавить("");
				Продолжить;
			КонецЕсли;
			
			Надбавка = СОКРЛП(Надбавка);
			Наименование = НСтр("ru='Процент надбавки';uk='Відсоток надбавки'") + " " + Надбавка;
			
			Идентификатор = НСтр("ru='ПроцентНадбавки';uk='ПроцентНадбавки'");
			КраткоеНаименование = "% ";
			СформироватьИдентификаторИКраткоеНаименованиеНадбавки(Надбавки, Надбавка, Надбавки.ИдентификаторыНадбавокПроцентом, Идентификатор, КраткоеНаименование);
			
			ОписаниеПоказателя = ОписаниеПоказателя();
			ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
			ОписаниеПоказателя.Идентификатор = Идентификатор;  
			ОписаниеПоказателя.Наименование = Наименование;
			ОписаниеПоказателя.КраткоеНаименование = КраткоеНаименование;
			ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
			ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
			ОписаниеПоказателя.Точность = 2;
			ОписаниеПоказателя.Предопределенный = Ложь;
			ЗаписатьПоказатель(ОписаниеПоказателя);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ПрочиеНадбавкиСуммой = Надбавки.НадбавкиСуммой;
	Если ПрочиеНадбавкиСуммой.Количество() > 0 Тогда
		
		Для каждого Надбавка Из ПрочиеНадбавкиСуммой Цикл
			
			Если ПустаяСтрока(Надбавка) Тогда
				Надбавки.ИдентификаторыНадбавокСуммой.Добавить("");
				Продолжить;
			КонецЕсли;
			
			Надбавка = СОКРЛП(Надбавка);
			Наименование = Надбавка + " " + НСтр("ru='(грн)';uk='(грн)'");
			
			Идентификатор = НСтр("ru='РазмерНадбавки';uk='РазмерНадбавки'");
			КраткоеНаименование = "";
			СформироватьИдентификаторИКраткоеНаименованиеНадбавки(Надбавки, Надбавка, Надбавки.ИдентификаторыНадбавокСуммой, Идентификатор, КраткоеНаименование);
			КраткоеНаименование = КраткоеНаименование + " " + НСтр("ru='(грн)';uk='(грн)'");
			
			ОписаниеПоказателя = ОписаниеПоказателя();
			ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
			ОписаниеПоказателя.Идентификатор = Идентификатор;
			ОписаниеПоказателя.Наименование = Наименование;
			ОписаниеПоказателя.КраткоеНаименование = КраткоеНаименование;
			ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
			ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
			ОписаниеПоказателя.Точность = 0;
			ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
			ОписаниеПоказателя.Предопределенный = Ложь;
			ЗаписатьПоказатель(ОписаниеПоказателя);
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры   

Процедура СоздатьПоказателиДляКомпенсационныхВыплат(ПараметрыПланаВидовРасчета)

	КомпенсационныеВыплаты = ПараметрыПланаВидовРасчета.КомпенсационныеВыплаты;
	Если КомпенсационныеВыплаты.Количество() > 0 Тогда
		
		Для каждого Выплата Из КомпенсационныеВыплаты Цикл
			
			Если ПустаяСтрока(Выплата.Название) Тогда
				Продолжить;
			КонецЕсли;
			
			Название = СОКРЛП(Выплата.Название);
			Наименование = Название + " " + НСтр("ru='(грн)';uk='(грн)'");
			
			Идентификатор = НСтр("ru='РазмерКомпенсации';uk='РазмерКомпенсации'");
			КраткоеНаименование = "";
			ИдентификаторИКраткоеНаименованиеПоТекстовойСтроке(Идентификатор,КраткоеНаименование,Название);
			КраткоеНаименование = КраткоеНаименование + " " + НСтр("ru='(грн)';uk='(грн)'");
			
			Выплата.Показатель = Идентификатор;
			ОписаниеПоказателя = ОписаниеПоказателя();
			ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
			ОписаниеПоказателя.Идентификатор = Идентификатор;
			ОписаниеПоказателя.Наименование = Наименование;
			ОписаниеПоказателя.КраткоеНаименование = КраткоеНаименование;
			ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
			ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
			ОписаниеПоказателя.Точность = 0;
			ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
			ОписаниеПоказателя.Предопределенный = Ложь;
			ЗаписатьПоказатель(ОписаниеПоказателя);
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ИдентификаторИКраткоеНаименованиеПоТекстовойСтроке(Идентификатор,КраткоеНаименование,ТекстоваяСтрока)

	СтрокаГласных = "а,е,ё,и,о,у,ы,э,ю,я";
	МассивГласных = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаГласных, ",");
	
	Слова = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекстоваяСтрока, " ");
	НовыйИдентификатор = "";
	Для каждого Слово Из Слова Цикл
		НовыйИдентификатор = НовыйИдентификатор + Врег(Лев(Слово,1)) + Сред(Слово,2);
	КонецЦикла;
	Для Позиция = 1 По СтрДлина(НовыйИдентификатор) Цикл
		Если Не СтроковыеФункцииКлиентСервер.ЭтоРазделительСлов(КодСимвола(НовыйИдентификатор, Позиция)) Тогда
			Идентификатор = Идентификатор + Сред(НовыйИдентификатор,Позиция,1)
		КонецЕсли;
	КонецЦикла;
	
	ТекстСтр = Нрег(ТекстоваяСтрока);
	ДлинаСлова = СтрДлина(ТекстСтр);
	Если ДлинаСлова <= 4 Тогда
		КраткоеНаименование = КраткоеНаименование + ТекстСтр;
	Иначе
		Для каждого Слово Из Слова Цикл
			
			Если СтрДлина(Слово) <= 4 Тогда
				КраткоеНаименование = КраткоеНаименование + " "+ Слово;
			Иначе
				
				КраткоеНаименование = КраткоеНаименование + " " + Лев(Слово,3);
				ОстатокСлова = Сред(Слово,4);
				ДлинаСлова = СтрДлина(ОстатокСлова);
				ГласнаяБуква = Ложь;
				Для СчБукв = 1 По ДлинаСлова Цикл
					Буква = Сред(ОстатокСлова,СчБукв,1);
					ГласнаяБуква = МассивГласных.Найти(Буква) <> Неопределено;
					Если ГласнаяБуква Тогда
						КраткоеНаименование = КраткоеНаименование + ".";
						Прервать;
					Иначе
						КраткоеНаименование = КраткоеНаименование + Буква;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура СоздатьПоказателиДляУчетаВремениСотрудниковВЧасах(НастройкиРасчетаЗарплаты, ПараметрыПланаВидовРасчета)
	
	ПараметрыПоказателей = ПараметрыПланаВидовРасчета.ПараметрыПоказателей;
	
	Если НастройкиРасчетаЗарплаты.ИспользоватьУчетВремениСотрудниковВЧасах Тогда
		// Время в часах — показатель, который используется в том числе для оплаты праздников и выходных.
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "ВремяВЧасах";
		ОписаниеПоказателя.Наименование = НСтр("ru='Время в часах';uk='Час в годинах'");
		ОписаниеПоказателя.ОтображатьВДокументахНачисления = Ложь;
		ОписаниеПоказателя.Точность = 3;
		ЗаписатьПоказатель(ОписаниеПоказателя);
	Иначе
		ОтключитьИспользованиеПредопределенногоЭлемента("ВремяВЧасах");
	КонецЕсли;
	
	Если НастройкиРасчетаЗарплаты.ИспользоватьУчетВремениСотрудниковВЧасах Тогда
		СоздатьПоказательСреднечасовойЗаработок();	
	Иначе
		ОтключитьИспользованиеПредопределенногоЭлемента("СреднечасовойЗаработок");
	КонецЕсли;
	
	// Отключаем в случае, если не используется учет времени в часах.
	Если НастройкиРасчетаЗарплаты.ИспользоватьУчетВремениСотрудниковВЧасах 
		Или НастройкиРасчетаЗарплаты.ИспользоватьСдельныйЗаработок Тогда
		
		// Тарифная ставка часовая
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "ТарифнаяСтавкаЧасовая";
		ОписаниеПоказателя.Наименование = НСтр("ru='Тарифная ставка (часовая)';uk='Тарифна ставка (годинна)'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Час. тариф';uk='Год. тариф'");
		ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.Точность = ПараметрыПоказателей.ОкладТарифЧасовойТочность;
		ОписаниеПоказателя.ВидТарифнойСтавки = Перечисления.ВидыТарифныхСтавок.ЧасоваяТарифнаяСтавка;
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		ЗаписатьПоказатель(ОписаниеПоказателя);
		
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "НормаЧасов";
		ОписаниеПоказателя.ИмяПредопределенныхДанных = "НормаВремениВЧасах";
		ОписаниеПоказателя.Наименование = НСтр("ru='Норма часов';uk='Норма годин'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Норма (час.)';uk='Норма (год.)'");
		ОписаниеПоказателя.ОтображатьВДокументахНачисления = Ложь;
		ЗаписатьПоказатель(ОписаниеПоказателя);
		
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "ОтработаноЧасов";
		ОписаниеПоказателя.Наименование = НСтр("ru='Отработано часов, в т.ч. сверхурочно';uk='Відпрацьовано годин, в т. ч. понаднормово'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Отраб. (час.)';uk='Відпрац. (год.)'");
		ОписаниеПоказателя.ОтображатьВДокументахНачисления = Ложь;
		ОписаниеПоказателя.Точность = 3;
		ЗаписатьПоказатель(ОписаниеПоказателя);
		
	Иначе
		ОтключитьИспользованиеПредопределенногоЭлемента("ТарифнаяСтавкаЧасовая");
		ОтключитьИспользованиеПредопределенногоЭлемента("НормаВремениВЧасах");
		ОтключитьИспользованиеПредопределенногоЭлемента("ОтработаноЧасов");
	КонецЕсли;
		
	НастройкиУчетаВремени = УчетРабочегоВремени.НастройкиУчетаВремени();
	
	Если НастройкиУчетаВремени.УчитыватьНочныеЧасы И НастройкиРасчетаЗарплаты.ИспользоватьУчетВремениСотрудниковВЧасах Тогда
		СоздатьПоказательДоплатаЗаРаботуВНочноеВремя();
	Иначе	
		ОтключитьИспользованиеПредопределенногоЭлемента("ПроцентДоплатыЗаРаботуВНочноеВремя");
	КонецЕсли;
	
	Если НастройкиУчетаВремени.УчитыватьВечерниеЧасы И НастройкиРасчетаЗарплаты.ИспользоватьУчетВремениСотрудниковВЧасах Тогда
		СоздатьПоказательДоплатаЗаРаботуВВечернееВремя();
	Иначе	
		ОтключитьИспользованиеПредопределенногоЭлемента("ПроцентДоплатыЗаРаботуВВечернееВремя");
	КонецЕсли;
	
	СоздатьПоказательЧасовойТарифПоДолжности(ПараметрыПланаВидовРасчета, НастройкиРасчетаЗарплаты);
	
	// Размер дневной надбавки за квалификацию
	Если НастройкиРасчетаЗарплаты.ИспользоватьУчетВремениСотрудниковВЧасах 
		И НастройкиРасчетаЗарплаты.ИспользоватьТарифныеСеткиПриРасчетеЗарплаты Тогда
		ОписаниеПоказателя = ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "РазмерЧасовойДоплатыЗаКвалификацию";
		ОписаниеПоказателя.Наименование = НСтр("ru='Размер часовой доплаты за квалификацию';uk='Розмір годинної доплати за кваліфікацію'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru='Час. допл. за квалиф.';uk='Годину. допл. за кваліф.'");
		ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.Точность = ПараметрыПоказателей.ОкладТарифТочность;
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		ЗаписатьПоказатель(ОписаниеПоказателя);
	Иначе
		ОтключитьИспользованиеПредопределенногоЭлемента("РазмерЧасовойДоплатыЗаКвалификацию");
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьИдентификаторИКраткоеНаименованиеНадбавки(Надбавки, Надбавка, ИдентификаторыНадбавок, Идентификатор, КраткоеНаименование)

	ИдентификаторИКраткоеНаименованиеПоТекстовойСтроке(Идентификатор,КраткоеНаименование,Надбавка);
	ИдентификаторыНадбавок.Добавить(Идентификатор);
	
КонецПроцедуры

// Создает описание показателя расчета зарплаты в виде структуры со значениями полей по умолчанию.
//
// Имена полей структуры:
//		Наименование, 
//		КраткоеНаименование, 
//		Идентификатор, 
//		НазначениеПоказателя, 
//		ТипПоказателя, 
//		СпособВводаЗначений, 
//		ВидСтажа, 
//		Точность, 
//		ОтображатьВДокументахНачисления
//
Функция ОписаниеПоказателя() Экспорт 
	
	Описание = Новый Структура("
	|Наименование,
	|КраткоеНаименование,
	|Идентификатор,
	|НазначениеПоказателя,
	|СпособПримененияЗначений,
	|ТипПоказателя,
	|СпособВводаЗначений,
	|ВидСтажа,
	|Точность,
	|ОтображатьВДокументахНачисления,
	|ЗначениеРассчитываетсяАвтоматически,
	|ВидТарифнойСтавки,
	|НачальнаяНастройка,
	|Предопределенный,
	|ИмяПредопределенныхДанных");
	
	Описание.НазначениеПоказателя = Перечисления.НазначенияПоказателейРасчетаЗарплаты.ДляСотрудника;
	Описание.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Числовой;
	Описание.ЗначениеРассчитываетсяАвтоматически = Истина;
	Описание.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Разовое;
	Описание.СпособВводаЗначений = Перечисления.СпособыВводаЗначенийПоказателейРасчетаЗарплаты.ВводитсяЕдиновременно;
	Описание.ОтображатьВДокументахНачисления = Истина;
	Описание.НачальнаяНастройка = Ложь;
	Описание.Предопределенный = Истина;
	Описание.ИмяПредопределенныхДанных = "";
	
	Возврат Описание;
	
КонецФункции

// Создает или обновляет в информационной базе идентифицируемый элемент по описанию.
//
// Параметры:
//	- ОписаниеПоказателя - структура, состав полей см. в СоздатьОписаниеПоказателя.
//
Функция ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы = Неопределено) Экспорт 
	
	Если СозданныеЭлементы = Неопределено Тогда 
		СозданныеЭлементы = Новый Структура;
	КонецЕсли;
	
	ПоказательСсылка = Неопределено;
	СозданныеЭлементы.Свойство(ОписаниеПоказателя.Идентификатор, ПоказательСсылка);
	
	ИмяПредопределенныхДанных = ?(ПустаяСтрока(ОписаниеПоказателя.ИмяПредопределенныхДанных), ОписаниеПоказателя.Идентификатор, ОписаниеПоказателя.ИмяПредопределенныхДанных);
	
	Если ОписаниеПоказателя.Предопределенный Тогда 
		
		ПоказательСсылка = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты."	+ ИмяПредопределенныхДанных);
			
	ИначеЕсли Не ЗначениеЗаполнено(ПоказательСсылка) Тогда 
		ПоказательСсылка = ЗарплатаКадрыРасширенный.ПоказательПоИдентификатору(ОписаниеПоказателя.Идентификатор);
	КонецЕсли;
	
	НовыйПоказатель = Не ЗначениеЗаполнено(ПоказательСсылка);
	
	Если НовыйПоказатель Тогда
		ПоказательОбъект = Справочники.ПоказателиРасчетаЗарплаты.СоздатьЭлемент();
		Если ОписаниеПоказателя.Предопределенный Тогда 
			ПоказательОбъект.ИмяПредопределенныхДанных = ИмяПредопределенныхДанных;
		КонецЕсли;
	Иначе 
		ПоказательОбъект = ПоказательСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	Если НовыйПоказатель Или ОписаниеПоказателя.НачальнаяНастройка Тогда
		ПоказательОбъект.Идентификатор = ОписаниеПоказателя.Идентификатор;
		ПоказательОбъект.Наименование = ?(ПустаяСтрока(ОписаниеПоказателя.Наименование), ОписаниеПоказателя.Идентификатор, ОписаниеПоказателя.Наименование);
		ПоказательОбъект.КраткоеНаименование = ?(ПустаяСтрока(ОписаниеПоказателя.КраткоеНаименование), ПоказательОбъект.Наименование, ОписаниеПоказателя.КраткоеНаименование);
		ПоказательОбъект.НазначениеПоказателя = ОписаниеПоказателя.НазначениеПоказателя;
		ПоказательОбъект.ТипПоказателя = ОписаниеПоказателя.ТипПоказателя;
		ПоказательОбъект.ВидТарифнойСтавки = ОписаниеПоказателя.ВидТарифнойСтавки;
		ПоказательОбъект.СпособПримененияЗначений = ОписаниеПоказателя.СпособПримененияЗначений;
		ПоказательОбъект.СпособВводаЗначений = ОписаниеПоказателя.СпособВводаЗначений;
		ПоказательОбъект.Точность = ОписаниеПоказателя.Точность;
		ПоказательОбъект.ОтображатьВДокументахНачисления = ОписаниеПоказателя.ОтображатьВДокументахНачисления;
		ПоказательОбъект.ЗначениеРассчитываетсяАвтоматически = ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически;
		ПоказательОбъект.ВидСтажа = ОписаниеПоказателя.ВидСтажа;
		ПоказательОбъект.ПометкаУдаления = Ложь;
		ПоказательОбъект.НеИспользуется = Ложь;
	Иначе
		ПоказательОбъект.ПометкаУдаления = Ложь;
		ПоказательОбъект.НеИспользуется = Ложь;
	КонецЕсли;
	
	ПоказательОбъект.Записать();
	
	Если Не ОписаниеПоказателя.Предопределенный Тогда 
		СозданныеЭлементы.Вставить(ОписаниеПоказателя.Идентификатор, ПоказательОбъект.Ссылка);
	КонецЕсли;
	
	Возврат ПоказательОбъект.Ссылка;
	
КонецФункции

Процедура ОтключитьИспользованиеПредопределенногоЭлемента(ИмяПредопределенныхДанных) Экспорт 
	
	Ссылка = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты." + ИмяПредопределенныхДанных);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Объект = Ссылка.ПолучитьОбъект();
		Попытка
			Объект.Заблокировать();
		Исключение
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Невозможно изменить показатель """"%2"""". Возможно, он редактируется другим пользователем';uk='Неможливо змінити показник """"%2"""". Можливо, він редагував іншим користувачем'"), Объект.Наименование);
			ВызватьИсключение ТекстСообщения;
		КонецПопытки;
		Объект.НеИспользуется = Истина;
		Объект.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Отключает использование не предопределенных показателей, созданных при начальной настройке программы.
//
Процедура НачальнаяНастройкаОтключитьИспользованиеПоказателя(СозданныеЭлементы, Идентификатор) Экспорт

	СправочникСсылка = Неопределено;
	СозданныеЭлементы.Свойство(Идентификатор, СправочникСсылка);
	
	Если СправочникСсылка <> Неопределено Тогда 
		
		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		
		Попытка
			СправочникОбъект.Заблокировать();
		Исключение
			ТекстИсключения = НСтр("ru='Невозможно изменить Показатель """"%2"""". Возможно, объект редактируется другим пользователем';uk='Неможливо змінити Показник """"%2"""". Можливо, об''єкт редагується іншим користувачем'");
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстИсключения, СправочникОбъект.Наименование);
		КонецПопытки;
		
		СправочникОбъект.НеИспользуется = Истина;
		СправочникОбъект.Записать();
		
		СозданныеЭлементы.Вставить(Идентификатор, Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьПотерявшийАктуальностьПоказатель(ИдентификаторОбъекта)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Объекты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПоказателиРасчетаЗарплаты КАК Объекты
	|ГДЕ
	|	Объекты.УдалитьИдентификаторОбъекта = &ИдентификаторОбъекта");
	
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПоказательОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПоказательОбъект.УдалитьИдентификаторОбъекта = Неопределено;
		ПоказательОбъект.ПометкаУдаления = Истина;
		ПоказательОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

// После добавления показателей, нужно обновить начисления с предопределенным способом расчета, 
// в которых эти показатели задействованы.
//
Процедура ОбновитьПоказателиПредопределенныхСпособовРасчета() Экспорт
	
	// Выбираем начисления с предопределенным способом в таблице которых не хватает показателей.
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаПоказателей.СпособРасчета,
	|	ТаблицаПоказателей.Показатель
	|ПОМЕСТИТЬ ВТТаблицаПоказателей
	|ИЗ
	|	&ТаблицаПоказателей КАК ТаблицаПоказателей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начисления.Ссылка КАК ВидРасчета,
	|	ТаблицаПоказателей.Показатель
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаПоказателей КАК ТаблицаПоказателей
	|		ПО (ТаблицаПоказателей.СпособРасчета = Начисления.СпособРасчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ПоказателиНачислений
	|		ПО Начисления.Ссылка = ПоказателиНачислений.Ссылка
	|			И (ТаблицаПоказателей.Показатель = ПоказателиНачислений.Показатель)
	|ГДЕ
	|	ПоказателиНачислений.Показатель ЕСТЬ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Начисления.Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТаблицаПоказателей", РасчетЗарплатыРасширенный.ТаблицаПоказателейПредопределенныхСпособовРасчета());
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВидыРасчетаДляЗаписи = Новый Массив;
	Пока Выборка.СледующийПоЗначениюПоля("ВидРасчета") Цикл
		ВидРасчетаОбъект = Выборка.ВидРасчета.ПолучитьОбъект();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ВидРасчетаОбъект.Показатели.Добавить();
			НоваяСтрока.Показатель = Выборка.Показатель;
			НоваяСтрока.ИспользоватьПриРасчете = Истина;
		КонецЦикла;
		РасчетЗарплатыРасширенный.ЗаполнитьИнформациюОПоказателяхВидаРасчета(ВидРасчетаОбъект);
		РасчетЗарплатыРасширенный.ЗаполнитьИнформациюОбУчетеВремени(ВидРасчетаОбъект);
		ВидыРасчетаДляЗаписи.Добавить(ВидРасчетаОбъект);
	КонецЦикла;
	
	РасчетЗарплатыРасширенный.ЗаписатьПакетВидовРасчета(ВидыРасчетаДляЗаписи);
	
КонецПроцедуры

Функция СсылкиПоказателиРасчетаЗарплатыНачальнойНастройкиПрограммы() Экспорт 
	
	СсылкиПоказателиРасчетаЗарплаты = Новый Структура;
	
	СсылкиПоказателиРасчетаЗарплаты.Вставить("ПроцентЕжемесячнойПремии", Неопределено);
	СсылкиПоказателиРасчетаЗарплаты.Вставить("РазмерЕжемесячнойПремии", Неопределено);
	СсылкиПоказателиРасчетаЗарплаты.Вставить("РазмерГодовойПремии", Неопределено);
	СсылкиПоказателиРасчетаЗарплаты.Вставить("ПроцентГодовойПремии", Неопределено);
	СсылкиПоказателиРасчетаЗарплаты.Вставить("РазмерКвартальнойПремии", Неопределено);
	СсылкиПоказателиРасчетаЗарплаты.Вставить("ПроцентКвартальнойПремии", Неопределено);
	СсылкиПоказателиРасчетаЗарплаты.Вставить("РазмерРазовойПремии", Неопределено);
	СсылкиПоказателиРасчетаЗарплаты.Вставить("ПроцентРазовойПремии", Неопределено);
	СсылкиПоказателиРасчетаЗарплаты.Вставить("Выручка", Неопределено);
	СсылкиПоказателиРасчетаЗарплаты.Вставить("ПроцентДоплатыЗаВыручку", Неопределено);
	СсылкиПоказателиРасчетаЗарплаты.Вставить("ВыполнениеПлана", Неопределено);
	СсылкиПоказателиРасчетаЗарплаты.Вставить("План", Неопределено);
	СсылкиПоказателиРасчетаЗарплаты.Вставить("РазмерЕдиновременногоНачисления", Неопределено);
	СсылкиПоказателиРасчетаЗарплаты.Вставить("НатуральнаяОплата", Неопределено);
	СсылкиПоказателиРасчетаЗарплаты.Вставить("Педнагрузка", Неопределено);
	СсылкиПоказателиРасчетаЗарплаты.Вставить("НормаПеднагрузки", Неопределено);
	СсылкиПоказателиРасчетаЗарплаты.Вставить("ОкладПреподавателя", Неопределено);
	СсылкиПоказателиРасчетаЗарплаты.Вставить("КлассноеРуководство", Неопределено);
	СсылкиПоказателиРасчетаЗарплаты.Вставить("ПроверкаТетрадей", Неопределено);
	
	Возврат СсылкиПоказателиРасчетаЗарплаты;
	
КонецФункции

// Показатели, выбор которых ограничен в формулах расчета удержаний из-за невозможности расчета по физическим лицам.
//
Функция ПоказателиНедоступныеДляУдержаний() Экспорт
	
	Показатели = Новый Массив;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Показатели, ПоказателиУчетаВремени());
	
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.БазовыйТарифГруппы"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ДневнойТарифПоДолжности"));	
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.КоэффициентИндексацииСреднегоЗаработка"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.КвалификационнаяНадбавка"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ДолжностнаяНадбавка"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.НатуральнаяОплата"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.НатуральныйДоход"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.Оклад"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ОкладПоДолжности"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ПроцентДоплатыЗаДниНетрудоспособности"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ПроцентОплатыПоСреднему"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.РазмерДоплатыЗаСовмещение"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.РазмерПособияПоУходуЗаРебенкомДоТрехЛет"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.СдельныйЗаработок"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.СтоимостьДня"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.СтоимостьДняЧаса"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.СтоимостьЧаса"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ТарифнаяСтавкаДневная"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ТарифнаяСтавкаЧасовая"));
	Показатели.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ЧасовойТарифПоДолжности"));
	
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(Показатели, ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.КоличествоДнейКомпенсации"));
	
	Возврат Показатели;
	
КонецФункции

Функция ОперативныеПоказатели() Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоказателиРасчетаЗарплаты.Ссылка
	               |ИЗ
	               |	Справочник.ПоказателиРасчетаЗарплаты КАК ПоказателиРасчетаЗарплаты
	               |ГДЕ
	               |	ПоказателиРасчетаЗарплаты.СпособВводаЗначений = ЗНАЧЕНИЕ(Перечисление.СпособыВводаЗначенийПоказателейРасчетаЗарплаты.НакапливаетсяПоОтдельнымЗначениям)";
				   
	ОперативныеПоказатели = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");			   
	
	Возврат ОперативныеПоказатели;
	
КонецФункции

#КонецОбласти

#КонецЕсли