
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("УправлениеТорговлей") Тогда
		Заголовок = НСтр("ru='Настройки и справочники по планированию';uk='Настройки та довідники з планування'");
	Иначе
		Заголовок = НСтр("ru='Настройки и справочники по бюджетированию и планированию';uk='Настройки та довідники з бюджетування і планування'");
	КонецЕсли;
	
	// Настройки видимости при запуске
	УправлениеЭлементами();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьМоделиБюджетирования(Команда)
	
	//++ НЕ УТ
	ОткрытьФорму("Справочник.МоделиБюджетирования.ФормаСписка", , ЭтаФорма);
	//-- НЕ УТ
	Возврат; // в УТ2 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтатьиБюджетов(Команда)
	
	//++ НЕ УТ
	ОткрытьФорму("Справочник.СтатьиБюджетов.ФормаСписка", , ЭтаФорма);
	//-- НЕ УТ
	Возврат; // в УТ2 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАналитикиСтатейБюджетов(Команда)
	
	//++ НЕ УТ
	ОткрытьФорму("ПланВидовХарактеристик.АналитикиСтатейБюджетов.ФормаСписка", , ЭтаФорма);
	//-- НЕ УТ
	Возврат; // в УТ2 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСценарии(Команда)
	
	//++ НЕ УТ
	ОткрытьФорму("Справочник.Сценарии.ФормаСписка", , ЭтаФорма);
	//-- НЕ УТ
	Возврат; // в УТ2 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыБюджетов(Команда)
	
	//++ НЕ УТ
	ОткрытьФорму("Справочник.ВидыБюджетов.ФормаСписка", , ЭтаФорма);
	//-- НЕ УТ
	Возврат; // в УТ2 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПоказателиБюджетов(Команда)
	
	//++ НЕ УТ
	ОткрытьФорму("Справочник.ПоказателиБюджетов.ФормаСписка", , ЭтаФорма);
	//-- НЕ УТ
	Возврат; // в УТ2 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСвязиПоказателейБюджетов(Команда)
	
	//++ НЕ УТ
	ОткрытьФорму("РегистрСведений.СвязиПоказателейБюджетов.ФормаСписка", , ЭтаФорма);
	//-- НЕ УТ
	Возврат; // в УТ2 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНефинансовыеПоказатели(Команда)
	
	//++ НЕ УТ
	ОткрытьФорму("Справочник.НефинансовыеПоказателиБюджетов.ФормаСписка", , ЭтаФорма);
	//-- НЕ УТ
	Возврат; // в УТ2 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьШаблоныВводаНефинансовыхПоказателей(Команда)
	
	//++ НЕ УТ
	ОткрытьФорму("Справочник.ШаблоныВводаНефинансовыхПоказателей.ФормаСписка", , ЭтаФорма);
	//-- НЕ УТ
	Возврат; // в УТ2 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПравилаПолученияФактическихДанных(Команда)
	
	//++ НЕ УТ
	ОткрытьФорму("Обработка.НастройкаПравилПолученияФактаБюджетирования.Форма");
	//-- НЕ УТ
	Возврат; // в УТ2 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЭтапыБюджетногоПроцесса(Команда)
	
	//++ НЕ УТКА
	ОткрытьФорму("Справочник.ЭтапыПодготовкиБюджетов.ФормаСписка", , ЭтаФорма);
	//-- НЕ УТКА
	Возврат; // в УТ2 и КА2 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьМодельБюджетирования(Команда)
	
	//++ НЕ УТ
	ОткрытьФорму("Обработка.ПомощникВыгрузкиЗагрузкиМоделиБюджетирования.Форма.Выгрузка", , ЭтаФорма);
	//-- НЕ УТ
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьМодельБюджетирования(Команда)
	
	//++ НЕ УТ
	ОткрытьФорму("Обработка.ПомощникВыгрузкиЗагрузкиМоделиБюджетирования.Форма.Загрузка", , ЭтаФорма);
	//-- НЕ УТ
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсточникиДанныхПланирования(Команда)
	
	ОткрытьФорму("Справочник.ИсточникиДанныхПланирования.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыПланов(Команда)
	
	ОткрытьФорму("Справочник.ВидыПланов.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСценарииПланирования(Команда)
	
	ОткрытьФорму("Справочник.СценарииТоварногоПланирования.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСезонныеКоэффициенты(Команда)
	
	ОткрытьФорму("РегистрСведений.СезонныеКоэффициенты.Форма.СезонныеКоэффициенты",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНормативыРаспределения(Команда)
	
	ОткрытьФорму("Документ.НормативРаспределенияПлановПродажПоКатегориям.Форма.ФормаРедактирования",, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементами()
	
	//++ НЕ УТ
	// Бюджетирование
	ИспользоватьБюджетирование = ПолучитьФункциональнуюОпцию("ИспользоватьБюджетирование");
	
	Элементы.ГруппаБюджетирование.Видимость = ИспользоватьБюджетирование;
		
	Элементы.ОткрытьМоделиБюджетирования.Видимость 
		= ПравоДоступа("Просмотр", Метаданные.Справочники.МоделиБюджетирования);
	Элементы.ОткрытьСценарии.Видимость 
		= ПравоДоступа("Просмотр", Метаданные.Справочники.Сценарии);
	Элементы.ОткрытьСтатьиБюджетов.Видимость 
		= ПравоДоступа("Просмотр", Метаданные.Справочники.СтатьиБюджетов);
	Элементы.ОткрытьАналитикиСтатейБюджетов.Видимость 
		= ПравоДоступа("Просмотр", Метаданные.ПланыВидовХарактеристик.АналитикиСтатейБюджетов);
	Элементы.ОткрытьПоказателиБюджетов.Видимость 
		= ПравоДоступа("Просмотр", Метаданные.Справочники.ПоказателиБюджетов);
	Элементы.ОткрытьСвязиПоказателейБюджетов.Видимость 
		= ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.СвязиПоказателейБюджетов);
	Элементы.ОткрытьНефинансовыеПоказатели.Видимость 
		= ПравоДоступа("Просмотр", Метаданные.Справочники.НефинансовыеПоказателиБюджетов);
	Элементы.ОткрытьПравилаПолученияФакта.Видимость 
		= ПравоДоступа("Просмотр", Метаданные.Обработки.НастройкаПравилПолученияФактаБюджетирования);
	Элементы.ОткрытьВидыБюджетов.Видимость 
		= ПравоДоступа("Просмотр", Метаданные.Справочники.ВидыБюджетов);
		
	//-- НЕ УТ
	// Планирование
	ПравоДоступаИсточникиДанныхПланирования = ПравоДоступа("Просмотр", Метаданные.Справочники.ИсточникиДанныхПланирования);
	ПравоДоступаСценарииПланирования        = ПравоДоступа("Просмотр", Метаданные.Справочники.СценарииТоварногоПланирования);
	ПравоДоступаВидыПланов                  = ПравоДоступа("Просмотр", Метаданные.Справочники.ВидыПланов);
	ПравоДоступаСезонныеКоэффициенты        = ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.СезонныеКоэффициенты);
	ПравоДоступаНормативыРаспределения      = ПравоДоступа("Просмотр", Метаданные.Документы.НормативРаспределенияПлановПродажПоКатегориям);
	
	Элементы.ОткрытьИсточникиДанныхПланирования.Видимость = ПравоДоступаИсточникиДанныхПланирования;
	Элементы.ОткрытьСценарииПланирования.Видимость = ПравоДоступаСценарииПланирования;
	Элементы.ОткрытьВидыПланов.Видимость = ПравоДоступаВидыПланов;
	Элементы.ОткрытьСезонныеКоэффициенты.Видимость = ПравоДоступаСезонныеКоэффициенты;
	Элементы.ОткрытьНормативыРаспределения.Видимость = ПравоДоступаНормативыРаспределения;
	
КонецПроцедуры

#КонецОбласти
