
&НаКлиенте
Процедура ДобавитьПоБюджету(Команда)
	
	МодельБюджетирования = Неопределено;
	Для Каждого Отбор из Список.Отбор.Элементы Цикл
		Если Строка(Отбор.ЛевоеЗначение) = "Владелец" Тогда
			МодельБюджетирования = Отбор.ПравоеЗначение;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура("Владелец", МодельБюджетирования);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СозданиеЭлементовПоВидуБюджета", ЭтаФорма);
	ОткрытьФорму("Справочник.ПравилаЛимитовПоДаннымБюджетирования.Форма.ВыборЭлементовВидаБюджета", ПараметрыФормы,,,,,
																			ОписаниеОповещения,
																			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеЭлементовПоВидуБюджета(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Истина Тогда
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛимитыРасходов(Команда)
	
	ОткрытьФорму("Отчет.ЛимитыРасходаДенежныхСредствПоДаннымБюджетирования.Форма", Новый Структура("СформироватьПриОткрытии", Истина));
	
КонецПроцедуры
