
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(
		"Обработка.НастройкаОтраженияДокументовВРеглУчете.Команда.ОтражениеДокументовВРеглУчете");
	
	 ПараметрыФормы = Новый Структура("", );
	 ОткрытьФорму("Обработка.НастройкаОтраженияДокументовВРеглУчете.Форма",
	 	ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
	 
КонецПроцедуры // ОбработкаКоманды()
