////////////////////////////////////////////////////////////////////////////////
// Подсистема "Криптосервис".
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ГотовКРаботе(Объект) Экспорт
	
	Если ТипЗнч(Объект) = Тип("Структура") Тогда
		Если Объект.Свойство("Идентификатор") Тогда
			Идентификатор = Объект.Идентификатор;
		Иначе
			Идентификатор = Объект.ИдентификаторДокументооборота;
		КонецЕсли;
	Иначе
		Идентификатор = ЭлектроннаяПодписьВМоделиСервисаВызовСервера.УчетнаяЗапись(Объект).ИдентификаторДокументооборота;
	КонецЕсли;
	
	Возврат КриптосервисВМоделиСервиса.Авторизован(Идентификатор);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ