#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция НомерСубконто(Счет, ВидСубконто) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет",        Счет);
	Запрос.УстановитьПараметр("ВидСубконто", ВидСубконто);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХозрасчетныйВидыСубконто.НомерСтроки
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	|ГДЕ
	|	ХозрасчетныйВидыСубконто.Ссылка = &Счет
	|	И ХозрасчетныйВидыСубконто.ВидСубконто = &ВидСубконто";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерСтроки;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецЕсли
