
#Область ПрограммныйИнтерфейс

// Функция заполняет наименование рабочего места клиента по имени пользователя.
//
Процедура ЗаполнитьНаименованиеРабочегоМеста(Объект, ИмяПользователя) Экспорт
	
	ИмяПустойПользователь = НСтр("ru='<Пользователь>';uk='<Користувач>'");
	
	Если ПустаяСтрока(Объект.Наименование) Тогда
		
		Если ПустаяСтрока(ИмяПользователя) Тогда
			Объект.Наименование = "<" + ИмяПустойПользователь + ">";
		Иначе
			Объект.Наименование = Строка(ИмяПользователя);
		КонецЕсли;
		
		Если ПустаяСтрока(Объект.ИмяКомпьютера) Тогда
			Объект.Наименование = Объект.Наименование + "(" + Объект.Код           + ")";
		Иначе
			Объект.Наименование = Объект.Наименование + "(" + Объект.ИмяКомпьютера + ")";
		КонецЕсли;
		
	ИначеЕсли Не ПустаяСтрока(Строка(ИмяПользователя))
	          И Найти(Объект.Наименование, ИмяПустойПользователь) > 0 Тогда
	
		Объект.Наименование = СтрЗаменить(Объект.Наименование, ИмяПустойПользователь, Строка(ИмяПользователя));
	
	КонецЕсли;

КонецПроцедуры

// Функция возвращает пустую структуру прайс-листа
// для заполнения XDTO-пакета EquipmentService.
//
Функция ПолучитьСтруктуруПрайсЛиста() Экспорт
	
	СтруктураПрайсЛиста = Новый Структура;
	СтруктураПрайсЛиста.Вставить("ПолнаяЗагрузка", Ложь);
	СтруктураПрайсЛиста.Вставить("Товары",        Новый Массив);
	СтруктураПрайсЛиста.Вставить("ГруппыТоваров", Новый Массив);
	СтруктураПрайсЛиста.Вставить("ДопСведения",   Новый Массив);
	
	Возврат СтруктураПрайсЛиста;
	
КонецФункции

// Функция возвращает пустую структуру записи массива "Товары" прайс-листа
// для заполнения XDTO-пакета EquipmentService.
//
Функция ПолучитьСтруктуруЗаписиМассиваТовары() Экспорт
	
	СтруктураЗаписиМассиваТовары = Новый Структура;
	
	СтруктураЗаписиМассиваТовары.Вставить("Код");
	СтруктураЗаписиМассиваТовары.Вставить("КодГруппы", "");
	СтруктураЗаписиМассиваТовары.Вставить("Наименование");
	СтруктураЗаписиМассиваТовары.Вставить("ИмеетХарактеристики", Ложь);
	СтруктураЗаписиМассиваТовары.Вставить("ИмеетУпаковки", Ложь);
	СтруктураЗаписиМассиваТовары.Вставить("Артикул");
	СтруктураЗаписиМассиваТовары.Вставить("ЕдиницаИзмерения");
	СтруктураЗаписиМассиваТовары.Вставить("СтавкаНДС", "");
	СтруктураЗаписиМассиваТовары.Вставить("Весовой", Ложь);
	СтруктураЗаписиМассиваТовары.Вставить("Штрихкод");
	СтруктураЗаписиМассиваТовары.Вставить("Остаток");
	СтруктураЗаписиМассиваТовары.Вставить("Услуга", Ложь);
	СтруктураЗаписиМассиваТовары.Вставить("Цена");
	СтруктураЗаписиМассиваТовары.Вставить("Упаковки", Новый Массив());
	СтруктураЗаписиМассиваТовары.Вставить("Характеристики", Новый Массив());

	Возврат СтруктураЗаписиМассиваТовары;
	
КонецФункции

#КонецОбласти
