
&НаКлиенте
Процедура ЗаявлениеРасчетВФССПриИзменении(Элемент)
	Объект.РасчетыСФондами.Очистить();
	ЗаявлениеРасчетВФССПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаявлениеРасчетВФССПриИзмененииНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.ЗаявлениеРасчетВФСС) Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РасчетыСФондамиПоПособиямОстатки.Организация,
	               |	РасчетыСФондамиПоПособиямОстатки.Месяц,
	               |	РасчетыСФондамиПоПособиямОстатки.Заявление,
	               |	РасчетыСФондамиПоПособиямОстатки.ФондСоциальногоСтрахования,
	               |	РасчетыСФондамиПоПособиямОстатки.СтатьяРасчетов,
	               |	РасчетыСФондамиПоПособиямОстатки.Сотрудник КАК Сотрудник,
	               |	РасчетыСФондамиПоПособиямОстатки.ДокументОснование,
	               |	СУММА(РасчетыСФондамиПоПособиямОстатки.СуммаОстаток) КАК Сумма
	               |ПОМЕСТИТЬ Остатки
	               |ИЗ
	               |	РегистрНакопления.РасчетыСФондамиПоПособиям.Остатки(
	               |			&Дата,
	               |			Заявление = &Заявление
	               |				И Организация = &Организация) КАК РасчетыСФондамиПоПособиямОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыСФондамиПоПособиямОстатки.Организация,
	               |	РасчетыСФондамиПоПособиямОстатки.Месяц,
	               |	РасчетыСФондамиПоПособиямОстатки.ФондСоциальногоСтрахования,
	               |	РасчетыСФондамиПоПособиямОстатки.Заявление,
	               |	РасчетыСФондамиПоПособиямОстатки.Сотрудник,
	               |	РасчетыСФондамиПоПособиямОстатки.СтатьяРасчетов,
	               |	РасчетыСФондамиПоПособиямОстатки.ДокументОснование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Остатки.Организация,
	               |	Остатки.Месяц,
	               |	Остатки.Заявление,
	               |	Остатки.ФондСоциальногоСтрахования,
	               |	Остатки.СтатьяРасчетов,
	               |	Остатки.Сотрудник КАК Сотрудник,
	               |	Остатки.ДокументОснование,
	               |	Остатки.Сумма,
	               |	ЕСТЬNULL(РасчетыСФондамиПоПособиям.КоличествоДней, 0) КАК КоличествоДней,
	               |	ЕСТЬNULL(РасчетыСФондамиПоПособиям.СуммаЛьготыЧернобыльцы, 0) КАК СуммаЛьготЧернобыльцы
	               |ИЗ
	               |	Остатки КАК Остатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСФондамиПоПособиям КАК РасчетыСФондамиПоПособиям
	               |		ПО Остатки.Заявление = РасчетыСФондамиПоПособиям.Регистратор
	               |			И Остатки.Сотрудник = РасчетыСФондамиПоПособиям.Сотрудник
	               |			И Остатки.ДокументОснование = РасчетыСФондамиПоПособиям.ДокументОснование
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сотрудник";
	Запрос.УстановитьПараметр("Заявление", Объект.ЗаявлениеРасчетВФСС);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Дата", НачалоДня(Объект.Дата) - 1);
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() = 0 Тогда
		//Сообщить что нет данных
	Иначе
		Для Каждого Строка Из Таблица Цикл
			НовСтрока = Объект.РасчетыСФондами.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, Строка);
		КонецЦикла;
	КонецЕсли;
	Объект.ФондСоциальногоСтрахования = Объект.ЗаявлениеРасчетВФСС.ФондСоциальногоСтрахования;
	ЗаполнитьМесяцПоДатеТабличнойЧасти();
	КлючевыеРеквизиты();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетыСФондамиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		// Заполнение нового документа.
		ЗначенияДляЗаполнения = Новый Структура("Организация, Ответственный,",
		"Объект.Организация",
		"Объект.Ответственный");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
		
		ЗаявлениеРасчетВФССПриИзмененииНаСервере();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.РасчетыСФондами.Очистить();
		ЗаявлениеРасчетВФССПриИзмененииНаСервере();
	КонецЕсли;
	
	КлючевыеРеквизиты();
	ЗаполнитьМесяцПоДатеТабличнойЧасти();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМесяцПоДатеТабличнойЧасти()
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДатеВТабличнойЧасти(Объект.РасчетыСФондами, "Месяц", "МесяцСтрокой");
	
КонецПроцедуры	

&НаСервере
Процедура КлючевыеРеквизиты()
	ЗарплатаКадрыРасширенный.КлючевыеРеквизитыЗаполненияФормыЗаполнитьПредупреждения(ЭтаФорма, КлючевыеРеквизитыЗаполненияФормыОписаниеКлючевыхРеквизитов());
	ЗарплатаКадрыРасширенныйКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтаФорма, , КлючевыеРеквизитыЗаполненияФормыОписаниеКлючевыхРеквизитов(), КлючевыеРеквизитыЗаполненияФормыТаблицыОчищаемыеПриИзменении());
КонецПроцедуры	

// Функция возвращает массив реквизитов формы подключенных к механизму ключевых реквизитов формы.
&НаСервере
Функция КлючевыеРеквизитыЗаполненияФормыОписаниеКлючевыхРеквизитов() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Новый Структура("ЭлементФормы, Представление", "Организация",	НСтр("ru='организации';uk='організації'")));
	Массив.Добавить(Новый Структура("ЭлементФормы, Представление", "ЗаявлениеРасчетВФСС",	НСтр("ru='заявления';uk='заяви'")));
	
	Возврат Массив
КонецФункции

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтаФорма);
	Если Объект.РасчетыСФондами.Количество() = 0 Тогда
		Объект.ЗаявлениеРасчетВФСС = ПредопределенноеЗначение("Документ.ЗаявлениеРасчетВФСС.ПустаяСсылка");
		Объект.ФондСоциальногоСтрахования = ПредопределенноеЗначение("Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КлючевыеРеквизитыЗаполненияФормыТаблицыОчищаемыеПриИзменении() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить("Объект.РасчетыСФондами");
	Возврат Массив
	
КонецФункции 

&НаКлиенте
Процедура ЗаполнитьПоЗаявлению(Команда)
	
	Объект.РасчетыСФондами.Очистить();
	ЗаявлениеРасчетВФССПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаполнитьМесяцПоДатеТабличнойЧасти();
КонецПроцедуры
