////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обновление версии ИБ"
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Процедура ЗаполнитьАналитикуНаСчетах вызывается для заполнения аналитики на счетах,
// в соответствии со спецификой конфигурации - потребителя.
//
Процедура ЗаполнитьАналитикуНаСчетах() Экспорт
	
	// Установим субконто на счетах в соответствии с параметрами учета.
	ПараметрыУчета = ОбщегоНазначенияБПКлиентСервер.СтруктураПараметровУчета();
	ПараметрыУчета.ВестиПартионныйУчет					 = Ложь;
	ПараметрыУчета.СкладскойУчет						 = 2;
	ПараметрыУчета.ИспользоватьОборотнуюНоменклатуру	 = Ложь;
	ПараметрыУчета.РазделятьПоСтавкамНДС				 = Ложь;
	ПараметрыУчета.ВестиУчетПоСтатьямДДС				 = Истина;
	ПараметрыУчета.ВестиУчетПоРаботникам				 = Истина;
	ПараметрыУчета.УчетЗарплатыИКадровВоВнешнейПрограмме = Ложь;
	
	ОбщегоНазначенияБПВызовСервера.ПрименитьПараметрыУчета(ПараметрыУчета, Истина);
	
	
КонецПроцедуры

// Процедура ЗаполнитьРегистрыСчетовУчета заполняет настройки 
// для подстановки счетов учета по умолчанию.
// 
Процедура ЗаполнитьСчетаУчетаПоУмолчанию() Экспорт

КонецПроцедуры


// Устанавливает аналитику на счетах расчетов с персоналом по оплате труда
Процедура УстановитьУчетПоРаботникам() Экспорт
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	//БУ
	Счета = Новый СписокЗначений();
	Счета.Добавить("РасчетыПоДепонированнымСуммам");
	Счета.Добавить("РасходыНаОплатуТрудаБудущихПериодов");
	
	Для каждого Счет Из Счета Цикл
		ОбновлениеИнформационнойБазыБП.ПрименитьПараметрыРасчетовССотрудниками(Счет.Значение, "Хозрасчетный", Истина)
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры


// Возвращает строку с именем о библиотеке или основной конфигурации.
//
Функция ИмяПодсистемы() Экспорт

	Возврат "РегламентированныйУчет";

КонецФункции
