#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов


// Заполняет список команд создания на основании.
//
// Параметры:
// 		КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. в функции ВводНаОсновании.СоздатьКоллекциюКомандСоздатьНаОсновании
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	
	
КонецПроцедуры

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ПеремещениеВЭксплуатации) Тогда
		КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Идентификатор = Метаданные.Документы.ПеремещениеВЭксплуатации.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ВводНаОсновании.ПредставлениеОбъекта(Метаданные.Документы.ПеремещениеВЭксплуатации);
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьВнутреннееПотребление";
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов) Экспорт

	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);

	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуМатериалыВЭксплуатации(КомандыОтчетов);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт
	
	ИсточникиДанных = Новый Соответствие;
	Возврат ИсточникиДанных;
	
КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТМЦВЭксплуатации(ТекстыЗапроса, Регистры);
	
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Ложь, Ложь, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеШапки.Дата КАК Период,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Подразделение КАК Подразделение,
	|	ДанныеШапки.ПодразделениеПолучатель КАК ПодразделениеПолучатель
	|ИЗ
	|	Документ.ПеремещениеВЭксплуатации КАК ДанныеШапки
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период", Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
	Запрос.УстановитьПараметр("Подразделение", Реквизиты.Подразделение);
	Запрос.УстановитьПараметр("ПодразделениеПолучатель", Реквизиты.ПодразделениеПолучатель);
	
КонецПроцедуры

Процедура ТМЦВЭксплуатации(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ТМЦВЭксплуатации";
	
	Если Не ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// ТМЦВЭксплуатации
	|" +
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	ТабличнаяЧасть.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТабличнаяЧасть.Номенклатура КАК Номенклатура,
	|	ТабличнаяЧасть.Характеристика КАК Характеристика,
	|	ТабличнаяЧасть.ПартияТМЦВЭксплуатации КАК Партия,
	|	-ТабличнаяЧасть.Количество КАК Количество
	|ИЗ
	|	Документ.ПеремещениеВЭксплуатации.Товары КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	&Организация,
	|	&ПодразделениеПолучатель,
	|	ТабличнаяЧасть.ФизическоеЛицоПолучатель,
	|	ТабличнаяЧасть.Номенклатура,
	|	ТабличнаяЧасть.Характеристика,
	|	ТабличнаяЧасть.ПартияТМЦВЭксплуатации,
	|	ТабличнаяЧасть.Количество
	|ИЗ
	|	Документ.ПеремещениеВЭксплуатации.Товары КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &Ссылка" + ";";
	
	ТекстыЗапроса.Добавить(Текст, ИмяРегистра, Истина);
	
КонецПроцедуры

#Область ПроведениеПоРеглУчетуУКР

Функция ТекстОтраженияВРеглУчетеУКР() Экспорт
	
#Область ПеремещениеВЭксплуатации // (Дт 111, 1122 :: Кт 111, 1122)
	ПеремещениеВЭксплуатации =  "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|//Перемещение в эксплуатации товаров (Дт 111, 1122 :: Кт 111, 1122)
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	втСтоимостиТМЦВЭксплуатации.Стоимость КАК Сумма, 
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦВЭксплуатации) КАК ВидСчетаДт,
	|	втСтоимостиТМЦВЭксплуатации.КатегорияЭксплуатации КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втСтоимостиТМЦВЭксплуатации.ПодразделениеПолучатель КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	втСтоимостиТМЦВЭксплуатации.НалоговоеНазначение КАК НалоговоеНазначениеДт, 
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	втСтоимостиТМЦВЭксплуатации.Номенклатура КАК СубконтоДт1,
	|	втСтоимостиТМЦВЭксплуатации.ПартияТМЦВЭксплуатации КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	втСтоимостиТМЦВЭксплуатации.Количество КАК КоличествоДт,
	|	втСтоимостиТМЦВЭксплуатации.СтоимостьНУ КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦВЭксплуатации) КАК ВидСчетаКт,
	|	втСтоимостиТМЦВЭксплуатации.КатегорияЭксплуатации КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	втСтоимостиТМЦВЭксплуатации.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	втСтоимостиТМЦВЭксплуатации.НалоговоеНазначение КАК НалоговоеНазначениеКт, 
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	втСтоимостиТМЦВЭксплуатации.Номенклатура КАК СубконтоКт1,
	|	втСтоимостиТМЦВЭксплуатации.ПартияТМЦВЭксплуатации КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	втСтоимостиТМЦВЭксплуатации.Количество КАК КоличествоКт,
	|	втСтоимостиТМЦВЭксплуатации.СтоимостьНУ КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Перемещение ТМЦ в эксплуатации"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПеремещениеВЭксплуатации КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		втСтоимостиТМЦВЭксплуатации КАК втСтоимостиТМЦВЭксплуатации
	|	ПО
	|		Операция.Ссылка = втСтоимостиТМЦВЭксплуатации.Ссылка
	|/////////////////////////////////////////////////////////////	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|//Перемещение амортизации эксплуатации товаров (Дт 1322 :: Кт 1322)
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	втСтоимостиТМЦВЭксплуатации.СтоимостьАмортизации КАК Сумма, 
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦВЭксплуатацииАмортизация) КАК ВидСчетаДт,
	|	втСтоимостиТМЦВЭксплуатации.КатегорияЭксплуатации КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втСтоимостиТМЦВЭксплуатации.Подразделение	КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	втСтоимостиТМЦВЭксплуатации.НалоговоеНазначение КАК НалоговоеНазначениеДт, 
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	втСтоимостиТМЦВЭксплуатации.Номенклатура КАК СубконтоДт1,
	|	втСтоимостиТМЦВЭксплуатации.ПартияТМЦВЭксплуатации КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КоличествоДт,
	|	втСтоимостиТМЦВЭксплуатации.СтоимостьАмортизацииНУ КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦВЭксплуатацииАмортизация) КАК ВидСчетаКт,
	|	втСтоимостиТМЦВЭксплуатации.КатегорияЭксплуатации КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	втСтоимостиТМЦВЭксплуатации.ПодразделениеПолучатель КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	втСтоимостиТМЦВЭксплуатации.НалоговоеНазначение КАК НалоговоеНазначениеКт, 
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	втСтоимостиТМЦВЭксплуатации.Номенклатура КАК СубконтоКт1,
	|	втСтоимостиТМЦВЭксплуатации.ПартияТМЦВЭксплуатации КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	втСтоимостиТМЦВЭксплуатации.СтоимостьАмортизацииНУ КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Перемещение ТМЦ в эксплуатации"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПеремещениеВЭксплуатации КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		втСтоимостиТМЦВЭксплуатации КАК втСтоимостиТМЦВЭксплуатации
	|	ПО
	|		Операция.Ссылка = втСтоимостиТМЦВЭксплуатации.Ссылка
	|";
#КонецОбласти 	

	Возврат ПеремещениеВЭксплуатации
		+ "";
		
КонецФункции

Функция ТекстЗапросаВТОтраженияВРеглУчетеУКР() Экспорт
	
	Возврат
	"ВЫБРАТЬ
	|	ПланСчетов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втСчетаТЦМВЭксплуатации
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК ПланСчетов
	|ГДЕ
	|	ПланСчетов.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура)
	|	И ПланСчетов.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПартииМатериаловВЭксплуатации)
	|	И ПланСчетов.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|	И НЕ ПланСчетов.Забалансовый
	|	И ПланСчетов.Количественный
	|	И НЕ ПланСчетов.ЗапретитьИспользоватьВПроводках
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланСчетов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втСчетаАмортизацииТЦМВЭксплуатации
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК ПланСчетов
	|ГДЕ
	|	ПланСчетов.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура)
	|	И ПланСчетов.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПартииМатериаловВЭксплуатации)
	|	И ПланСчетов.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|	И НЕ ПланСчетов.Забалансовый
	|	И НЕ ПланСчетов.Количественный
	|	И НЕ ПланСчетов.ЗапретитьИспользоватьВПроводках
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПеремещениеВЭксплуатацииТовары.Ссылка,
	|	ПеремещениеВЭксплуатацииТовары.Ссылка.Организация КАК Организация,
	|	ПеремещениеВЭксплуатацииТовары.Ссылка.Подразделение КАК Подразделение,
	|	ПеремещениеВЭксплуатацииТовары.Ссылка.ПодразделениеПолучатель,
	|	ПеремещениеВЭксплуатацииТовары.Номенклатура КАК Номенклатура,
	|	ПеремещениеВЭксплуатацииТовары.ПартияТМЦВЭксплуатации КАК ПартияТМЦВЭксплуатации,
	|	СУММА(ПеремещениеВЭксплуатацииТовары.Количество) КАК Количество,
	|	ПеремещениеВЭксплуатацииТовары.ПартияТМЦВЭксплуатации.КатегорияЭксплуатации
	|ПОМЕСТИТЬ втПеремещениеТЦМ
	|ИЗ
	|	Документ.ПеремещениеВЭксплуатации.Товары КАК ПеремещениеВЭксплуатацииТовары
	|ГДЕ
	|	ПеремещениеВЭксплуатацииТовары.Ссылка = &Ссылка
	|	И ПеремещениеВЭксплуатацииТовары.ПартияТМЦВЭксплуатации.КатегорияЭксплуатации.ВидТМЦ В (ЗНАЧЕНИЕ(Перечисление.ВидыТМЦВЭксплуатации.МалоценныйНеоборотныйАктив), ЗНАЧЕНИЕ(Перечисление.ВидыТМЦВЭксплуатации.БиблиотечныеФонды))
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеВЭксплуатацииТовары.Ссылка,
	|	ПеремещениеВЭксплуатацииТовары.Ссылка.Организация,
	|	ПеремещениеВЭксплуатацииТовары.Ссылка.Подразделение,
	|	ПеремещениеВЭксплуатацииТовары.Ссылка.ПодразделениеПолучатель,
	|	ПеремещениеВЭксплуатацииТовары.Номенклатура,
	|	ПеремещениеВЭксплуатацииТовары.ПартияТМЦВЭксплуатации,
	|	ПеремещениеВЭксплуатацииТовары.ПартияТМЦВЭксплуатации.КатегорияЭксплуатации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Подразделение,
	|	Номенклатура,
	|	ПартияТМЦВЭксплуатации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ПартииТМЦВЭксплуатации) КАК ПартияТМЦВЭксплуатации,
	|	ХозрасчетныйОстатки.НалоговоеНазначение,
	|	ХозрасчетныйОстатки.КоличествоОстатокДт КАК КоличествоОстаток,
	|	ХозрасчетныйОстатки.СуммаОстатокДт КАК СуммаОстаток,
	|	ХозрасчетныйОстатки.СуммаНУОстатокДт КАК СуммаНУОстаток
	|ПОМЕСТИТЬ втОстаткиТМЦВЭксплуатации
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&Дата,
	|			Счет В
	|				(ВЫБРАТЬ
	|					Т.Ссылка
	|				ИЗ
	|					втСчетаТЦМВЭксплуатации КАК Т),
	|			,
	|			(Организация, Подразделение, Субконто1, Субконто2) В
	|				(ВЫБРАТЬ
	|					Т.Организация,
	|					Т.Подразделение,
	|					Т.Номенклатура,
	|					Т.ПартияТМЦВЭксплуатации
	|				ИЗ
	|					втПеремещениеТЦМ КАК Т)) КАК ХозрасчетныйОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ПартияТМЦВЭксплуатации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ПартииТМЦВЭксплуатации) КАК ПартияТМЦВЭксплуатации,
	|	ХозрасчетныйОстатки.НалоговоеНазначение,
	|	ХозрасчетныйОстатки.СуммаОстатокКт КАК СуммаОстаток,
	|	ХозрасчетныйОстатки.СуммаНУОстатокКт КАК СуммаНУОстаток
	|ПОМЕСТИТЬ втОстаткиАмортизацииТМЦВЭксплуатации
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&Дата,
	|			Счет В
	|				(ВЫБРАТЬ
	|					Т.Ссылка
	|				ИЗ
	|					втСчетаАмортизацииТЦМВЭксплуатации КАК Т),
	|			,
	|			(Организация, Подразделение, Субконто1, Субконто2) В
	|				(ВЫБРАТЬ
	|					Т.Организация,
	|					Т.Подразделение,
	|					Т.Номенклатура,
	|					Т.ПартияТМЦВЭксплуатации
	|				ИЗ
	|					втПеремещениеТЦМ КАК Т)) КАК ХозрасчетныйОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ПартияТМЦВЭксплуатации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(втОстаткиТМЦВЭксплуатации.Номенклатура, втОстаткиАмортизацииТМЦВЭксплуатации.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(втОстаткиТМЦВЭксплуатации.ПартияТМЦВЭксплуатации, втОстаткиАмортизацииТМЦВЭксплуатации.ПартияТМЦВЭксплуатации) КАК ПартияТМЦВЭксплуатации,
	|	ЕСТЬNULL(втОстаткиТМЦВЭксплуатации.НалоговоеНазначение, втОстаткиАмортизацииТМЦВЭксплуатации.НалоговоеНазначение) КАК НалоговоеНазначение,
	|	ЕСТЬNULL(втОстаткиТМЦВЭксплуатации.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(втОстаткиТМЦВЭксплуатации.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ЕСТЬNULL(втОстаткиТМЦВЭксплуатации.СуммаНУОстаток, 0) КАК СуммаНУОстаток,
	|	ЕСТЬNULL(втОстаткиАмортизацииТМЦВЭксплуатации.СуммаОстаток, 0) КАК СуммаАмортизацииОстаток,
	|	ЕСТЬNULL(втОстаткиАмортизацииТМЦВЭксплуатации.СуммаНУОстаток, 0) КАК СуммаАмортизацииНУОстаток
	|ПОМЕСТИТЬ втОстатки
	|ИЗ
	|	втОстаткиТМЦВЭксплуатации КАК втОстаткиТМЦВЭксплуатации
	|		ПОЛНОЕ СОЕДИНЕНИЕ втОстаткиАмортизацииТМЦВЭксплуатации КАК втОстаткиАмортизацииТМЦВЭксплуатации
	|		ПО втОстаткиТМЦВЭксплуатации.Номенклатура = втОстаткиАмортизацииТМЦВЭксплуатации.Номенклатура
	|			И втОстаткиТМЦВЭксплуатации.ПартияТМЦВЭксплуатации = втОстаткиАмортизацииТМЦВЭксплуатации.ПартияТМЦВЭксплуатации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ПартияТМЦВЭксплуатации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПеремещениеТЦМ.Ссылка,
	|	втПеремещениеТЦМ.Подразделение,
	|	втПеремещениеТЦМ.ПодразделениеПолучатель,
	|	втПеремещениеТЦМ.Номенклатура,
	|	втПеремещениеТЦМ.ПартияТМЦВЭксплуатации,
	|	втПеремещениеТЦМ.ПартияТМЦВЭксплуатацииКатегорияЭксплуатации КАК КатегорияЭксплуатации,
	|	втОстатки.НалоговоеНазначение,
	|	втПеремещениеТЦМ.Количество,
	|	ВЫБОР
	|		КОГДА втПеремещениеТЦМ.Количество = втОстатки.КоличествоОстаток
	|			ТОГДА втОстатки.СуммаОстаток
	|		КОГДА втОстатки.КоличествоОстаток = 0
	|			ТОГДА 0
	|		ИНАЧЕ втОстатки.СуммаОстаток * втПеремещениеТЦМ.Количество / втОстатки.КоличествоОстаток
	|	КОНЕЦ КАК Стоимость,
	|	ВЫБОР
	|		КОГДА втПеремещениеТЦМ.Количество = втОстатки.КоличествоОстаток
	|			ТОГДА втОстатки.СуммаНУОстаток
	|		КОГДА втОстатки.КоличествоОстаток = 0
	|			ТОГДА 0
	|		ИНАЧЕ втОстатки.СуммаНУОстаток * втПеремещениеТЦМ.Количество / втОстатки.КоличествоОстаток
	|	КОНЕЦ КАК СтоимостьНУ,
	|	ВЫБОР
	|		КОГДА втПеремещениеТЦМ.Количество = втОстатки.КоличествоОстаток
	|			ТОГДА втОстатки.СуммаАмортизацииОстаток
	|		КОГДА втОстатки.КоличествоОстаток = 0
	|			ТОГДА 0
	|		ИНАЧЕ втОстатки.СуммаАмортизацииОстаток * втПеремещениеТЦМ.Количество / втОстатки.КоличествоОстаток
	|	КОНЕЦ КАК СтоимостьАмортизации,
	|	ВЫБОР
	|		КОГДА втПеремещениеТЦМ.Количество = втОстатки.КоличествоОстаток
	|			ТОГДА втОстатки.СуммаАмортизацииНУОстаток
	|		КОГДА втОстатки.КоличествоОстаток = 0
	|			ТОГДА 0
	|		ИНАЧЕ втОстатки.СуммаАмортизацииНУОстаток * втПеремещениеТЦМ.Количество / втОстатки.КоличествоОстаток
	|	КОНЕЦ КАК СтоимостьАмортизацииНУ
	|ПОМЕСТИТЬ втСтоимостиТМЦВЭксплуатации
	|ИЗ
	|	втПеремещениеТЦМ КАК втПеремещениеТЦМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОстатки КАК втОстатки
	|		ПО втПеремещениеТЦМ.Номенклатура = втОстатки.Номенклатура
	|			И втПеремещениеТЦМ.ПартияТМЦВЭксплуатации = втОстатки.ПартияТМЦВЭксплуатации"+ ";";
	
КонецФункции

#КонецОбласти 

#КонецОбласти

#КонецОбласти

#Область Печать

// Функция формирует табличный документ с типовой печатной формой ОЗ-1
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьОЗ1(МассивОбъектов, ОбъектыПечати, ПараметрыВывода, ИмяМакета)
	
	УстановитьПривилегированныйРежим(Истина);
	
	КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
	
	УстановитьПривилегированныйРежим(Истина);
	
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПринятиеКУчету_ОЗ1";
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_UK_ОЗ1");
	
	ПервыйДокумент = Истина;
	
	Для Каждого Ссылка Из МассивОбъектов Цикл	
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПланСчетов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ втСчетаТЦМВЭксплуатации
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК ПланСчетов
		|ГДЕ
		|	ПланСчетов.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура)
		|	И ПланСчетов.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПартииМатериаловВЭксплуатации)
		|	И ПланСчетов.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
		|	И НЕ ПланСчетов.Забалансовый
		|	И ПланСчетов.Количественный
		|	И НЕ ПланСчетов.ЗапретитьИспользоватьВПроводках
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПеремещениеВЭксплуатацииТовары.Ссылка,
		|	ПеремещениеВЭксплуатацииТовары.Ссылка.Организация КАК Организация,
		|	ПеремещениеВЭксплуатацииТовары.Ссылка.Подразделение КАК Подразделение,
		|	ПеремещениеВЭксплуатацииТовары.Ссылка.ПодразделениеПолучатель,
		|	ПеремещениеВЭксплуатацииТовары.Номенклатура КАК Номенклатура,
		|	ПеремещениеВЭксплуатацииТовары.Характеристика,
		|	ПеремещениеВЭксплуатацииТовары.ПартияТМЦВЭксплуатации КАК ПартияТМЦВЭксплуатации,
		|	ПеремещениеВЭксплуатацииТовары.ПартияТМЦВЭксплуатации.КатегорияЭксплуатации,
		|	ПеремещениеВЭксплуатацииТовары.ФизическоеЛицо КАК Сдал,
		|	ПеремещениеВЭксплуатацииТовары.ФизическоеЛицоПолучатель КАК Принял,
		|	СУММА(ПеремещениеВЭксплуатацииТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ втПеремещениеТЦМ
		|ИЗ
		|	Документ.ПеремещениеВЭксплуатации.Товары КАК ПеремещениеВЭксплуатацииТовары
		|ГДЕ
		|	ПеремещениеВЭксплуатацииТовары.Ссылка = &Ссылка
		|	И ПеремещениеВЭксплуатацииТовары.ПартияТМЦВЭксплуатации.КатегорияЭксплуатации.ВидТМЦ В (ЗНАЧЕНИЕ(Перечисление.ВидыТМЦВЭксплуатации.МалоценныйНеоборотныйАктив), ЗНАЧЕНИЕ(Перечисление.ВидыТМЦВЭксплуатации.БиблиотечныеФонды))
		|
		|СГРУППИРОВАТЬ ПО
		|	ПеремещениеВЭксплуатацииТовары.Ссылка,
		|	ПеремещениеВЭксплуатацииТовары.Ссылка.Организация,
		|	ПеремещениеВЭксплуатацииТовары.Ссылка.Подразделение,
		|	ПеремещениеВЭксплуатацииТовары.Ссылка.ПодразделениеПолучатель,
		|	ПеремещениеВЭксплуатацииТовары.Номенклатура,
		|	ПеремещениеВЭксплуатацииТовары.ПартияТМЦВЭксплуатации,
		|	ПеремещениеВЭксплуатацииТовары.ПартияТМЦВЭксплуатации.КатегорияЭксплуатации,
		|	ПеремещениеВЭксплуатацииТовары.ФизическоеЛицо,
		|	ПеремещениеВЭксплуатацииТовары.ФизическоеЛицоПолучатель,
		|	ПеремещениеВЭксплуатацииТовары.Характеристика
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Подразделение,
		|	Номенклатура,
		|	ПартияТМЦВЭксплуатации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ПартииТМЦВЭксплуатации) КАК ПартияТМЦВЭксплуатации,
		|	ХозрасчетныйОстатки.НалоговоеНазначение,
		|	ЕСТЬNULL(ХозрасчетныйОстатки.КоличествоОстатокДт, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстатокДт, 0) КАК СуммаОстаток
		|ПОМЕСТИТЬ втОстатки
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&Период,
		|			Счет В
		|				(ВЫБРАТЬ
		|					Т.Ссылка
		|				ИЗ
		|					втСчетаТЦМВЭксплуатации КАК Т),
		|			,
		|			(Организация, Подразделение, Субконто1, Субконто2) В
		|				(ВЫБРАТЬ
		|					Т.Организация,
		|					Т.Подразделение,
		|					Т.Номенклатура,
		|					Т.ПартияТМЦВЭксплуатации
		|				ИЗ
		|					втПеремещениеТЦМ КАК Т)) КАК ХозрасчетныйОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	ПартияТМЦВЭксплуатации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПеремещениеТЦМ.Ссылка КАК Ссылка,
		|	втПеремещениеТЦМ.Ссылка.Номер КАК НомерАкта,
		|	втПеремещениеТЦМ.Ссылка.Дата КАК ДатаАкта,
		|	втПеремещениеТЦМ.Ссылка.Организация КАК Организация,
		|	втПеремещениеТЦМ.Ссылка.Организация.Префикс КАК Префикс,
		|	втПеремещениеТЦМ.Подразделение КАК СдалоПодразделение,
		|	втПеремещениеТЦМ.ПодразделениеПолучатель КАК ПринялоПодразделение,
		|	""Переміщення"" КАК ВидОперации,
		|	втПеремещениеТЦМ.Номенклатура КАК Номенклатура,
		|	втПеремещениеТЦМ.Характеристика,
		|	втПеремещениеТЦМ.ПартияТМЦВЭксплуатации,
		|	втПеремещениеТЦМ.ПартияТМЦВЭксплуатацииКатегорияЭксплуатации КАК КатегорияЭксплуатации,
		|	втПеремещениеТЦМ.Количество,
		|	втПеремещениеТЦМ.ПартияТМЦВЭксплуатацииКатегорияЭксплуатации.СчетУчета КАК СчетДт,
		|	втПеремещениеТЦМ.ПартияТМЦВЭксплуатацииКатегорияЭксплуатации.СчетУчета КАК СчетКт,
		|	втПеремещениеТЦМ.Сдал,
		|	втПеремещениеТЦМ.Принял,
		|	ВЫБОР
		|		КОГДА втПеремещениеТЦМ.Количество = втОстатки.КоличествоОстаток
		|			ТОГДА втОстатки.СуммаОстаток
		|		КОГДА втОстатки.КоличествоОстаток = 0
		|			ТОГДА 0
		|		ИНАЧЕ втОстатки.СуммаОстаток * втПеремещениеТЦМ.Количество / втОстатки.КоличествоОстаток
		|	КОНЕЦ КАК ПервоначальнаяСтоимость
		|ИЗ
		|	втПеремещениеТЦМ КАК втПеремещениеТЦМ
		|		ЛЕВОЕ СОЕДИНЕНИЕ втОстатки КАК втОстатки
		|		ПО втПеремещениеТЦМ.Номенклатура = втОстатки.Номенклатура
		|			И втПеремещениеТЦМ.ПартияТМЦВЭксплуатации = втОстатки.ПартияТМЦВЭксплуатации";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Период", Ссылка.МоментВремени());
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		ВыборкаПоКомиссии = ОбщегоНазначенияБПВызовСервера.ПолучитьСведенияОКомиссии(Ссылка);
		
		ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
							
		ОтветственныеЛица = ОтветственныеЛицаБП.ОтветственныеЛица(Ссылка.Организация, Ссылка.Дата);
		
		Пока Выборка.Следующий() Цикл

			ОбластьМакета = Макет.ПолучитьОбласть("ОЗ1");
			Параметры     = ОбластьМакета.Параметры;
			Параметры.Заполнить(Выборка);
			Параметры.Заполнить(ВыборкаПоКомиссии);

			Параметры.Валюта = ВалютаРегламентированногоУчета;
			
			СведенияОбОрганизации	= ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Выборка.Организация, Ссылка.Дата);	
			Параметры.Организация	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,",,КодЯзыкаПечать);
			Параметры.ЕДРПОУ		= СведенияОбОрганизации.КодПоЕДРПОУ;
			
			Параметры.НаименованиеОС = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
													Выборка.Номенклатура,
													Выборка.Характеристика);
			
			ОсновныеСотрудникиФизическихЛицПринял = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(Выборка.Принял, Истина, Ссылка.Организация, Ссылка.Дата);
			Если ЗначениеЗаполнено(ОсновныеСотрудникиФизическихЛицПринял) Тогда
				Для каждого Строка Из ОсновныеСотрудникиФизическихЛицПринял Цикл
				    ДанныеФизЛицаПолучил = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Строка.Сотрудник, "Должность", Ссылка.Дата);			
				КонецЦикла;
				Для каждого СтрокаДанныеПолучил Из ДанныеФизЛицаПолучил Цикл			
					ОбластьМакета.Параметры.ПолучилДолжность= СтрокаДанныеПолучил.Должность;
					ОбластьМакета.Параметры.ПолучилФИО		= СтрокаДанныеПолучил.ФизическоеЛицо;			
				КонецЦикла;
			КонецЕсли;
			ОсновныеСотрудникиФизическихЛицСдал = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(Выборка.Сдал, Истина, Ссылка.Организация, Ссылка.Дата);
			Если ЗначениеЗаполнено(ОсновныеСотрудникиФизическихЛицСдал) Тогда		
				Для каждого Строка Из ОсновныеСотрудникиФизическихЛицСдал Цикл
					ДанныеФизЛицаСдал = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Строка.Сотрудник, "Должность", Ссылка.Дата);
				КонецЦикла;
				Для каждого СтрокаДанныеСдал Из ДанныеФизЛицаСдал Цикл
					ОбластьМакета.Параметры.СдалДолжность 	= СтрокаДанныеСдал.Должность;
					ОбластьМакета.Параметры.СдалФИО	 		= СтрокаДанныеСдал.ФизическоеЛицо;
				КонецЦикла;			
			КонецЕсли;
			
			ОбластьМакета.Параметры.ГлавныйБухгалтер 	= ОтветственныеЛица.ГлавныйБухгалтерПредставление;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;

		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Ссылка);
		
	КонецЦикла;	
		
	Возврат ТабДокумент;

КонецФункции // ПечатьОЗ1()

// Функция формирует печатную форму документа
//
Функция ПечатьМШ7(МассивОбъектов, ОбъектыПечати, ПараметрыВывода, ИмяМакета, Сдача)
	
	УстановитьПривилегированныйРежим(Истина);
	
	КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
	
	ЗапросПоДокументам = Новый Запрос;
	ЗапросПоДокументам.Текст =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Номер КАК Номер,
	|	Документ.Дата КАК Дата,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Документ.Подразделение) КАК Подразделение,
	|	Документ.Организация КАК Организация,
	|	Документ.Организация.Префикс КАК Префикс,
	|	ВЫБОР
	|		КОГДА &Сдача
	|			ТОГДА ""Переміщення (здача)""
	|		ИНАЧЕ ""Переміщення (видача)""
	|	КОНЕЦ КАК КодОперации,
	|	Документ.Товары.(
	|		НомерСтроки КАК НомерПП,
	|		Номенклатура КАК Номенклатура,
	|		Номенклатура.Код КАК НоменклатурныйНомерКод,
	|		Номенклатура.Артикул КАК НоменклатурныйНомерАртикул,
	|		Характеристика.НаименованиеПолное КАК Характеристика,
	|		Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|		Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|		Количество КАК Количество,
	|		ВЫБОР
	|			КОГДА &Сдача
	|				ТОГДА Документ.Товары.ФизическоеЛицо
	|			ИНАЧЕ Документ.Товары.ФизическоеЛицоПолучатель
	|		КОНЕЦ КАК Сотрудник,
	|		ПартияТМЦВЭксплуатации.Дата КАК ДатаПоступленияВЭксплуатацию,
	|		ПартияТМЦВЭксплуатации.СрокЭксплуатации КАК СрокСлужбы
	|	) КАК ТаблицаТовары
	|ИЗ
	|	Документ.ПеремещениеВЭксплуатации КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|	И Документ.Товары.ПартияТМЦВЭксплуатации.КатегорияЭксплуатации.ВидТМЦ = &ВидТМЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Ссылка,
	|	НомерПП";
	
	ЗапросПоДокументам.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросПоДокументам.УстановитьПараметр("Сдача",Сдача);
	ЗапросПоДокументам.УстановитьПараметр("ВидТМЦ",Перечисления.ВидыТМЦВЭксплуатации.МалоценныйБыстроизнашивающийсяПредмет);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеМалоценныхАктивовВЭксплуатации_МШ7";
	
	ТоварКод = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	Если Не ЗначениеЗаполнено(ТоварКод) Тогда
		ТоварКод = "Код";
	КонецЕсли;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_UK_МШ7");
	
	
	Если ЗапросПоДокументам.Выполнить().Пустой() Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("НетДанных");
			ТабДокумент.Вывести(ОбластьМакета);
			
			Возврат ТабДокумент;
			
		КонецЕсли;

	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодписи   = Макет.ПолучитьОбласть("Подвал");
	ОбластьСтрока	 = Макет.ПолучитьОбласть("Строка");
	
	ПервыйДокумент = Истина;
	
	ВыборкаДокументы = ЗапросПоДокументам.Выполнить().Выбрать();
	Пока ВыборкаДокументы.Следующий() Цикл
	
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаДокументы);
		СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДокументы.Организация, ВыборкаДокументы.Дата);	
		ОбластьЗаголовок.Параметры.ПредставлениеОрганизации  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,",,КодЯзыкаПечать);
		ОбластьЗаголовок.Параметры.КодПоЕДРПОУ  = СведенияОбОрганизации.КодПоЕДРПОУ;	
		ОбластьЗаголовок.Параметры.НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ВыборкаДокументы.Номер, Ложь, Истина);
		ОбластьЗаголовок.Параметры.ДатаДокумента =  ВыборкаДокументы.Дата;
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабДокумент, Макет, ОбластьЗаголовок, ВыборкаДокументы.Ссылка);
		ТабДокумент.Вывести(ОбластьЗаголовок);
		
		// Вывод строк документа.
		ВыборкаСтроки = ВыборкаДокументы.ТаблицаТовары.Выбрать();
		Пока ВыборкаСтроки.Следующий() Цикл
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаСтроки);
			
			Если ТоварКод = "Артикул" Тогда
				ОбластьСтрока.Параметры.НоменклатурныйНомер = ВыборкаСтроки.НоменклатурныйНомерАртикул;
			Иначе
				ОбластьСтрока.Параметры.НоменклатурныйНомер = ВыборкаСтроки.НоменклатурныйНомерКод;
			КонецЕсли;
			
			ОбластьСтрока.Параметры.МатериалНаименование = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
				ВыборкаСтроки.Номенклатура,
				ВыборкаСтроки.Характеристика);
				
			ТабДокумент.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		// Вывод подвала.
		ТабДокумент.Вывести(ОбластьПодписи);

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументы.Ссылка);

	КонецЦикла;
		
	Возврат ТабДокумент;

КонецФункции // ПечатьМШ7()

// Функция получает данные для формирования печатной формы М-11
//
Функция ПолучитьДанныеДляПечатнойФормыМ11(ПараметрыПечати, МассивДокументов) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(
		МассивДокументов, 
		МенеджерВременныхТаблиц,
		,
		Новый Структура("Руководитель, ГлавныйБухгалтер", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер)
	);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	   |	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)КАК Упаковка,
	|	Товары.Количество КАК Количество,
	|	Товары.ПартияТМЦВЭксплуатации КАК ПартияТМЦВЭксплуатации,
	|	Товары.ФизическоеЛицо,
	|	Товары.ФизическоеЛицоПолучатель
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	Документ.ПеремещениеВЭксплуатации.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка В(&МассивДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// 		[1] - Выборка по шапкам документов
	|ВЫБРАТЬ
	|	Документы.Ссылка КАК Ссылка,
	|	Документы.Номер КАК Номер,
	|	Документы.Дата КАК ДатаДокумента,
	|	Документы.Дата КАК ДатаСоставления,
	|	Документы.Организация КАК Организация,
	|	Документы.Организация.Префикс КАК Префикс,
	|	НЕОПРЕДЕЛЕНО КАК Склад,
	|	Документы.Подразделение КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК КладовщикОтправитель,
	|	НЕОПРЕДЕЛЕНО КАК ДолжностьКладовщикаОтправителя,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК РуководительОтправителя,
	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителяОтправителя,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтерОтправителя,
	|	""Переміщення"" КАК КодВидаОперации,
	|	НЕОПРЕДЕЛЕНО КАК Заказ,
	|	НЕОПРЕДЕЛЕНО КАК УчетныйВидЦены,
	|	НЕОПРЕДЕЛЕНО КАК УчетныйВидЦеныВалютаЦены
	|ИЗ
	|	Документ.ПеремещениеВЭксплуатации КАК Документы
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО Документы.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|ГДЕ
	|	Документы.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокумента,
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Номенклатура.НаименованиеПолное КАК НоменклатураНаименование,
	|	Товары.Номенклатура.Код КАК НоменклатурныйНомерКод,
	|	Товары.Номенклатура.Артикул КАК НоменклатурныйНомерАртикул,
	|	Товары.Характеристика.НаименованиеПолное КАК Характеристика,
	|	НЕОПРЕДЕЛЕНО КАК Упаковка,
	|	&ТекстЗапросаНаименованиеЕдиницыИзмерения КАК ЕдиницаИзмеренияНаименование,
	|	&ТекстЗапросаКодЕдиницыИзмерения КАК ЕдиницаИзмеренияКод,
	|	Товары.Количество КАК Количество,
	|	0 КАК Сумма,
	|	0 КАК Цена,
	|	Товары.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Товары КАК Товары
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка 
	|";
	
		
			
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ТекстЗапросаНаименованиеЕдиницыИзмерения",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
			"Наименование",
			"Товары.Упаковка",
			"Товары.Номенклатура"));
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ТекстЗапросаКодЕдиницыИзмерения",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
			"Код",
			"Товары.Упаковка",
			"Товары.Номенклатура"));
		
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	РезультатПакетаЗапросов = Запрос.ВыполнитьПакет();
	// Пакет запросов:
	// 		[0] - Временная таблица по табличной части документа
   	// 		[1] - Выборка по шапкам документов
	// 		[2] - Выборка по табличным частям документов
	
	Возврат Новый Структура(
		"РезультатПоШапке, РезультатПоТабличнойЧасти",
		РезультатПакетаЗапросов[1],
		РезультатПакетаЗапросов[2]);
	
КонецФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Ведомость МШ-7 (сдача)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "МШ7с";
	КомандаПечати.Представление = НСтр("ru='Ведомость МШ-7 (сдача)';uk='Відомість МШ-7 (здача)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Ведомость МШ-7 (выдача)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "МШ7в";
	КомандаПечати.Представление = НСтр("ru='Ведомость МШ-7 (выдача)';uk='Відомість МШ-7 (видача)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;

	// Требование-накладная (М-11)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьМ11";
	КомандаПечати.Идентификатор = "М11";
	КомандаПечати.Представление = НСтр("ru='Требование-накладная (М-11)';uk='Вимога-накладна (М-11)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Форма ОЗ-1
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ОЗ1";
	КомандаПечати.Представление = НСтр("ru='Форма ОЗ-1';uk='Форма ОЗ-1'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МШ7с") Тогда
		ИмяМакета = "";
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МШ7с", НСтр("ru='Ведомость МШ-7 (сдача)';uk='Відомість МШ-7 (здача)'"),
			ПечатьМШ7(МассивОбъектов, ОбъектыПечати, ПараметрыВывода, ИмяМакета, Истина), , ИмяМакета);
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МШ7в") Тогда
		ИмяМакета = "";
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МШ7в", НСтр("ru='Ведомость МШ-7 (выдача)';uk='Відомість МШ-7 (видача)'"),
			ПечатьМШ7(МассивОбъектов, ОбъектыПечати, ПараметрыВывода, ИмяМакета, Ложь), , ИмяМакета);
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОЗ1") Тогда
		ИмяМакета = "";
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ОЗ1", НСтр("ru='Форма ОЗ-1';uk='Форма ОЗ-1'"),
			ПечатьОЗ1(МассивОбъектов, ОбъектыПечати, ПараметрыВывода, ИмяМакета), , ИмяМакета);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#КонецЕсли