
#Область СлужебныйПрограммныйИнтерфейс

//КонецПроцедуры

//Процедура ОтменитьИсправление(Форма, ОписаниеТаблицы) Экспорт 
//	
//	ИмяТаблицы = ОписаниеТаблицы.ИмяТаблицы;
//	
//	ДанныеСтроки = Форма.Элементы[ИмяТаблицы].ТекущиеДанные;
//	
//	Если ДанныеСтроки = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	КонтролируемыеПоля = Форма["КонтролируемыеПоля" + ИмяТаблицы];
//	Для Каждого ЭлементСтруктуры Из КонтролируемыеПоля Цикл
//		ДанныеСтроки[ЭлементСтруктуры.Ключ] = Ложь;
//	КонецЦикла;
//	Если ДанныеСтроки.Свойство("ФиксСтрока") Тогда
//		ДанныеСтроки.ФиксСтрока = Ложь;
//	КонецЕсли;
//	
//	// Перезаполнить данные документа по сотруднику.
//	//Форма.ПерезаполнитьНачисленияСотрудника(ДанныеСтроки[ОписаниеТаблицы.ИмяРеквизитаСотрудник], Ложь);
//		
//	// Уже после расчета заполняем значения контролируемых полей.
//	СтарыеЗначенияКонтролируемыхПолей = Форма.ПолучитьСтарыеЗначенияКонтролируемыхПолей();
//	УстановитьЗначенияКонтролируемыхПолей(ОписаниеТаблицы.ИмяТаблицы, ДанныеСтроки, КонтролируемыеПоля, СтарыеЗначенияКонтролируемыхПолей);
//	
//КонецПроцедуры


//Процедура УстановитьЗначенияКонтролируемыхПолей(ИмяТаблицы, ДанныеСтроки, КонтролируемыеПоля, СтарыеЗначенияКонтролируемыхПолей) Экспорт
//	
//	Если ДанныеСтроки = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Для Каждого ЭлементСтруктуры Из КонтролируемыеПоля Цикл
//		Для Каждого ИмяПоля Из ЭлементСтруктуры.Значение Цикл
//			Если ДанныеСтроки.Свойство(ИмяПоля) Тогда
//				СтарыеЗначенияКонтролируемыхПолей[ИмяТаблицы + ИмяПоля] = ДанныеСтроки[ИмяПоля];
//			КонецЕсли;
//		КонецЦикла;
//	КонецЦикла;
//	
//КонецПроцедуры

//Процедура ДокументыВыполненияНачисленийПриАктивацииСтроки(Форма, ИмяТаблицы, НачисленияВСтроках) Экспорт 
//	
//	ДанныеСтроки = Форма.Элементы[ИмяТаблицы].ТекущиеДанные;
//	
//	Если ДанныеСтроки <> Неопределено Тогда
//		РеквизитКонтроляПолей = "КонтролируемыеПоля" + ИмяТаблицы;
//		КонтролируемыеПоля = Форма[РеквизитКонтроляПолей];
//		УстановитьЗначенияКонтролируемыхПолей(ИмяТаблицы, ДанныеСтроки, КонтролируемыеПоля, Форма.ПолучитьСтарыеЗначенияКонтролируемыхПолей());
//	КонецЕсли;
//	
//КонецПроцедуры
//-- НЕУКР


#КонецОбласти
