#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПриСозданииНаСервере = Истина;
	Настройки.Вставить("РазрешеноМенятьВарианты", Ложь);
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   Отказ - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//   "УправляемаяФорма.ПриСозданииНаСервере" в синтаксис-помощнике.
//
Процедура ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если ЭтаФорма.Параметры.Свойство("КлючВарианта") Тогда
		Если ЭтаФорма.Параметры.КлючВарианта = "СверкаПоРегистраторам" Тогда
			ЭтаФорма.КлючТекущегоВарианта = ЭтаФорма.Параметры.КлючВарианта;
		Иначе
			ЭтаФорма.КлючТекущегоВарианта = "СверкаБезПодразделений";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КлючВарианта = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.КлючВарианта;
	
	ВерсияКонфигурации = Лев(Метаданные.Версия, 3);
	
	ПериодОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ПериодОтчета");
	Если ПериодОтчета <> Неопределено Тогда
		ЭтотОбъект.НачалоПериода = ПериодОтчета.Значение.ДатаНачала;
		ЭтотОбъект.КонецПериода = ?(ЗначениеЗаполнено(ПериодОтчета.Значение.ДатаОкончания), КонецДня(ПериодОтчета.Значение.ДатаОкончания), Дата(3999, 1, 1));
	КонецЕсли;
	
	ПараметрОрганизация = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Организация");
	ЭтотОбъект.МассивОрганизаций = ?(ПараметрОрганизация.Использование 
										и ЗначениеЗаполнено(ПараметрОрганизация.Значение), ПараметрОрганизация.Значение, ДоступныеОрганизации());
	ПараметрРазделУчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "РазделУчета");
	ЭтотОбъект.РазделУчета = ?(ПараметрРазделУчета.Использование, ПараметрРазделУчета.Значение, 0);
	
	//настроим представления счетов
	Параметр = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ПредставлениеСчетовПоКоду");
	ПредставлениеПоКоду = Истина;
	Если Параметр <> Неопределено Тогда
		ПредставлениеПоКоду = Параметр.Значение;
	КонецЕсли;
	
	ПолеСчета = СхемаКомпоновкиДанных.НаборыДанных.ИсходныеДанные.Поля.Найти("СчетБУ");
	Если ПолеСчета <> Неопределено Тогда
		ПолеСчета.ВыражениеПредставления = ?(ПредставлениеПоКоду, "СчетБУ.Код", "СчетБУ.Код+"", ""+СчетБУ.Наименование");
	КонецЕсли;
	
	ВычисляемоеПолеБУ =  СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("БУ");
	Если ВычисляемоеПолеБУ <> Неопределено Тогда 
		ВычисляемоеПолеБУ.Выражение = """" + НСтр("ru='БУ';uk='БО'") + """";
	КонецЕсли;
	ВычисляемоеПолеОУ =  СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ОУ");
	Если ВычисляемоеПолеОУ <> Неопределено Тогда 
		ВычисляемоеПолеОУ.Выражение = """" + НСтр("ru='ОУ';uk='ОО'") + """";
	КонецЕсли;
	ВычисляемоеПолеОтклонение =  СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("Отклонение");
	Если ВычисляемоеПолеОтклонение <> Неопределено Тогда 
		ВычисляемоеПолеОтклонение.Выражение = """" + НСтр("ru='ОУ-БУ';uk='ОО-БО'") + """";
	КонецЕсли;
	
	ДокументРезультат.Очистить();
	
	ВременныеТаблицы = ЗаполнитьВспомогательныеТаблицы();
	
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("КлючВарианта", КлючВарианта);
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
		СхемаКомпоновкиДанных,
		НастройкиКомпоновкиДанных,
		ДанныеРасшифровки);
	
	ВнешниеНаборыДанных = Новый Структура("ТЗСебестоимостьТоваров, ТЗДенежныеСредства, ТЗРасчетыСКонтрагентами, ТЗПроизводственныеЗатраты",
								ТаблицаСебестоимостьТоваров(ВременныеТаблицы, КлючВарианта),
								ТаблицаДенежныеСредства(ВременныеТаблицы, КлючВарианта),
								ТаблицаРасчетыСКонтрагентами(ВременныеТаблицы, КлючВарианта, ВерсияКонфигурации),
								ТаблицаПроизводственныеЗатраты(ВременныеТаблицы, КлючВарианта, ВерсияКонфигурации));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	ВременныеТаблицы.Закрыть();
	
	ПостОбработка(ДокументРезультат, ДанныеРасшифровки, КлючВарианта);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьВспомогательныеТаблицы()
	
	ВременныеТаблицы = Новый МенеджерВременныхТаблиц;
	
	Если Метаданные.ОбщиеМодули.Найти("РеглУчетВыборкиСерверПовтИсп") <> Неопределено Тогда
		РеглУчетВыборкиСервер = ОбщегоНазначения.ОбщийМодуль("РеглУчетВыборкиСерверПовтИсп");
	Иначе
		РеглУчетВыборкиСервер = ОбщегоНазначения.ОбщийМодуль("РеглУчетВыборкиСервер");
	КонецЕсли;

	ЗапросСчетов = РеглУчетВыборкиСервер.ЗапросПланаСчетов();
	ЗапросСчетов.МенеджерВременныхТаблиц = ВременныеТаблицы;
	ЗапросСчетов.Выполнить();
	
	ЗапросСчетов = РеглУчетВыборкиСервер.ЗапросСчетов();
	ЗапросСчетов.МенеджерВременныхТаблиц = ВременныеТаблицы;
	ЗапросСчетов.Выполнить();

	ЗапросСчетов = РеглУчетВыборкиСервер.ЗапросСчетовПоУмолчанию();
	ЗапросСчетов.МенеджерВременныхТаблиц = ВременныеТаблицы;
	ЗапросСчетов.Выполнить();
	
	Возврат ВременныеТаблицы;

КонецФункции

Функция ТаблицаСебестоимостьТоваров(ВременныеТаблицы, КлючВарианта)
	
	Если не (ЭтотОбъект.РазделУчета = 0 или ЭтотОбъект.РазделУчета = 2) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ?(КлючВарианта = "СверкаПоРегистраторам",
					ТекстЗапросаСебестоимостьПоРегистраторам(),
					ТекстЗапросаСебестоимость());
	
	Если Найти(КлючВарианта, "БезПодразделений") <> 0 или КлючВарианта = "СверкаПоРегистраторам" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Подзапрос.Подразделение,", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", ЭтотОбъект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.КонецПериода);
	Запрос.УстановитьПараметр("КонецПериодаОстатков", Новый Граница(ЭтотОбъект.КонецПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("МассивОрганизаций", ЭтотОбъект.МассивОрганизаций);
	Запрос.УстановитьПараметр("ФормироватьВидыЗапасовПоГруппамФинансовогоУчета", 
				ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоГруппамФинансовогоУчета"));
	
	МассивВидовСубконто = Новый Массив;
	МассивВидовСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	МассивВидовСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
	Запрос.УстановитьПараметр("ВидыСубконтоНоменклатураСклад", МассивВидовСубконто);
	
	Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
	
	ТЗ = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	Возврат ТЗ;
	
КонецФункции

Функция ТаблицаДенежныеСредства(ВременныеТаблицы, КлючВарианта)
	
	Если не (ЭтотОбъект.РазделУчета = 0 или ЭтотОбъект.РазделУчета = 1) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ?(КлючВарианта = "СверкаПоРегистраторам",
					ТекстЗапросаДенежныеСредстваПоРегистраторам(),
					ТекстЗапросаДенежныеСредства());
	
	Если Найти(КлючВарианта, "БезПодразделений") <> 0 или КлючВарианта = "СверкаПоРегистраторам" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТ_ДенежныеСредстваИсходныеДанные.Подразделение,", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", ЭтотОбъект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.КонецПериода);
	Запрос.УстановитьПараметр("КонецПериодаОстатков", Новый Граница(ЭтотОбъект.КонецПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("МассивОрганизаций", ЭтотОбъект.МассивОрганизаций);
	Запрос.УстановитьПараметр("РазделУчета", ЭтотОбъект.РазделУчета);
	
	Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
	
	ТЗ = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	
	ТЗ1 = Новый ТаблицаЗначений;
	Для Каждого Колонка из ТЗ.Колонки Цикл
		ТЗ1.Колонки.Добавить(Колонка.Имя, Новый ОписаниеТипов(Колонка.ТипЗначения, "NULL"));
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТЗ, ТЗ1);
	
	Возврат ТЗ1;
	
КонецФункции

Функция ТаблицаРасчетыСКонтрагентами(ВременныеТаблицы, КлючВарианта, ВерсияКонфигурации)
	
	Если не (ЭтотОбъект.РазделУчета = 0 или ЭтотОбъект.РазделУчета = 3
		 или ЭтотОбъект.РазделУчета = 4 или ЭтотОбъект.РазделУчета = 5 
		 или ЭтотОбъект.РазделУчета = 6) Тогда
		 
		Возврат Новый ТаблицаЗначений;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ?(КлючВарианта = "СверкаПоРегистраторам",
					ТекстЗапросаРасчетыСКонтрагентамиПоРегистраторам(),
					ТекстЗапросаРасчетыСКонтрагентами());
	
	Если Найти(КлючВарианта, "БезПодразделений") <> 0 или КлючВарианта = "СверкаПоРегистраторам" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Подзапрос.Подразделение,", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", ЭтотОбъект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.КонецПериода);
	Запрос.УстановитьПараметр("КонецПериодаОстатков", Новый Граница(ЭтотОбъект.КонецПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("МассивОрганизаций", ЭтотОбъект.МассивОрганизаций);
	Запрос.УстановитьПараметр("РазделУчета", ЭтотОбъект.РазделУчета);
	
	СчетаУчетаРасчетов5 = Новый Массив; // 5 - Расчеты по кредитам и депозитам
	СчетаУчетаРасчетов5.Добавить(ПланыСчетов.Хозрасчетный.ДругиеСчетаВБанкеВНациональнойВалюте);
	СчетаУчетаРасчетов5.Добавить(ПланыСчетов.Хозрасчетный.ДругиеСчетаВБанкеВИностраннойВалюте);
	
	СчетаУчетаРасчетов6 = Новый Массив; // 6 - Прочие расчеты с контрагентами
	СтруктураСчетовУчета = Обработки.НастройкаОтраженияДокументовВРеглУчете.ДоступныеСчетаУчетаРасчетов();
	Для каждого ЭлементСтруктуры Из СтруктураСчетовУчета Цикл
		Для каждого Счет из ЭлементСтруктуры.Значение Цикл
			Если НЕ (Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками)    		ИЛИ Счет = ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками
				ИЛИ Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками)      		ИЛИ Счет = ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками
				ИЛИ Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ДругиеСчетаВБанкеВНациональнойВалюте)  		ИЛИ Счет = ПланыСчетов.Хозрасчетный.ДругиеСчетаВБанкеВНациональнойВалюте
				ИЛИ Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ДругиеСчетаВБанкеВИностраннойВалюте)   		ИЛИ Счет = ПланыСчетов.Хозрасчетный.ДругиеСчетаВБанкеВИностраннойВалюте
				ИЛИ Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасчетыСДругимиДебиторами) ИЛИ Счет = ПланыСчетов.Хозрасчетный.РасчетыСДругимиДебиторами) Тогда
				
				СчетаУчетаРасчетов6.Добавить(Счет);
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СчетаУчетаРасчетов5", СчетаУчетаРасчетов5);
	Запрос.УстановитьПараметр("СчетаУчетаРасчетов6", СчетаУчетаРасчетов6);
	
	ХозОперацииВозврата = Новый Массив;
	Для каждого ХозОперация из Перечисления.ХозяйственныеОперации Цикл
		Если ВРег(Лев(ХозОперация, 7)) = "ВОЗВРАТ" Тогда
			ХозОперацииВозврата.Добавить(ХозОперация);
		КонецЕсли;
	КонецЦикла;
	Запрос.УстановитьПараметр("ХозОперацииВозврата", ХозОперацииВозврата);
	
	Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
	
	ТЗ = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	Возврат ТЗ;
	
КонецФункции

Функция ТаблицаПроизводственныеЗатраты(ВременныеТаблицы, КлючВарианта, ВерсияКонфигурации)
	
	Если не (ЭтотОбъект.РазделУчета = 0 или ЭтотОбъект.РазделУчета = 7) Тогда
		
		Возврат Новый ТаблицаЗначений;
		
	КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.Текст = ?(КлючВарианта = "СверкаПоРегистраторам",
					ТекстЗапросаПроизводственныеЗатратыПоРегистраторам(),
					ТекстЗапросаПроизводственныеЗатраты());
                    
	
	Если Найти(КлючВарианта, "БезПодразделений") <> 0 или КлючВарианта = "СверкаПоРегистраторам" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Подзапрос.Подразделение,", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", ЭтотОбъект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.КонецПериода);
	Запрос.УстановитьПараметр("КонецПериодаОстатков", Новый Граница(ЭтотОбъект.КонецПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("МассивОрганизаций", ЭтотОбъект.МассивОрганизаций);
	Запрос.УстановитьПараметр("РазделУчета", ЭтотОбъект.РазделУчета);
    ВидСубконтоСтатьиЗатрат = Новый Массив;
    ВидСубконтоСтатьиЗатрат.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
    Запрос.УстановитьПараметр("ВидСубконтоСтатьиЗатрат", ВидСубконтоСтатьиЗатрат);
	
	Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
	
	ТЗ = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	Возврат ТЗ;
	
КонецФункции

#Область ТекстыЗапросов

Функция ТекстЗапросаСебестоимость()
	
	Возврат 
	"ВЫБРАТЬ
	|	НастройкиОтражения.Организация,
	|	НастройкиОтражения.АналитикаУчета КАК ГруппаФинансовогоУчета,
	|	НастройкиОтражения.МестоУчета,
	|	НастройкиОтражения.СчетУчета,
	|	НастройкиОтражения.ВидСчетаРеглУчета,
	|	НастройкиОтражения.ИспользоватьСубконто,
	|	НастройкиОтражения.ВидСубконто,
	|	НастройкиОтражения.Субконто
	|ПОМЕСТИТЬ ВТ_НастройкиОтражения
	|ИЗ
	|	Счета КАК НастройкиОтражения
	|ГДЕ
	|	НастройкиОтражения.СчетУчета <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НастройкиОтражения.Организация,
	|	ГруппаФинансовогоУчета,
	|	НастройкиОтражения.МестоУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиОтраженияПоУмолчанию.АналитикаУчета КАК ГруппаФинансовогоУчета,
	|	НастройкиОтраженияПоУмолчанию.ВидСчетаРеглУчета,
	|	НастройкиОтраженияПоУмолчанию.СчетУчета,
	|	НастройкиОтраженияПоУмолчанию.ИспользоватьСубконто,
	|	НастройкиОтраженияПоУмолчанию.ВидСубконто,
	|	НастройкиОтраженияПоУмолчанию.Субконто
	|ПОМЕСТИТЬ ВТ_НастройкиОтраженияПоУмолчанию
	|ИЗ
	|	СчетаПоУмолчанию КАК НастройкиОтраженияПоУмолчанию
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГруппаФинансовогоУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Подзапрос.Организация,
	|	Подзапрос.АналитикаУчетаНоменклатуры,
	|	Подзапрос.ВидЗапасов,
	|	Подзапрос.РазделУчета,
	|	СУММА(Подзапрос.НачальныйОстаток) КАК НачальныйОстаток,
	|	СУММА(Подзапрос.Приход + Подзапрос.ПриходКорректировкаНДС) КАК Приход,
	|	СУММА(Подзапрос.Расход + Подзапрос.РасходКорректировкаНДС) КАК Расход,
	|	СУММА(Подзапрос.КонечныйОстаток) КАК КонечныйОстаток
	|ПОМЕСТИТЬ ВТ_СебестоимостьТоваровОстаткиИОбороты
	|ИЗ
	|	(ВЫБРАТЬ
	|		СебестоимостьТоваров.Организация КАК Организация,
	|		СебестоимостьТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		СебестоимостьТоваров.ВидЗапасов КАК ВидЗапасов,
	|		СебестоимостьТоваров.РазделУчета КАК РазделУчета,
	|		ВЫБОР
	|			КОГДА СебестоимостьТоваров.ХозяйственнаяОперация В (
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратИзПроизводства),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика))
	|				ТОГДА 0
    |           КОГДА СебестоимостьТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаНалоговыхНазначений)
	|				ТОГДА 0
	|			ИНАЧЕ СебестоимостьТоваров.СтоимостьРегл
	|		КОНЕЦ КАК Приход,
	|		ВЫБОР
	|			КОГДА СебестоимостьТоваров.ХозяйственнаяОперация В (
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратИзПроизводства), 
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента), 
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика))
	|				ТОГДА -СебестоимостьТоваров.СтоимостьРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Расход,
	|		ВЫБОР 
    |           КОГДА (СебестоимостьТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаНалоговыхНазначений)
	|		        И ((СебестоимостьТоваров.КорНалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Облагаемая) 
	|	   		        И СебестоимостьТоваров.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Необлагаемая))
	|		          ИЛИ (СебестоимостьТоваров.КорНалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.ПропорциональноОблагаемая) 
	|	   		        И СебестоимостьТоваров.НалоговоеНазначение = ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность))
    |               )
    |            )
	|			ТОГДА СебестоимостьТоваров.НДСРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПриходКорректировкаНДС,
    |       0 КАК РасходКорректировкаНДС,
	|		0 КАК НачальныйОстаток,
	|		0 КАК КонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|	ГДЕ
	|		СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И СебестоимостьТоваров.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И СебестоимостьТоваров.Активность
	|		И СебестоимостьТоваров.Организация В(&МассивОрганизаций)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СебестоимостьТоваров.Организация,
	|		СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
	|		СебестоимостьТоваров.ВидЗапасов,
	|		СебестоимостьТоваров.РазделУчета,
	|		ВЫБОР
	|			КОГДА СебестоимостьТоваров.ХозяйственнаяОперация В (
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДавальцу), 
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровКомитенту))
	|				ТОГДА -СебестоимостьТоваров.СтоимостьРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА СебестоимостьТоваров.ХозяйственнаяОперация В (
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДавальцу), 
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровКомитенту))
	|				ТОГДА 0
    |           КОГДА СебестоимостьТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаНалоговыхНазначений)
	|				ТОГДА 0
	|			ИНАЧЕ СебестоимостьТоваров.СтоимостьРегл
	|		КОНЕЦ,
	|		0 КАК ПриходКорректировкаНДС,
	|		0 КАК РасходКорректировкаНДС,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|	ГДЕ
	|		СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И СебестоимостьТоваров.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И СебестоимостьТоваров.Активность
	|		И СебестоимостьТоваров.Организация В(&МассивОрганизаций)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СебестоимостьТоваровОстатки.Организация,
	|		СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры,
	|		СебестоимостьТоваровОстатки.ВидЗапасов,
	|		СебестоимостьТоваровОстатки.РазделУчета,
	|		0,
	|		0,
    |       0 КАК ПриходКорректировкаНДС,
    |       0 КАК РасходКорректировкаНДС,
	|		ВЫБОР
	|			КОГДА &НачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ СебестоимостьТоваровОстатки.СтоимостьРеглОстаток
	|		КОНЕЦ,
	|		0
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров.Остатки(&НачалоПериода, Организация В (&МассивОрганизаций)) КАК СебестоимостьТоваровОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СебестоимостьТоваровОстатки.Организация,
	|		СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры,
	|		СебестоимостьТоваровОстатки.ВидЗапасов,
	|		СебестоимостьТоваровОстатки.РазделУчета,
	|		0,
	|		0,
    |       0 КАК ПриходКорректировкаНДС,
    |       0 КАК РасходКорректировкаНДС,
	|		0,
	|		СебестоимостьТоваровОстатки.СтоимостьРеглОстаток
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров.Остатки(&КонецПериодаОстатков, Организация В (&МассивОрганизаций)) КАК СебестоимостьТоваровОстатки) КАК Подзапрос
	|ГДЕ
	|	НЕ Подзапрос.РазделУчета В (
	|							ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты),
	|							ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию), 
	|							ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку))
	|
	|СГРУППИРОВАТЬ ПО
	|	Подзапрос.Организация,
	|	Подзапрос.АналитикаУчетаНоменклатуры,
	|	Подзапрос.ВидЗапасов,
	|	Подзапрос.РазделУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СебестоимостьТоваровОстаткиИОбороты.Организация КАК Организация,
	|	КлючиАналитикиУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	КлючиАналитикиУчетаНоменклатуры.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА КлючиАналитикиУчетаНоменклатуры.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|			ТОГДА КлючиАналитикиУчетаНоменклатуры.Склад
	|		ИНАЧЕ Склады.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|		ВидыЗапасов.ГруппаФинансовогоУчета
	|	ИНАЧЕ
	|		СправочникНоменклатура.ГруппаФинансовогоУчета
	|	КОНЕЦ КАК ГруппаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО КАК Валюта,
	|	СУММА(СебестоимостьТоваровОстаткиИОбороты.НачальныйОстаток) КАК НачальныйОстаток,
	|	СУММА(СебестоимостьТоваровОстаткиИОбороты.Приход) КАК Приход,
	|	СУММА(СебестоимостьТоваровОстаткиИОбороты.Расход) КАК Расход,
	|	СУММА(СебестоимостьТоваровОстаткиИОбороты.КонечныйОстаток) КАК КонечныйОстаток,
	|	СебестоимостьТоваровОстаткиИОбороты.РазделУчета
	|ПОМЕСТИТЬ ВТ_СебестоимостьТоваров
	|ИЗ
	|	ВТ_СебестоимостьТоваровОстаткиИОбороты КАК СебестоимостьТоваровОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|			ПО КлючиАналитикиУчетаНоменклатуры.Номенклатура = СправочникНоменклатура.Ссылка
	|		ПО СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	|		ПО (КлючиАналитикиУчетаНоменклатуры.Склад = Склады.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасов
	|		ПО СебестоимостьТоваровОстаткиИОбороты.ВидЗапасов = ВидыЗапасов.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваровОстаткиИОбороты.Организация,
	|	КлючиАналитикиУчетаНоменклатуры.Номенклатура,
	|	КлючиАналитикиУчетаНоменклатуры.Склад,
	|	Склады.Подразделение,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|		ВидыЗапасов.ГруппаФинансовогоУчета
	|	ИНАЧЕ
	|		СправочникНоменклатура.ГруппаФинансовогоУчета
	|	КОНЕЦ,
	|	СебестоимостьТоваровОстаткиИОбороты.РазделУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Номенклатура,
	|	Подразделение,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СебестоимостьТоваров.Организация КАК Организация,
	|	ВТ_СебестоимостьТоваров.Номенклатура КАК Номенклатура,
	|	ВТ_СебестоимостьТоваров.Подразделение КАК Подразделение,
	|	ВТ_СебестоимостьТоваров.Склад КАК Склад,
	|	ВТ_СебестоимостьТоваров.Валюта КАК Валюта,
	|	ВТ_СебестоимостьТоваров.РазделУчета,
	|	ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладе)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|					ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПринятыеВПереработкуВсего)
	|				ИНАЧЕ ЕСТЬNULL(МАКСИМУМ(ВТ_НастройкиОтражения1.СчетУчета), 
	|						ЕСТЬNULL(МАКСИМУМ(ВТ_НастройкиОтражения2.СчетУчета), 
	|							ЕСТЬNULL(МАКСИМУМ(ВТ_НастройкиОтраженияПоУмолчанию.СчетУчета), ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета.СчетУчетаНаСкладе)))
	|			КОНЕЦ
	|	КОНЕЦ КАК Счет
	|ПОМЕСТИТЬ ВТ_СебестоимостьТоваровНастройки
	|ИЗ
	|	ВТ_СебестоимостьТоваров КАК ВТ_СебестоимостьТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НастройкиОтражения КАК ВТ_НастройкиОтражения1
	|		ПО ВТ_СебестоимостьТоваров.Организация = ВТ_НастройкиОтражения1.Организация
	|			И ВТ_СебестоимостьТоваров.Склад = ВТ_НастройкиОтражения1.МестоУчета
	|			И ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета = ВТ_НастройкиОтражения1.ГруппаФинансовогоУчета
	|			И (ВЫБОР
	|				КОГДА ВТ_НастройкиОтражения1.ИспользоватьСубконто
	|					ТОГДА ВТ_СебестоимостьТоваров.Номенклатура = ВТ_НастройкиОтражения1.Субконто
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВТ_НастройкиОтражения1.ВидСчетаРеглУчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НаСкладе))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НастройкиОтражения КАК ВТ_НастройкиОтражения2
	|		ПО ВТ_СебестоимостьТоваров.Организация = ВТ_НастройкиОтражения2.Организация
	|			И ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета = ВТ_НастройкиОтражения2.ГруппаФинансовогоУчета
	|			И (ВЫБОР
	|				КОГДА ВТ_НастройкиОтражения2.ИспользоватьСубконто
	|					ТОГДА ВТ_СебестоимостьТоваров.Номенклатура = ВТ_НастройкиОтражения2.Субконто
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВТ_НастройкиОтражения2.ВидСчетаРеглУчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НаСкладе))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НастройкиОтраженияПоУмолчанию КАК ВТ_НастройкиОтраженияПоУмолчанию
	|		ПО ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета = ВТ_НастройкиОтраженияПоУмолчанию.ГруппаФинансовогоУчета
	|			И (ВЫБОР
	|				КОГДА ВТ_НастройкиОтраженияПоУмолчанию.ИспользоватьСубконто
	|					ТОГДА ВТ_СебестоимостьТоваров.Номенклатура = ВТ_НастройкиОтраженияПоУмолчанию.Субконто
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВТ_НастройкиОтраженияПоУмолчанию.ВидСчетаРеглУчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НаСкладе))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СебестоимостьТоваров.Организация,
	|	ВТ_СебестоимостьТоваров.Номенклатура,
	|	ВТ_СебестоимостьТоваров.Склад,
	|	ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета,
	|	ВТ_СебестоимостьТоваров.Подразделение,
	|	ВТ_СебестоимостьТоваров.Валюта,
	|	ВТ_СебестоимостьТоваров.РазделУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ХозрасчетныйОстаткиИОбороты.Счет,
	|	ХозрасчетныйОстаткиИОбороты.Субконто1,
	|	ХозрасчетныйОстаткиИОбороты.Субконто2,
	|	ХозрасчетныйОстаткиИОбороты.Подразделение,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_СебестоимостьНоменклатурыРегл
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|													&НачалоПериода, 
	|													&КонецПериода
	|													,
	|													,
	|													,
	|													НЕ Счет.Забалансовый,
	|													&ВидыСубконтоНоменклатураСклад, 
	|													Организация В (&МассивОрганизаций)) КАК ХозрасчетныйОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	2 КАК РазделУчета,
	|	Подзапрос.Организация,
	|	Подзапрос.Аналитика1,
	|	Подзапрос.Аналитика2,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетБУ,
	|	СУММА(Подзапрос.НачальныйОстаток) КАК НачальныйОстаток,
	|	СУММА(Подзапрос.Приход) КАК Приход,
	|	СУММА(Подзапрос.Расход) КАК Расход,
	|	СУММА(Подзапрос.КонечныйОстаток) КАК КонечныйОстаток,
	|	СУММА(Подзапрос.НачальноеСальдо) КАК НачальноеСальдо,
	|	СУММА(Подзапрос.ОборотДт) КАК ОборотДт,
	|	СУММА(Подзапрос.ОборотКт) КАК ОборотКт,
	|	СУММА(Подзапрос.КонечноеСальдо) КАК КонечноеСальдо
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_СебестоимостьТоваровНастройки.Организация КАК Организация,
	|		ВТ_СебестоимостьТоваровНастройки.Номенклатура КАК Аналитика1,
	|		ВЫБОР
	|			КОГДА ВТ_СебестоимостьТоваровНастройки.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПринятыеВПереработкуВсего))
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ИНАЧЕ ВТ_СебестоимостьТоваровНастройки.Склад
	|		КОНЕЦ КАК Аналитика2,
	|		ВЫБОР
	|			КОГДА ПланХозрасчетный.УчетПоПодразделениям
	|				ТОГДА ВТ_СебестоимостьТоваровНастройки.Подразделение
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|		КОНЕЦ КАК Подразделение,
	|		ВТ_СебестоимостьТоваровНастройки.Счет КАК СчетБУ,
	|		ЕСТЬNULL(ВТ_СебестоимостьТоваров.НачальныйОстаток, 0) КАК НачальныйОстаток,
	|		ЕСТЬNULL(ВТ_СебестоимостьТоваров.Приход, 0) КАК Приход,
	|		ЕСТЬNULL(ВТ_СебестоимостьТоваров.Расход, 0) КАК Расход,
	|		ЕСТЬNULL(ВТ_СебестоимостьТоваров.КонечныйОстаток, 0) КАК КонечныйОстаток,
	|		0 КАК НачальноеСальдо,
	|		0 КАК ОборотДт,
	|		0 КАК ОборотКт,
	|		0 КАК КонечноеСальдо
	|	ИЗ
	|		ВТ_СебестоимостьТоваровНастройки КАК ВТ_СебестоимостьТоваровНастройки
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СебестоимостьТоваров КАК ВТ_СебестоимостьТоваров
	|			ПО ВТ_СебестоимостьТоваровНастройки.Организация = ВТ_СебестоимостьТоваров.Организация
	|				И ВТ_СебестоимостьТоваровНастройки.Номенклатура = ВТ_СебестоимостьТоваров.Номенклатура
	|				И ВТ_СебестоимостьТоваровНастройки.Подразделение = ВТ_СебестоимостьТоваров.Подразделение
	|				И ВТ_СебестоимостьТоваровНастройки.Валюта = ВТ_СебестоимостьТоваров.Валюта
	|				И ВТ_СебестоимостьТоваровНастройки.Склад = ВТ_СебестоимостьТоваров.Склад
	|				И ВТ_СебестоимостьТоваровНастройки.ГруппаФинансовогоУчета = ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПланХозрасчетный КАК ПланХозрасчетный
	|			ПО ВТ_СебестоимостьТоваровНастройки.Счет = ПланХозрасчетный.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_СебестоимостьНоменклатурыРегл.Организация,
	|		ВТ_СебестоимостьНоменклатурыРегл.Субконто1,
	|		ВТ_СебестоимостьНоменклатурыРегл.Субконто2,
	|		ВТ_СебестоимостьНоменклатурыРегл.Подразделение,
	|		ВТ_СебестоимостьНоменклатурыРегл.Счет,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВТ_СебестоимостьНоменклатурыРегл.СуммаНачальныйОстаток,
	|		ВТ_СебестоимостьНоменклатурыРегл.СуммаОборотДт,
	|		ВТ_СебестоимостьНоменклатурыРегл.СуммаОборотКт,
	|		ВТ_СебестоимостьНоменклатурыРегл.СуммаКонечныйОстаток
	|	ИЗ
	|		ВТ_СебестоимостьНоменклатурыРегл КАК ВТ_СебестоимостьНоменклатурыРегл) КАК Подзапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	Подзапрос.Организация,
	|	Подзапрос.Аналитика1,
	|	Подзапрос.Аналитика2,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетБУ
	|ИМЕЮЩИЕ
	|	НЕ (СУММА(Подзапрос.НачальныйОстаток) = 0
	|		И СУММА(Подзапрос.Приход) = 0
	|		И СУММА(Подзапрос.Расход) = 0
	|		И СУММА(Подзапрос.КонечныйОстаток) = 0
	|		И СУММА(Подзапрос.НачальноеСальдо) = 0
	|		И СУММА(Подзапрос.ОборотДт) = 0
	|		И СУММА(Подзапрос.ОборотКт) = 0
	|		И СУММА(Подзапрос.КонечноеСальдо) = 0)";
	
КонецФункции

Функция ТекстЗапросаСебестоимостьПоРегистраторам()
	
	Возврат
	"ВЫБРАТЬ
	|	НастройкиОтражения.Организация,
	|	НастройкиОтражения.АналитикаУчета КАК ГруппаФинансовогоУчета,
	|	НастройкиОтражения.МестоУчета,
	|	НастройкиОтражения.СчетУчета,
	|	НастройкиОтражения.ВидСчетаРеглУчета,
	|	НастройкиОтражения.ИспользоватьСубконто,
	|	НастройкиОтражения.ВидСубконто,
	|	НастройкиОтражения.Субконто
	|ПОМЕСТИТЬ ВТ_НастройкиОтражения
	|ИЗ
	|	Счета КАК НастройкиОтражения
	|ГДЕ
	|	НастройкиОтражения.СчетУчета <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ГруппаФинансовогоУчета,
	|	МестоУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиОтраженияПоУмолчанию.АналитикаУчета КАК ГруппаФинансовогоУчета,
	|	НастройкиОтраженияПоУмолчанию.ВидСчетаРеглУчета,
	|	НастройкиОтраженияПоУмолчанию.СчетУчета,
	|	НастройкиОтраженияПоУмолчанию.ИспользоватьСубконто,
	|	НастройкиОтраженияПоУмолчанию.ВидСубконто,
	|	НастройкиОтраженияПоУмолчанию.Субконто
	|ПОМЕСТИТЬ ВТ_НастройкиОтраженияПоУмолчанию
	|ИЗ
	|	СчетаПоУмолчанию КАК НастройкиОтраженияПоУмолчанию
	|ИНДЕКСИРОВАТЬ ПО
	|	ГруппаФинансовогоУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Подзапрос.Организация,
	|	Подзапрос.АналитикаУчетаНоменклатуры,
	|	Подзапрос.ВидЗапасов,
	|	Подзапрос.РазделУчета,
	|	Подзапрос.Регистратор,
	|	СУММА(Подзапрос.Приход + Подзапрос.ПриходКорректировкаНДС) КАК Приход,
	|	СУММА(Подзапрос.Расход + Подзапрос.РасходКорректировкаНДС) КАК Расход
	|ПОМЕСТИТЬ ВТ_СебестоимостьТоваровОстаткиИОбороты
	|ИЗ
	|	(ВЫБРАТЬ
	|		СебестоимостьТоваров.Организация КАК Организация,
	|		СебестоимостьТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		СебестоимостьТоваров.ВидЗапасов КАК ВидЗапасов,
	|		СебестоимостьТоваров.РазделУчета КАК РазделУчета,
	|		ВЫБОР
	|			КОГДА (СебестоимостьТоваров.Регистратор ССЫЛКА Документ.РасчетСебестоимостиТоваров ИЛИ СебестоимостьТоваров.РасчетСебестоимости)
	|				И СебестоимостьТоваров.ДокументДвижения <> НЕОПРЕДЕЛЕНО	
	|				ТОГДА СебестоимостьТоваров.ДокументДвижения
	|			ИНАЧЕ СебестоимостьТоваров.Регистратор
	|		КОНЕЦ КАК Регистратор,
	|		ВЫБОР
	|			КОГДА СебестоимостьТоваров.ХозяйственнаяОперация В (
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратИзПроизводства), 
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента), 
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика))
	|				ТОГДА 0
    |           КОГДА СебестоимостьТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаНалоговыхНазначений)
	|				ТОГДА 0
	|			ИНАЧЕ СебестоимостьТоваров.СтоимостьРегл
	|		КОНЕЦ КАК Приход,
	|		ВЫБОР
	|			КОГДА СебестоимостьТоваров.ХозяйственнаяОперация В (
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратИзПроизводства), 
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента), 
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика))
	|				ТОГДА -СебестоимостьТоваров.СтоимостьРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Расход,
	|		ВЫБОР 
    |           КОГДА (СебестоимостьТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаНалоговыхНазначений)
	|		        И ((СебестоимостьТоваров.КорНалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Облагаемая) 
	|	   		        И СебестоимостьТоваров.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Необлагаемая))
	|		          ИЛИ (СебестоимостьТоваров.КорНалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.ПропорциональноОблагаемая) 
	|	   		        И СебестоимостьТоваров.НалоговоеНазначение = ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность))
    |               )
    |            )
	|			ТОГДА СебестоимостьТоваров.НДСРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПриходКорректировкаНДС,
    |       0 КАК РасходКорректировкаНДС,
	|		0 КАК НачальныйОстаток,
	|		0 КАК КонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|	ГДЕ
	|		СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И СебестоимостьТоваров.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И СебестоимостьТоваров.Активность
	|		И СебестоимостьТоваров.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		И СебестоимостьТоваров.Организация В (&МассивОрганизаций)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СебестоимостьТоваров.Организация,
	|		СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
	|		СебестоимостьТоваров.ВидЗапасов,
	|		СебестоимостьТоваров.РазделУчета,
	|		ВЫБОР
	|			КОГДА (СебестоимостьТоваров.Регистратор ССЫЛКА Документ.РасчетСебестоимостиТоваров ИЛИ СебестоимостьТоваров.РасчетСебестоимости)
	|				И СебестоимостьТоваров.ДокументДвижения <> НЕОПРЕДЕЛЕНО	
	|				ТОГДА СебестоимостьТоваров.ДокументДвижения
	|			ИНАЧЕ СебестоимостьТоваров.Регистратор
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА СебестоимостьТоваров.ХозяйственнаяОперация В (
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДавальцу), 
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровКомитенту))
	|				ТОГДА -СебестоимостьТоваров.СтоимостьРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА СебестоимостьТоваров.ХозяйственнаяОперация В (
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДавальцу), 
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровКомитенту))
	|				ТОГДА 0
    |           КОГДА СебестоимостьТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаНалоговыхНазначений)
	|				ТОГДА 0
	|			ИНАЧЕ СебестоимостьТоваров.СтоимостьРегл
	|		КОНЕЦ,
    |       0 КАК ПриходКорректировкаНДС,
    |       0 КАК РасходКорректировкаНДС,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|	ГДЕ
	|		СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И СебестоимостьТоваров.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И СебестоимостьТоваров.Активность
	|		И СебестоимостьТоваров.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		И СебестоимостьТоваров.Организация В (&МассивОрганизаций)
	|) КАК Подзапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	Подзапрос.Организация,
	|	Подзапрос.АналитикаУчетаНоменклатуры,
	|	Подзапрос.ВидЗапасов,
	|	Подзапрос.РазделУчета,
	|	Подзапрос.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СебестоимостьТоваровОстаткиИОбороты.Организация КАК Организация,
	|	КлючиАналитикиУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	КлючиАналитикиУчетаНоменклатуры.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА КлючиАналитикиУчетаНоменклатуры.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|			ТОГДА КлючиАналитикиУчетаНоменклатуры.Склад
	|		ИНАЧЕ Склады.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|		ВидыЗапасов.ГруппаФинансовогоУчета
	|	ИНАЧЕ
	|		СправочникНоменклатура.ГруппаФинансовогоУчета
	|	КОНЕЦ КАК ГруппаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО КАК Валюта,
	|	СебестоимостьТоваровОстаткиИОбороты.Регистратор КАК Регистратор,
	|	СУММА(СебестоимостьТоваровОстаткиИОбороты.Приход) КАК Приход,
	|	СУММА(СебестоимостьТоваровОстаткиИОбороты.Расход) КАК Расход,
	|	СебестоимостьТоваровОстаткиИОбороты.РазделУчета
	|ПОМЕСТИТЬ ВТ_СебестоимостьТоваров
	|ИЗ
	|	ВТ_СебестоимостьТоваровОстаткиИОбороты КАК СебестоимостьТоваровОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|			ПО КлючиАналитикиУчетаНоменклатуры.Номенклатура = СправочникНоменклатура.Ссылка
	|		ПО СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	|		ПО (КлючиАналитикиУчетаНоменклатуры.Склад = Склады.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасов
	|		ПО СебестоимостьТоваровОстаткиИОбороты.ВидЗапасов = ВидыЗапасов.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваровОстаткиИОбороты.Организация,
	|	КлючиАналитикиУчетаНоменклатуры.Номенклатура,
	|	КлючиАналитикиУчетаНоменклатуры.Склад,
	|	Склады.Подразделение,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|		ВидыЗапасов.ГруппаФинансовогоУчета
	|	ИНАЧЕ
	|		СправочникНоменклатура.ГруппаФинансовогоУчета
	|	КОНЕЦ,
	|	СебестоимостьТоваровОстаткиИОбороты.РазделУчета,
	|	СебестоимостьТоваровОстаткиИОбороты.Регистратор
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Номенклатура,
	|	Подразделение,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СебестоимостьТоваров.Организация КАК Организация,
	|	ВТ_СебестоимостьТоваров.Номенклатура КАК Номенклатура,
	|	ВТ_СебестоимостьТоваров.Подразделение КАК Подразделение,
	|	ВТ_СебестоимостьТоваров.Склад КАК Склад,
	|	ВТ_СебестоимостьТоваров.Валюта КАК Валюта,
	|	ВТ_СебестоимостьТоваров.РазделУчета,
	|	ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ВТ_СебестоимостьТоваров.Регистратор КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладе)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|					ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПринятыеВПереработкуВсего)
	|				ИНАЧЕ ЕСТЬNULL(МАКСИМУМ(ВТ_НастройкиОтражения1.СчетУчета), 
	|						ЕСТЬNULL(МАКСИМУМ(ВТ_НастройкиОтражения2.СчетУчета), 
	|							ЕСТЬNULL(МАКСИМУМ(ВТ_НастройкиОтраженияПоУмолчанию.СчетУчета), ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета.СчетУчетаНаСкладе)))
	|			КОНЕЦ
	|	КОНЕЦ КАК Счет
	|ПОМЕСТИТЬ ВТ_СебестоимостьТоваровНастройки
	|ИЗ
	|	ВТ_СебестоимостьТоваров КАК ВТ_СебестоимостьТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НастройкиОтражения КАК ВТ_НастройкиОтражения1
	|		ПО ВТ_СебестоимостьТоваров.Организация = ВТ_НастройкиОтражения1.Организация
	|			И ВТ_СебестоимостьТоваров.Склад = ВТ_НастройкиОтражения1.МестоУчета
	|			И ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета = ВТ_НастройкиОтражения1.ГруппаФинансовогоУчета
	|			И (ВЫБОР
	|				КОГДА ВТ_НастройкиОтражения1.ИспользоватьСубконто
	|					ТОГДА ВТ_СебестоимостьТоваров.Номенклатура = ВТ_НастройкиОтражения1.Субконто
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВТ_НастройкиОтражения1.ВидСчетаРеглУчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НаСкладе))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НастройкиОтражения КАК ВТ_НастройкиОтражения2
	|		ПО ВТ_СебестоимостьТоваров.Организация = ВТ_НастройкиОтражения2.Организация
	|			И ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета = ВТ_НастройкиОтражения2.ГруппаФинансовогоУчета
	|			И (ВЫБОР
	|				КОГДА ВТ_НастройкиОтражения2.ИспользоватьСубконто
	|					ТОГДА ВТ_СебестоимостьТоваров.Номенклатура = ВТ_НастройкиОтражения2.Субконто
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВТ_НастройкиОтражения2.ВидСчетаРеглУчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НаСкладе))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НастройкиОтраженияПоУмолчанию КАК ВТ_НастройкиОтраженияПоУмолчанию
	|		ПО ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета = ВТ_НастройкиОтраженияПоУмолчанию.ГруппаФинансовогоУчета
	|			И (ВЫБОР
	|				КОГДА ВТ_НастройкиОтраженияПоУмолчанию.ИспользоватьСубконто
	|					ТОГДА ВТ_СебестоимостьТоваров.Номенклатура = ВТ_НастройкиОтраженияПоУмолчанию.Субконто
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВТ_НастройкиОтраженияПоУмолчанию.ВидСчетаРеглУчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НаСкладе))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СебестоимостьТоваров.Организация,
	|	ВТ_СебестоимостьТоваров.Номенклатура,
	|	ВТ_СебестоимостьТоваров.Склад,
	|	ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета,
	|	ВТ_СебестоимостьТоваров.Подразделение,
	|	ВТ_СебестоимостьТоваров.Валюта,
	|	ВТ_СебестоимостьТоваров.РазделУчета,
	|	ВТ_СебестоимостьТоваров.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ХозрасчетныйОстаткиИОбороты.Счет,
	|	ХозрасчетныйОстаткиИОбороты.Субконто1,
	|	ХозрасчетныйОстаткиИОбороты.Субконто2,
	|	ХозрасчетныйОстаткиИОбороты.Подразделение,
	|	ХозрасчетныйОстаткиИОбороты.Регистратор,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт
	|ПОМЕСТИТЬ ВТ_СебестоимостьНоменклатурыРегл
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|											&НачалоПериода, 
	|											&КонецПериода, 
	|											Регистратор, 
	|											НЕ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПринятыеВПереработкуВсего)),
	|											&ВидыСубконтоНоменклатураСклад, 
	|											Организация В (&МассивОрганизаций), , ) КАК ХозрасчетныйОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПринятыеВПереработкуВсего),
	|	ХозрасчетныйОстаткиИОбороты.Субконто2,
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка),
	|	ХозрасчетныйОстаткиИОбороты.Подразделение,
	|	ХозрасчетныйОстаткиИОбороты.Регистратор,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|											&НачалоПериода, 
	|											&КонецПериода, 
	|											Регистратор, 
	|											Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПринятыеВПереработкуВсего)),
	|											,
	|											Организация В (&МассивОрганизаций), , ) КАК ХозрасчетныйОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	2 КАК РазделУчета,
	|	Подзапрос.Организация,
	|	Подзапрос.Аналитика1,
	|	Подзапрос.Аналитика2,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетБУ,
	|	Подзапрос.Регистратор,
	|	СУММА(Подзапрос.Приход) КАК Приход,
	|	СУММА(Подзапрос.Расход) КАК Расход,
	|	СУММА(Подзапрос.ОборотДт) КАК ОборотДт,
	|	СУММА(Подзапрос.ОборотКт) КАК ОборотКт,
	|	ОтражениеДокументовВРеглУчете.Статус
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_СебестоимостьТоваровНастройки.Организация КАК Организация,
	|		ВТ_СебестоимостьТоваровНастройки.Номенклатура КАК Аналитика1,
	|		ВЫБОР
	|			КОГДА ВТ_СебестоимостьТоваровНастройки.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПринятыеВПереработкуВсего))
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ИНАЧЕ ВТ_СебестоимостьТоваровНастройки.Склад
	|		КОНЕЦ КАК Аналитика2,
	|		ВЫБОР
	|			КОГДА ПланХозрасчетный.УчетПоПодразделениям
	|				ТОГДА ВТ_СебестоимостьТоваровНастройки.Подразделение
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|		КОНЕЦ КАК Подразделение,
	|		ВТ_СебестоимостьТоваровНастройки.Счет КАК СчетБУ,
	|		ВТ_СебестоимостьТоваров.Регистратор КАК Регистратор,
	|		ЕСТЬNULL(ВТ_СебестоимостьТоваров.Приход, 0) КАК Приход,
	|		ЕСТЬNULL(ВТ_СебестоимостьТоваров.Расход, 0) КАК Расход,
	|		0 КАК ОборотДт,
	|		0 КАК ОборотКт
	|	ИЗ
	|		ВТ_СебестоимостьТоваровНастройки КАК ВТ_СебестоимостьТоваровНастройки
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СебестоимостьТоваров КАК ВТ_СебестоимостьТоваров
	|			ПО ВТ_СебестоимостьТоваровНастройки.Организация = ВТ_СебестоимостьТоваров.Организация
	|				И ВТ_СебестоимостьТоваровНастройки.Номенклатура = ВТ_СебестоимостьТоваров.Номенклатура
	|				И ВТ_СебестоимостьТоваровНастройки.Подразделение = ВТ_СебестоимостьТоваров.Подразделение
	|				И ВТ_СебестоимостьТоваровНастройки.Валюта = ВТ_СебестоимостьТоваров.Валюта
	|				И ВТ_СебестоимостьТоваровНастройки.Склад = ВТ_СебестоимостьТоваров.Склад
	|				И ВТ_СебестоимостьТоваровНастройки.ГруппаФинансовогоУчета = ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета
	|				И ВТ_СебестоимостьТоваровНастройки.Регистратор = ВТ_СебестоимостьТоваров.Регистратор
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПланХозрасчетный КАК ПланХозрасчетный
	|			ПО ВТ_СебестоимостьТоваровНастройки.Счет = ПланХозрасчетный.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_СебестоимостьНоменклатурыРегл.Организация,
	|		ВТ_СебестоимостьНоменклатурыРегл.Субконто1,
	|		ВТ_СебестоимостьНоменклатурыРегл.Субконто2,
	|		ВТ_СебестоимостьНоменклатурыРегл.Подразделение,
	|		ВТ_СебестоимостьНоменклатурыРегл.Счет,
	|		ВТ_СебестоимостьНоменклатурыРегл.Регистратор,
	|		0,
	|		0,
	|		ВТ_СебестоимостьНоменклатурыРегл.СуммаОборотДт,
	|		ВТ_СебестоимостьНоменклатурыРегл.СуммаОборотКт
	|	ИЗ
	|		ВТ_СебестоимостьНоменклатурыРегл КАК ВТ_СебестоимостьНоменклатурыРегл) КАК Подзапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтражениеДокументовВРеглУчете КАК ОтражениеДокументовВРеглУчете
	|		ПО Подзапрос.Организация = ОтражениеДокументовВРеглУчете.Организация
	|			И Подзапрос.Регистратор = ОтражениеДокументовВРеглУчете.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	Подзапрос.Организация,
	|	Подзапрос.Аналитика1,
	|	Подзапрос.Аналитика2,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетБУ,
	|	Подзапрос.Регистратор,
	|	ОтражениеДокументовВРеглУчете.Статус
	|ИМЕЮЩИЕ
	|	НЕ (СУММА(Подзапрос.Приход) = 0
	|		И СУММА(Подзапрос.Расход) = 0
	|		И СУММА(Подзапрос.ОборотДт) = 0
	|		И СУММА(Подзапрос.ОборотКт) = 0)";

КонецФункции

Функция ТекстЗапросаДенежныеСредства()
	
	Возврат
	"ВЫБРАТЬ
	|	ДенежныеСредстваБезналичныеОстаткиИОбороты.Организация,
	|	БанковскиеСчетаОрганизаций.Подразделение,
	|	ДенежныеСредстваБезналичныеОстаткиИОбороты.БанковскийСчет КАК Аналитика1,
	|	БанковскиеСчетаОрганизаций.ГруппаФинансовогоУчета,
	|	БанковскиеСчетаОрганизаций.СчетУчета КАК СчетУчета,
	|	БанковскиеСчетаОрганизаций.ВалютаДенежныхСредств КАК Валюта,
	|	ДенежныеСредстваБезналичныеОстаткиИОбороты.СуммаРеглНачальныйОстаток КАК НачальныйОстаток,
	|	ДенежныеСредстваБезналичныеОстаткиИОбороты.СуммаРеглПриход КАК Приход,
	|	ДенежныеСредстваБезналичныеОстаткиИОбороты.СуммаРеглРасход КАК Расход,
	|	ДенежныеСредстваБезналичныеОстаткиИОбороты.СуммаРеглКонечныйОстаток КАК КонечныйОстаток,
	|	0 КАК НачальноеСальдо,
	|	0 КАК ОборотДт,
	|	0 КАК ОборотКт,
	|	0 КАК КонечноеСальдо
	|ПОМЕСТИТЬ ВТ_ДенежныеСредстваИсходныеДанные
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Организация В (&МассивОрганизаций)) КАК ДенежныеСредстваБезналичныеОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|		ПО ДенежныеСредстваБезналичныеОстаткиИОбороты.БанковскийСчет = БанковскиеСчетаОрганизаций.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеСредстваНаличныеОстаткиИОбороты.Организация,
	|	Кассы.Подразделение,
	|	NULL,
	|	NULL,
	|	Кассы.СчетУчета,
	|	Кассы.ВалютаДенежныхСредств,
	|	ДенежныеСредстваНаличныеОстаткиИОбороты.СуммаРеглНачальныйОстаток,
	|	ДенежныеСредстваНаличныеОстаткиИОбороты.СуммаРеглПриход,
	|	ДенежныеСредстваНаличныеОстаткиИОбороты.СуммаРеглРасход,
	|	ДенежныеСредстваНаличныеОстаткиИОбороты.СуммаРеглКонечныйОстаток,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Организация В (&МассивОрганизаций)) КАК ДенежныеСредстваНаличныеОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Кассы КАК Кассы
	|		ПО ДенежныеСредстваНаличныеОстаткиИОбороты.Касса = Кассы.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеСредстваВКассахККМОстаткиИОбороты.Организация,
	|	КассыККМ.Подразделение,
	|	NULL,
	|	NULL,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РозничнаяВыручкаВКассахККМ),
	|	КассыККМ.ВалютаДенежныхСредств,
	|	ДенежныеСредстваВКассахККМОстаткиИОбороты.СуммаРеглНачальныйОстаток,
	|	ДенежныеСредстваВКассахККМОстаткиИОбороты.СуммаРеглПриход,
	|	ДенежныеСредстваВКассахККМОстаткиИОбороты.СуммаРеглРасход,
	|	ДенежныеСредстваВКассахККМОстаткиИОбороты.СуммаРеглКонечныйОстаток,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Организация В (&МассивОрганизаций)) КАК ДенежныеСредстваВКассахККМОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КассыККМ КАК КассыККМ
	|		ПО ДенежныеСредстваВКассахККМОстаткиИОбороты.КассаККМ = КассыККМ.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.ПодотчетноеЛицо,
	|	NULL,
	|	ВЫБОР
	|		КОГДА ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.Валюта = ВалютаРегламентированногоУчета.Значение
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВНациональнойВалюте)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВИностраннойВалюте)
	|	КОНЕЦ,
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.Валюта,
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.СуммаРеглНачальныйОстаток,
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.СуммаРеглПриход,
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.СуммаРеглРасход,
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.СуммаРеглКонечныйОстаток,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Организация В (&МассивОрганизаций)) КАК ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|		ПО (ИСТИНА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеДокументыОстаткиИОбороты.Организация,
	|	ДенежныеДокументыОстаткиИОбороты.Подразделение,
	|	ДенежныеДокументыОстаткиИОбороты.ДенежныйДокумент,
	|	NULL,
	|	ВЫБОР
	|		КОГДА ДенежныеДокументы.Валюта = ВалютаРегламентированногоУчета.Значение
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеДокументыВНациональнойВалюте)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеДокументыВИностраннойВалюте)
	|	КОНЕЦ,
	|	ДенежныеДокументы.Валюта,
	|	ДенежныеДокументыОстаткиИОбороты.СуммаРеглНачальныйОстаток,
	|	ДенежныеДокументыОстаткиИОбороты.СуммаРеглПриход,
	|	ДенежныеДокументыОстаткиИОбороты.СуммаРеглРасход,
	|	ДенежныеДокументыОстаткиИОбороты.СуммаРеглКонечныйОстаток,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДенежныеДокументы.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Организация В (&МассивОрганизаций)) КАК ДенежныеДокументыОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДенежныеДокументы КАК ДенежныеДокументы
	|		ПО ДенежныеДокументыОстаткиИОбороты.ДенежныйДокумент = ДенежныеДокументы.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|		ПО (ИСТИНА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеСредстваВПутиОстаткиИОбороты.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА ДенежныеСредстваВПутиОстаткиИОбороты.ВидПереводаДенежныхСредств В (ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияВБанк), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеречислениеНаДругойСчет), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияИзБанка), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеремещениеВДругуюКассу))
	|				И ДенежныеСредстваВПутиОстаткиИОбороты.Валюта = ВалютаРегламентированногоУчета.Значение
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалюте)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДенежныеСредстваВПутиОстаткиИОбороты.ВидПереводаДенежныхСредств В (ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияВБанк), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеречислениеНаДругойСчет), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияИзБанка), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеремещениеВДругуюКассу))
	|						И ДенежныеСредстваВПутиОстаткиИОбороты.Валюта <> ВалютаРегламентированногоУчета.Значение
	|					ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВПутиВИностраннойВалюте)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ДенежныеСредстваВПутиОстаткиИОбороты.ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПриобретениеВалюты)
	|							ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПриобретениеИностраннойВалюты)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ДенежныеСредстваВПутиОстаткиИОбороты.ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.РеализацияВалюты)
	|									ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РеализацияИностраннойВалюты)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ДенежныеСредстваВПутиОстаткиИОбороты.ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПоступлениеОтБанкаПоЭквайрингу)
	|											ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПродажиПоПлатежнымКартам)
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДенежныеСредстваВПутиОстаткиИОбороты.Валюта,
	|	ДенежныеСредстваВПутиОстаткиИОбороты.СуммаРеглНачальныйОстаток,
	|	ДенежныеСредстваВПутиОстаткиИОбороты.СуммаРеглПриход,
	|	ДенежныеСредстваВПутиОстаткиИОбороты.СуммаРеглРасход,
	|	ДенежныеСредстваВПутиОстаткиИОбороты.СуммаРеглКонечныйОстаток,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Организация В (&МассивОрганизаций)) КАК ДенежныеСредстваВПутиОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|		ПО (ИСТИНА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстаткиИОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалютеГруппа), 
	|			ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВПутиВИностраннойВалютеГруппа))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.Подразделение
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Субконто1) = ТИП(Справочник.БанковскиеСчетаКонтрагентов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Субконто1) = ТИП(Справочник.БанковскиеСчетаОрганизаций)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Субконто1) = ТИП(Справочник.ФизическиеЛица)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Субконто1) = ТИП(Справочник.ДенежныеДокументы)
	|			ТОГДА ХозрасчетныйОстаткиИОбороты.Субконто1
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Субконто1) = ТИП(Справочник.БанковскиеСчетаКонтрагентов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Субконто1) = ТИП(Справочник.БанковскиеСчетаОрганизаций)
	|			ТОГДА ХозрасчетныйОстаткиИОбороты.Субконто1.ГруппаФинансовогоУчета
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ХозрасчетныйОстаткиИОбороты.Счет,
	|	ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.Валюта, ВалютаРегламентированногоУчета.Значение),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Касса), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаВБанках), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДенежныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами)), , Организация В (&МассивОрганизаций)) КАК ХозрасчетныйОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК РазделУчета,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Организация,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Подразделение,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Аналитика1,
	|	NULL КАК Аналитика2,
	|	ВТ_ДенежныеСредстваИсходныеДанные.СчетУчета КАК СчетБУ,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Валюта,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.НачальныйОстаток) КАК НачальныйОстаток,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.Приход) КАК Приход,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.Расход) КАК Расход,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.КонечныйОстаток) КАК КонечныйОстаток,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.НачальноеСальдо) КАК НачальноеСальдо,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.ОборотДт) КАК ОборотДт,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.ОборотКт) КАК ОборотКт,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.КонечноеСальдо) КАК КонечноеСальдо
	|ИЗ
	|	ВТ_ДенежныеСредстваИсходныеДанные КАК ВТ_ДенежныеСредстваИсходныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДенежныеСредстваИсходныеДанные.Организация,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Подразделение,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Аналитика1,
	|	ВТ_ДенежныеСредстваИсходныеДанные.СчетУчета,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Валюта";
	
КонецФункции

Функция ТекстЗапросаДенежныеСредстваПоРегистраторам()
	
	Возврат
	"ВЫБРАТЬ
	|	ДенежныеСредстваБезналичныеОстаткиИОбороты.Организация,
	|	БанковскиеСчетаОрганизаций.Подразделение,
	|	ДенежныеСредстваБезналичныеОстаткиИОбороты.БанковскийСчет КАК Аналитика1,
	|	БанковскиеСчетаОрганизаций.ГруппаФинансовогоУчета,
	|	БанковскиеСчетаОрганизаций.СчетУчета КАК СчетУчета,
	|	БанковскиеСчетаОрганизаций.ВалютаДенежныхСредств КАК Валюта,
	|	ДенежныеСредстваБезналичныеОстаткиИОбороты.Регистратор КАК Регистратор,
	|	ДенежныеСредстваБезналичныеОстаткиИОбороты.СуммаРеглПриход КАК Приход,
	|	ДенежныеСредстваБезналичныеОстаткиИОбороты.СуммаРеглРасход КАК Расход,
	|	0 КАК ОборотДт,
	|	0 КАК ОборотКт
	|ПОМЕСТИТЬ ВТ_ДенежныеСредстваИсходныеДанные
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, Движения, Организация В (&МассивОрганизаций)) КАК ДенежныеСредстваБезналичныеОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|		ПО ДенежныеСредстваБезналичныеОстаткиИОбороты.БанковскийСчет = БанковскиеСчетаОрганизаций.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеСредстваНаличныеОстаткиИОбороты.Организация,
	|	Кассы.Подразделение,
	|	NULL,
	|	NULL,
	|	Кассы.СчетУчета,
	|	Кассы.ВалютаДенежныхСредств,
	|	ДенежныеСредстваНаличныеОстаткиИОбороты.Регистратор,
	|	ДенежныеСредстваНаличныеОстаткиИОбороты.СуммаРеглПриход,
	|	ДенежныеСредстваНаличныеОстаткиИОбороты.СуммаРеглРасход,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, Движения, Организация В (&МассивОрганизаций)) КАК ДенежныеСредстваНаличныеОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Кассы КАК Кассы
	|		ПО ДенежныеСредстваНаличныеОстаткиИОбороты.Касса = Кассы.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеСредстваВКассахККМОстаткиИОбороты.Организация,
	|	КассыККМ.Подразделение,
	|	NULL,
	|	NULL,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РозничнаяВыручкаВКассахККМ),
	|	КассыККМ.ВалютаДенежныхСредств,
	|	ДенежныеСредстваВКассахККМОстаткиИОбороты.Регистратор,
	|	ДенежныеСредстваВКассахККМОстаткиИОбороты.СуммаРеглПриход,
	|	ДенежныеСредстваВКассахККМОстаткиИОбороты.СуммаРеглРасход,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, Движения, Организация В (&МассивОрганизаций)) КАК ДенежныеСредстваВКассахККМОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КассыККМ КАК КассыККМ
	|		ПО ДенежныеСредстваВКассахККМОстаткиИОбороты.КассаККМ = КассыККМ.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.ПодотчетноеЛицо,
	|	NULL,
	|	ВЫБОР
	|		КОГДА ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.Валюта = ВалютаРегламентированногоУчета.Значение
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВНациональнойВалюте)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВИностраннойВалюте)
	|	КОНЕЦ,
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.Валюта,
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.Регистратор,
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.СуммаРеглПриход,
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.СуммаРеглРасход,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, Движения, Организация В (&МассивОрганизаций)) КАК ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|		ПО (ИСТИНА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеДокументыОстаткиИОбороты.Организация,
	|	ДенежныеДокументыОстаткиИОбороты.Подразделение,
	|	ДенежныеДокументыОстаткиИОбороты.ДенежныйДокумент,
	|	NULL,
	|	ВЫБОР
	|		КОГДА ДенежныеДокументы.Валюта = ВалютаРегламентированногоУчета.Значение
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеДокументыВНациональнойВалюте)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеДокументыВИностраннойВалюте)
	|	КОНЕЦ,
	|	ДенежныеДокументы.Валюта,
	|	ДенежныеДокументыОстаткиИОбороты.Регистратор,
	|	ДенежныеДокументыОстаткиИОбороты.СуммаРеглПриход,
	|	ДенежныеДокументыОстаткиИОбороты.СуммаРеглРасход,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДенежныеДокументы.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, Движения, Организация В (&МассивОрганизаций)) КАК ДенежныеДокументыОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДенежныеДокументы КАК ДенежныеДокументы
	|		ПО ДенежныеДокументыОстаткиИОбороты.ДенежныйДокумент = ДенежныеДокументы.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|		ПО (ИСТИНА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеСредстваВПутиОстаткиИОбороты.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА ДенежныеСредстваВПутиОстаткиИОбороты.ВидПереводаДенежныхСредств В (ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияВБанк), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеречислениеНаДругойСчет), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияИзБанка), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеремещениеВДругуюКассу))
	|				И ДенежныеСредстваВПутиОстаткиИОбороты.Валюта = ВалютаРегламентированногоУчета.Значение
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалюте)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДенежныеСредстваВПутиОстаткиИОбороты.ВидПереводаДенежныхСредств В (ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияВБанк), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеречислениеНаДругойСчет), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияИзБанка), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеремещениеВДругуюКассу))
	|						И ДенежныеСредстваВПутиОстаткиИОбороты.Валюта <> ВалютаРегламентированногоУчета.Значение
	|					ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВПутиВИностраннойВалюте)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ДенежныеСредстваВПутиОстаткиИОбороты.ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПриобретениеВалюты)
	|							ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПриобретениеИностраннойВалюты)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ДенежныеСредстваВПутиОстаткиИОбороты.ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.РеализацияВалюты)
	|									ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РеализацияИностраннойВалюты)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ДенежныеСредстваВПутиОстаткиИОбороты.ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПоступлениеОтБанкаПоЭквайрингу)
	|											ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПродажиПоПлатежнымКартам)
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДенежныеСредстваВПутиОстаткиИОбороты.Валюта,
	|	ДенежныеСредстваВПутиОстаткиИОбороты.Регистратор,
	|	ДенежныеСредстваВПутиОстаткиИОбороты.СуммаРеглПриход,
	|	ДенежныеСредстваВПутиОстаткиИОбороты.СуммаРеглРасход,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Организация В (&МассивОрганизаций)) КАК ДенежныеСредстваВПутиОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|		ПО (ИСТИНА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстаткиИОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалютеГруппа), 
	|			ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВПутиВИностраннойВалютеГруппа))
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.Подразделение
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Субконто1) = ТИП(Справочник.БанковскиеСчетаКонтрагентов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Субконто1) = ТИП(Справочник.БанковскиеСчетаОрганизаций)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Субконто1) = ТИП(Справочник.ФизическиеЛица)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Субконто1) = ТИП(Справочник.ДенежныеДокументы)
	|			ТОГДА ХозрасчетныйОстаткиИОбороты.Субконто1
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Субконто1) = ТИП(Справочник.БанковскиеСчетаКонтрагентов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Субконто1) = ТИП(Справочник.БанковскиеСчетаОрганизаций)
	|			ТОГДА ХозрасчетныйОстаткиИОбороты.Субконто1.ГруппаФинансовогоУчета
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ХозрасчетныйОстаткиИОбороты.Счет,
	|	ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.Валюта, ВалютаРегламентированногоУчета.Значение),
	|	ХозрасчетныйОстаткиИОбороты.Регистратор,
	|	0,
	|	0,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, Движения, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Касса), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаВБанках), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДенежныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами)), , Организация В (&МассивОрганизаций)) КАК ХозрасчетныйОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК РазделУчета,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Организация,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Подразделение,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Аналитика1,
	|	ВТ_ДенежныеСредстваИсходныеДанные.ГруппаФинансовогоУчета,
	|	ВТ_ДенежныеСредстваИсходныеДанные.СчетУчета КАК СчетБУ,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Валюта,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Регистратор,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.Приход) КАК Приход,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.Расход) КАК Расход,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.ОборотДт) КАК ОборотДт,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.ОборотКт) КАК ОборотКт,
	|	ОтражениеДокументовВРеглУчете.Статус
	|ИЗ
	|	ВТ_ДенежныеСредстваИсходныеДанные КАК ВТ_ДенежныеСредстваИсходныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтражениеДокументовВРеглУчете КАК ОтражениеДокументовВРеглУчете
	|		ПО ВТ_ДенежныеСредстваИсходныеДанные.Организация = ОтражениеДокументовВРеглУчете.Организация
	|			И ВТ_ДенежныеСредстваИсходныеДанные.Регистратор = ОтражениеДокументовВРеглУчете.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДенежныеСредстваИсходныеДанные.Организация,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Подразделение,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Аналитика1,
	|	ВТ_ДенежныеСредстваИсходныеДанные.ГруппаФинансовогоУчета,
	|	ВТ_ДенежныеСредстваИсходныеДанные.СчетУчета,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Валюта,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Регистратор,
	|	ОтражениеДокументовВРеглУчете.Статус";

КонецФункции

Функция ТекстЗапросаРасчетыСКонтрагентами()
	
	Возврат
	"ВЫБРАТЬ
	|	КлючиАналитики.Организация,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РасчетыСПоставщиками.ЗаказПоставщику.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(РасчетыСПоставщиками.РасчетныйДокумент.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(РасчетыСПоставщиками.ЗаказПоставщику.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	КОНЕЦ КАК Подразделение,
	|	КлючиАналитики.Контрагент,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РасчетыСПоставщиками.ЗаказПоставщику.ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(РасчетыСПоставщиками.РасчетныйДокумент.ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(РасчетыСПоставщиками.ЗаказПоставщику.ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка))
	|	КОНЕЦ КАК ГруппаФинансовогоУчета,
	|	РасчетыСПоставщиками.ДолгРеглНачальныйОстаток,
	|	РасчетыСПоставщиками.ДолгРеглПриход,
	|	РасчетыСПоставщиками.ДолгРеглРасход,
	|	РасчетыСПоставщиками.ДолгРеглНачальныйОстаток + РасчетыСПоставщиками.ДолгРеглПриход - РасчетыСПоставщиками.ДолгРеглРасход КАК ДолгРеглКонечныйОстаток,
	|	РасчетыСПоставщиками.ПредоплатаРеглНачальныйОстаток,
	|	РасчетыСПоставщиками.ПредоплатаРеглПриход,
	|	РасчетыСПоставщиками.ПредоплатаРеглРасход,
	|	РасчетыСПоставщиками.ПредоплатаРеглНачальныйОстаток + РасчетыСПоставщиками.ПредоплатаРеглПриход - РасчетыСПоставщиками.ПредоплатаРеглРасход КАК ПредоплатаРеглКонечныйОстаток,
	|	РасчетыСПоставщиками.РасчетныйДокумент,
	|	РасчетыСПоставщиками.ХозяйственнаяОперация,
	|	РасчетыСПоставщиками.Регистратор
	|ПОМЕСТИТЬ ВТ_РасчетыСПоставщикамиРег
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоДокументам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику КАК ЗаказПоставщику,
	|		РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент КАК РасчетныйДокумент,
	|		РасчетыСПоставщикамиПоДокументам.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоДокументам.ДолгРегл < 0
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСПоставщикамиПоДокументам.ДолгРегл
	|		КОНЕЦ КАК ДолгРеглПриход,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоДокументам.ДолгРегл < 0
	|				ТОГДА -РасчетыСПоставщикамиПоДокументам.ДолгРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ДолгРеглРасход,
	|		0 КАК ДолгРеглНачальныйОстаток,
	|		0 КАК ДолгРеглКонечныйОстаток,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл < 0
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл
	|		КОНЕЦ КАК ПредоплатаРеглПриход,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл < 0
	|				ТОГДА -РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПредоплатаРеглРасход,
	|		0 КАК ПредоплатаРеглНачальныйОстаток,
	|		0 КАК ПредоплатаРеглКонечныйОстаток,
	|		РасчетыСПоставщикамиПоДокументам.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		РасчетыСПоставщикамиПоДокументам.Регистратор КАК Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщикамиПоДокументам
	|	ГДЕ
	|		РасчетыСПоставщикамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И РасчетыСПоставщикамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСПоставщикамиПоДокументам.Активность
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоДокументам.АналитикаУчетаПоПартнерам,
	|		РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику,
	|		РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент,
	|		РасчетыСПоставщикамиПоДокументам.Валюта,
	|		0,
	|		РасчетыСПоставщикамиПоДокументам.ДолгРегл,
	|		0,
	|		0,
	|		0,
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл,
	|		0,
	|		0,
	|		РасчетыСПоставщикамиПоДокументам.ХозяйственнаяОперация,
	|		РасчетыСПоставщикамиПоДокументам.Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщикамиПоДокументам
	|	ГДЕ
	|		РасчетыСПоставщикамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСПоставщикамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСПоставщикамиПоДокументам.Активность
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоДокументам.АналитикаУчетаПоПартнерам,
	|		РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику,
	|		РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент,
	|		РасчетыСПоставщикамиПоДокументам.Валюта,
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл,
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		РасчетыСПоставщикамиПоДокументам.ХозяйственнаяОперация,
	|		РасчетыСПоставщикамиПоДокументам.Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщикамиПоДокументам
	|	ГДЕ
	|		(РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ПоступлениеУслугПрочихАктивов
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику)
	|		И РасчетыСПоставщикамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСПоставщикамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСПоставщикамиПоДокументам.Активность
	|		И РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоДокументам.АналитикаУчетаПоПартнерам,
	|		РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику,
	|		РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент,
	|		РасчетыСПоставщикамиПоДокументам.Валюта,
	|		0,
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл,
	|		0,
	|		-РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл,
	|		0,
	|		-РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл,
	|		0,
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл,
	|		РасчетыСПоставщикамиПоДокументам.ХозяйственнаяОперация,
	|		РасчетыСПоставщикамиПоДокументам.Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщикамиПоДокументам
	|	ГДЕ
	|		РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.КорректировкаПоступления
	|		И РасчетыСПоставщикамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСПоставщикамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСПоставщикамиПоДокументам.Активность
	|		И РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоДокументам.АналитикаУчетаПоПартнерам,
	|		РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику,
	|		РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент,
	|		РасчетыСПоставщикамиПоДокументам.Валюта,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА &НачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСПоставщикамиПоДокументам.ДолгРеглОстаток
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА &НачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСПоставщикамиПоДокументам.ПредоплатаРеглОстаток
	|		КОНЕЦ,
	|		0,
	|		NULL,
	|		NULL
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(&НачалоПериода, ) КАК РасчетыСПоставщикамиПоДокументам) КАК РасчетыСПоставщиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитики
	|		ПО (КлючиАналитики.Ссылка = РасчетыСПоставщиками.АналитикаУчетаПоПартнерам)
	|ГДЕ
	|	КлючиАналитики.Организация В(&МассивОрганизаций)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияКонтрагентКонтрагент.Организация КАК Организация,
	|	ДвиженияКонтрагентКонтрагент.Подразделение КАК Подразделение,
	|	ДвиженияКонтрагентКонтрагент.Контрагент КАК Контрагент,
	|	ДвиженияКонтрагентКонтрагент.ОбъектРасчетов.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	0,
	|	ВЫБОР
	|		КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгПоставщику)
	|			ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгПоставщику)
	|			ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансВыданный)
	|			ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансВыданный)
	|			ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	ДвиженияКонтрагентКонтрагент.ОбъектРасчетов,
	|	ДвиженияКонтрагентКонтрагент.ХозяйственнаяОперация,
	|	ДвиженияКонтрагентКонтрагент.Регистратор
	|ИЗ
	|	РегистрНакопления.ДвиженияКонтрагентКонтрагент.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности)
	|				И ТипСуммы В (ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансВыданный), ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгПоставщику))
	|				И Организация В (&МассивОрганизаций)) КАК ДвиженияКонтрагентКонтрагент
	|ГДЕ
	|	ДвиженияКонтрагентКонтрагент.Организация <> ДвиженияКонтрагентКонтрагент.ОбъектРасчетов.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлючиАналитики.Организация,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РасчетыСКлиентами.ЗаказКлиента.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(РасчетыСКлиентами.РасчетныйДокумент.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(РасчетыСКлиентами.ЗаказКлиента.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	КОНЕЦ КАК Подразделение,
	|	КлючиАналитики.Контрагент,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РасчетыСКлиентами.ЗаказКлиента.ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(РасчетыСКлиентами.РасчетныйДокумент.ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(РасчетыСКлиентами.ЗаказКлиента.ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка))
	|	КОНЕЦ КАК ГруппаФинансовогоУчета,
	|	РасчетыСКлиентами.ДолгРеглНачальныйОстаток,
	|	РасчетыСКлиентами.ДолгРеглПриход,
	|	РасчетыСКлиентами.ДолгРеглРасход,
	|	РасчетыСКлиентами.ДолгРеглКонечныйОстаток,
	|	РасчетыСКлиентами.ПредоплатаРеглНачальныйОстаток,
	|	РасчетыСКлиентами.ПредоплатаРеглПриход,
	|	РасчетыСКлиентами.ПредоплатаРеглРасход,
	|	РасчетыСКлиентами.ПредоплатаРеглКонечныйОстаток,
	|	РасчетыСКлиентами.РасчетныйДокумент
	|ПОМЕСТИТЬ ВТ_РасчетыСКлиентамиРег
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСКлиентамиПоДокументам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыСКлиентамиПоДокументам.ЗаказКлиента КАК ЗаказКлиента,
	|		РасчетыСКлиентамиПоДокументам.РасчетныйДокумент КАК РасчетныйДокумент,
	|		РасчетыСКлиентамиПоДокументам.Валюта КАК Валюта,
	|		РасчетыСКлиентамиПоДокументам.ДолгРегл КАК ДолгРеглПриход,
	|		0 КАК ДолгРеглРасход,
	|		0 КАК ДолгРеглНачальныйОстаток,
	|		0 КАК ДолгРеглКонечныйОстаток,
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаРегл КАК ПредоплатаРеглПриход,
	|		0 КАК ПредоплатаРеглРасход,
	|		0 КАК ПредоплатаРеглНачальныйОстаток,
	|		0 КАК ПредоплатаРеглКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|	ГДЕ
	|		РасчетыСКлиентамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И РасчетыСКлиентамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСКлиентамиПоДокументам.Активность
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоДокументам.АналитикаУчетаПоПартнерам,
	|		РасчетыСКлиентамиПоДокументам.ЗаказКлиента,
	|		РасчетыСКлиентамиПоДокументам.РасчетныйДокумент,
	|		РасчетыСКлиентамиПоДокументам.Валюта,
	|		ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоДокументам.ДолгРегл < 0
	|				ТОГДА -РасчетыСКлиентамиПоДокументам.ДолгРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоДокументам.ДолгРегл < 0
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСКлиентамиПоДокументам.ДолгРегл
	|		КОНЕЦ,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоДокументам.ПредоплатаРегл < 0
	|				ТОГДА -РасчетыСКлиентамиПоДокументам.ПредоплатаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоДокументам.ПредоплатаРегл < 0
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл
	|		КОНЕЦ,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|	ГДЕ
	|		РасчетыСКлиентамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСКлиентамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСКлиентамиПоДокументам.Активность
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоДокументам.АналитикаУчетаПоПартнерам,
	|		РасчетыСКлиентамиПоДокументам.ЗаказКлиента,
	|		РасчетыСКлиентамиПоДокументам.РасчетныйДокумент,
	|		РасчетыСКлиентамиПоДокументам.Валюта,
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаРегл,
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаРегл,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|	ГДЕ
	|		(РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|				ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.РеализацияУслугПрочихАктивов
	|				ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента)
	|		И РасчетыСКлиентамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И РасчетыСКлиентамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСКлиентамиПоДокументам.Активность
	|		И РасчетыСКлиентамиПоДокументам.ПредоплатаРегл <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоДокументам.АналитикаУчетаПоПартнерам,
	|		РасчетыСКлиентамиПоДокументам.ЗаказКлиента,
	|		РасчетыСКлиентамиПоДокументам.РасчетныйДокумент,
	|		РасчетыСКлиентамиПоДокументам.Валюта,
	|		0,
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаРегл,
	|		0,
	|		-РасчетыСКлиентамиПоДокументам.ПредоплатаРегл,
	|		0,
	|		-РасчетыСКлиентамиПоДокументам.ПредоплатаРегл,
	|		0,
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаРегл
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|	ГДЕ
	|		РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|		И РасчетыСКлиентамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И РасчетыСКлиентамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСКлиентамиПоДокументам.Активность
	|		И РасчетыСКлиентамиПоДокументам.ПредоплатаРегл <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоДокументам.АналитикаУчетаПоПартнерам,
	|		РасчетыСКлиентамиПоДокументам.ЗаказКлиента,
	|		РасчетыСКлиентамиПоДокументам.РасчетныйДокумент,
	|		РасчетыСКлиентамиПоДокументам.Валюта,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА &НачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСКлиентамиПоДокументам.ДолгРеглОстаток
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА &НачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСКлиентамиПоДокументам.ПредоплатаРеглОстаток
	|		КОНЕЦ,
	|		0
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(&НачалоПериода, ) КАК РасчетыСКлиентамиПоДокументам
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоДокументам.АналитикаУчетаПоПартнерам,
	|		РасчетыСКлиентамиПоДокументам.ЗаказКлиента,
	|		РасчетыСКлиентамиПоДокументам.РасчетныйДокумент,
	|		РасчетыСКлиентамиПоДокументам.Валюта,
	|		0,
	|		0,
	|		0,
	|		РасчетыСКлиентамиПоДокументам.ДолгРеглОстаток,
	|		0,
	|		0,
	|		0,
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаРеглОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(&КонецПериодаОстатков, ) КАК РасчетыСКлиентамиПоДокументам) КАК РасчетыСКлиентами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитики
	|		ПО (КлючиАналитики.Ссылка = РасчетыСКлиентами.АналитикаУчетаПоПартнерам)
	|ГДЕ
	|	КлючиАналитики.Организация В(&МассивОрганизаций)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияКонтрагентКонтрагент.Организация КАК Организация,
	|	ДвиженияКонтрагентКонтрагент.Подразделение КАК Подразделение,
	|	ДвиженияКонтрагентКонтрагент.КорКонтрагент КАК Контрагент,
	|	ДвиженияКонтрагентКонтрагент.ОбъектРасчетов.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	0,
	|	ВЫБОР
	|		КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгКлиента)
	|			ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгКлиента)
	|			ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансПолученный)
	|			ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансПолученный)
	|			ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	ДвиженияКонтрагентКонтрагент.ОбъектРасчетов
	|ИЗ
	|	РегистрНакопления.ДвиженияКонтрагентКонтрагент.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности)
	|				И ТипСуммы В (ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансПолученный), ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгКлиента))
	|				И Организация В (&МассивОрганизаций)) КАК ДвиженияКонтрагентКонтрагент
	|ГДЕ
	|	ДвиженияКонтрагентКонтрагент.Организация <> ДвиженияКонтрагентКонтрагент.ОбъектРасчетов.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлючиАналитики.Организация,
	|	КлючиАналитики.Контрагент,
	|	ВЫБОР
	|		КОГДА РасчетыПоКредитамДепозитам.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.Депозит)
	|						ТОГДА ВЫБОР
	|								КОГДА ДанныеДоговора.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета
	|									ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеСчетаВБанкеВНациональнойВалюте)
	|								ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеСчетаВБанкеВИностраннойВалюте)
	|							КОНЕЦ
	|					КОГДА ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.ЗаймВыданный)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСДругимиДебиторамиВНациональнойВалюте)
	|					КОГДА ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.КредитИлиЗайм)
	|						ТОГДА ВЫБОР
	|								КОГДА ДанныеДоговора.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета
	|									ТОГДА ВЫБОР
	|											КОГДА ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.Краткосрочный)
	|												ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеКредитыБанковВНациональнойВалюте)
	|											КОГДА ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.Долгосрочный)
	|												ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеКредитыБанковВНациональнойВалюте)
	|											КОГДА ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.ДолгосрочныйИстекающий)
	|												ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТекущаяЗадолженностьПоДолгосрочнымОбязательствамВНациональнойВалюте)
	|										КОНЕЦ
	|								ИНАЧЕ ВЫБОР
	|											КОГДА ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.Краткосрочный)
	|												ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеКредитыБанковВИностраннойВалюте)
	|											КОГДА ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.Долгосрочный)
	|												ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеКредитыБанковВИностраннойВалюте)
	|											КОГДА ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.ДолгосрочныйИстекающий)
	|												ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТекущаяЗадолженностьПоДолгосрочнымОбязательствамВИностраннойВалюте)
	|									КОНЕЦ
	|							КОНЕЦ
	|				КОНЕЦ
	|		КОГДА РасчетыПоКредитамДепозитам.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.ЗаймВыданный)
	|						ТОГДА НЕОПРЕДЕЛЕНО
	|					КОГДА ДанныеДоговора.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоНачисленнымПроцентамВНациональнойВалюте)
	|					ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоНачисленнымПроцентамВИностраннойВалюте)
	|				КОНЕЦ
	|	КОНЕЦ КАК СчетУчета,
	|	ДанныеДоговора.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ДанныеДоговора.Подразделение КАК Подразделение,
	|	РасчетыПоКредитамДепозитам.СуммаРеглНачальныйОстаток,
	|	РасчетыПоКредитамДепозитам.СуммаРеглПриход,
	|	РасчетыПоКредитамДепозитам.СуммаРеглРасход,
	|	РасчетыПоКредитамДепозитам.СуммаРеглКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_РасчетыПоКредитамДепозитамРег
	|ИЗ
	|	РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ) КАК РасчетыПоКредитамДепозитам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитики
	|		ПО (КлючиАналитики.Ссылка = РасчетыПоКредитамДепозитам.АналитикаУчетаПоПартнерам)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКредитовИДепозитов КАК ДанныеДоговора
	|		ПО (ДанныеДоговора.Ссылка = РасчетыПоКредитамДепозитам.Договор)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	КлючиАналитики.Организация В(&МассивОрганизаций)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасчетыСПоставщикамиРег.Организация,
	|	ВТ_РасчетыСПоставщикамиРег.Контрагент,
	|	ВЫБОР
	|		КОГДА ВТ_РасчетыСПоставщикамиРег.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомитенту)
	|			ТОГДА ПорядокОтраженияРасчетовСПартнерами.СчетУчетаРасчетовСПоставщиками
	|		КОГДА ВТ_РасчетыСПоставщикамиРег.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
	|			ТОГДА ПорядокОтраженияРасчетовСПартнерами.СчетУчетаРасчетовПоВознаграждению
	|		КОГДА ЕСТЬNULL(ПорядокОтраженияРасчетовСПартнерами.СчетУчетаРасчетовСПоставщиками, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА ГруппыФинансовогоУчетаРасчетов.СчетУчетаРасчетовСПоставщиками
	|		ИНАЧЕ ЕСТЬNULL(ПорядокОтраженияРасчетовСПартнерами.СчетУчетаРасчетовСПоставщиками, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
	|	КОНЕЦ КАК СчетУчетаРасчетов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПорядокОтраженияРасчетовСПартнерами.СчетУчетаАвансовВыданных, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА ГруппыФинансовогоУчетаРасчетов.СчетУчетаАвансовВыданных
	|		ИНАЧЕ ЕСТЬNULL(ПорядокОтраженияРасчетовСПартнерами.СчетУчетаАвансовВыданных, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
	|	КОНЕЦ КАК СчетУчетаАванса,
	|	ВТ_РасчетыСПоставщикамиРег.Подразделение,
	|	ВТ_РасчетыСПоставщикамиРег.ГруппаФинансовогоУчета,
	|	ВТ_РасчетыСПоставщикамиРег.ДолгРеглНачальныйОстаток,
	|	ВТ_РасчетыСПоставщикамиРег.ДолгРеглПриход,
	|	ВТ_РасчетыСПоставщикамиРег.ДолгРеглРасход,
	|	ВТ_РасчетыСПоставщикамиРег.ДолгРеглКонечныйОстаток,
	|	ВТ_РасчетыСПоставщикамиРег.ПредоплатаРеглНачальныйОстаток,
	|	ВТ_РасчетыСПоставщикамиРег.ПредоплатаРеглПриход,
	|	ВТ_РасчетыСПоставщикамиРег.ПредоплатаРеглРасход,
	|	ВТ_РасчетыСПоставщикамиРег.ПредоплатаРеглКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_РасчетыСПоставщиками
	|ИЗ
	|	ВТ_РасчетыСПоставщикамиРег КАК ВТ_РасчетыСПоставщикамиРег
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияРасчетовСПартнерами КАК ПорядокОтраженияРасчетовСПартнерами
	|		ПО ВТ_РасчетыСПоставщикамиРег.Организация = ПорядокОтраженияРасчетовСПартнерами.Организация
	|			И ВТ_РасчетыСПоставщикамиРег.ГруппаФинансовогоУчета = ПорядокОтраженияРасчетовСПартнерами.ГруппаФинансовогоУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыФинансовогоУчетаРасчетов КАК ГруппыФинансовогоУчетаРасчетов
	|		ПО (ГруппыФинансовогоУчетаРасчетов.Ссылка = ВТ_РасчетыСПоставщикамиРег.ГруппаФинансовогоУчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасчетыСКлиентамиРег.Организация,
	|	ВТ_РасчетыСКлиентамиРег.Контрагент,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПорядокОтраженияРасчетовСПартнерами.СчетУчетаРасчетовСКлиентами, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА ГруппыФинансовогоУчетаРасчетов.СчетУчетаРасчетовСКлиентами
	|		ИНАЧЕ ЕСТЬNULL(ПорядокОтраженияРасчетовСПартнерами.СчетУчетаРасчетовСКлиентами, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
	|	КОНЕЦ КАК СчетУчетаРасчетов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПорядокОтраженияРасчетовСПартнерами.СчетУчетаАвансовПолученных, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА ГруппыФинансовогоУчетаРасчетов.СчетУчетаАвансовПолученных
	|		ИНАЧЕ ЕСТЬNULL(ПорядокОтраженияРасчетовСПартнерами.СчетУчетаАвансовПолученных, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
	|	КОНЕЦ КАК СчетУчетаАванса,
	|	ВТ_РасчетыСКлиентамиРег.Подразделение,
	|	ВТ_РасчетыСКлиентамиРег.ГруппаФинансовогоУчета,
	|	ВТ_РасчетыСКлиентамиРег.ДолгРеглНачальныйОстаток,
	|	ВТ_РасчетыСКлиентамиРег.ДолгРеглПриход,
	|	ВТ_РасчетыСКлиентамиРег.ДолгРеглРасход,
	|	ВТ_РасчетыСКлиентамиРег.ДолгРеглКонечныйОстаток,
	|	ВТ_РасчетыСКлиентамиРег.ПредоплатаРеглНачальныйОстаток,
	|	ВТ_РасчетыСКлиентамиРег.ПредоплатаРеглПриход,
	|	ВТ_РасчетыСКлиентамиРег.ПредоплатаРеглРасход,
	|	ВТ_РасчетыСКлиентамиРег.ПредоплатаРеглКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_РасчетыСКлиентами
	|ИЗ
	|	ВТ_РасчетыСКлиентамиРег КАК ВТ_РасчетыСКлиентамиРег
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияРасчетовСПартнерами КАК ПорядокОтраженияРасчетовСПартнерами
	|		ПО ВТ_РасчетыСКлиентамиРег.Организация = ПорядокОтраженияРасчетовСПартнерами.Организация
	|			И ВТ_РасчетыСКлиентамиРег.ГруппаФинансовогоУчета = ПорядокОтраженияРасчетовСПартнерами.ГруппаФинансовогоУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыФинансовогоУчетаРасчетов КАК ГруппыФинансовогоУчетаРасчетов
	|		ПО (ГруппыФинансовогоУчетаРасчетов.Ссылка = ВТ_РасчетыСКлиентамиРег.ГруппаФинансовогоУчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасчетыПоКредитамДепозитамРег.Организация,
	|	ВТ_РасчетыПоКредитамДепозитамРег.Контрагент,
	|	ВЫБОР
	|		КОГДА ВТ_РасчетыПоКредитамДепозитамРег.СчетУчета = НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ПорядокОтраженияРасчетовСПартнерами.СчетУчетаРасчетовСКлиентами, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|						ТОГДА ГруппыФинансовогоУчетаРасчетов.СчетУчетаРасчетовСКлиентами
	|					ИНАЧЕ ЕСТЬNULL(ПорядокОтраженияРасчетовСПартнерами.СчетУчетаРасчетовСКлиентами, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_РасчетыПоКредитамДепозитамРег.СчетУчета
	|	КОНЕЦ КАК Счет,
	|	ВТ_РасчетыПоКредитамДепозитамРег.Подразделение,
	|	ВТ_РасчетыПоКредитамДепозитамРег.ГруппаФинансовогоУчета,
	|	ВТ_РасчетыПоКредитамДепозитамРег.СуммаРеглНачальныйОстаток,
	|	ВТ_РасчетыПоКредитамДепозитамРег.СуммаРеглПриход,
	|	ВТ_РасчетыПоКредитамДепозитамРег.СуммаРеглРасход,
	|	ВТ_РасчетыПоКредитамДепозитамРег.СуммаРеглКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_РасчетыПоКредитамДепозитам
	|ИЗ
	|	ВТ_РасчетыПоКредитамДепозитамРег КАК ВТ_РасчетыПоКредитамДепозитамРег
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияРасчетовСПартнерами КАК ПорядокОтраженияРасчетовСПартнерами
	|		ПО ВТ_РасчетыПоКредитамДепозитамРег.Организация = ПорядокОтраженияРасчетовСПартнерами.Организация
	|			И ВТ_РасчетыПоКредитамДепозитамРег.ГруппаФинансовогоУчета = ПорядокОтраженияРасчетовСПартнерами.ГруппаФинансовогоУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыФинансовогоУчетаРасчетов КАК ГруппыФинансовогоУчетаРасчетов
	|		ПО (ГруппыФинансовогоУчетаРасчетов.Ссылка = ВТ_РасчетыПоКредитамДепозитамРег.ГруппаФинансовогоУчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	3 КАК РазделУчета,
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ХозрасчетныйОстаткиИОбороты.Подразделение,
	|	ХозрасчетныйОстаткиИОбороты.Счет,
	|	ХозрасчетныйОстаткиИОбороты.Субконто1,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_РасчетыСКонтрагентамиРегл
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками)), , Организация В (&МассивОрганизаций)) КАК ХозрасчетныйОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ХозрасчетныйОстаткиИОбороты.Подразделение,
	|	ХозрасчетныйОстаткиИОбороты.Счет,
	|	ХозрасчетныйОстаткиИОбороты.Субконто1,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками)), , Организация В (&МассивОрганизаций)) КАК ХозрасчетныйОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ХозрасчетныйОстаткиИОбороты.Подразделение,
	|	ХозрасчетныйОстаткиИОбороты.Счет,
	|	ХозрасчетныйОстаткиИОбороты.Субконто1,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Счет В ИЕРАРХИИ (&СчетаУчетаРасчетов5), , Организация В (&МассивОрганизаций)) КАК ХозрасчетныйОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Субконто2) = ТИП(Справочник.ДоговорыКредитовИДепозитов)
	|			ТОГДА 5
	|		ИНАЧЕ 6
	|	КОНЕЦ,
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ХозрасчетныйОстаткиИОбороты.Подразделение,
	|	ХозрасчетныйОстаткиИОбороты.Счет,
	|	ХозрасчетныйОстаткиИОбороты.Субконто1,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСДругимиДебиторами)), , Организация В (&МассивОрганизаций)) КАК ХозрасчетныйОстаткиИОбороты
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ХозрасчетныйОстаткиИОбороты.Подразделение,
	|	ХозрасчетныйОстаткиИОбороты.Счет,
	|	ХозрасчетныйОстаткиИОбороты.Субконто1,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Счет В ИЕРАРХИИ (&СчетаУчетаРасчетов6), , Организация В (&МассивОрганизаций)) КАК ХозрасчетныйОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Подзапрос.РазделУчета КАК РазделУчета,
	|	Подзапрос.Организация,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетУчета КАК СчетБУ,
	|	Подзапрос.Аналитика1,
	|	СУММА(Подзапрос.НачальныйОстаток) КАК НачальныйОстаток,
	|	СУММА(Подзапрос.Приход) КАК Приход,
	|	СУММА(Подзапрос.Расход) КАК Расход,
	|	СУММА(Подзапрос.КонечныйОстаток) КАК КонечныйОстаток,
	|	СУММА(Подзапрос.НачальноеСальдо) КАК НачальноеСальдо,
	|	СУММА(Подзапрос.ОборотДт) КАК ОборотДт,
	|	СУММА(Подзапрос.ОборотКт) КАК ОборотКт,
	|	СУММА(Подзапрос.КонечноеСальдо) КАК КонечноеСальдо
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ВТ_РасчетыСПоставщиками.СчетУчетаРасчетов В ИЕРАРХИИ (&СчетаУчетаРасчетов6)
	|				ТОГДА 6
	|			ИНАЧЕ 3
	|		КОНЕЦ КАК РазделУчета,
	|		ВТ_РасчетыСПоставщиками.Организация КАК Организация,
	|		ВТ_РасчетыСПоставщиками.Подразделение КАК Подразделение,
	|		ВТ_РасчетыСПоставщиками.СчетУчетаРасчетов КАК СчетУчета,
	|		ВТ_РасчетыСПоставщиками.Контрагент КАК Аналитика1,
	|		ВТ_РасчетыСПоставщиками.ДолгРеглНачальныйОстаток КАК НачальныйОстаток,
	|		ВТ_РасчетыСПоставщиками.ДолгРеглПриход КАК Приход,
	|		ВТ_РасчетыСПоставщиками.ДолгРеглРасход КАК Расход,
	|		ВТ_РасчетыСПоставщиками.ДолгРеглКонечныйОстаток КАК КонечныйОстаток,
	|		0 КАК НачальноеСальдо,
	|		0 КАК ОборотДт,
	|		0 КАК ОборотКт,
	|		0 КАК КонечноеСальдо
	|	ИЗ
	|		ВТ_РасчетыСПоставщиками КАК ВТ_РасчетыСПоставщиками
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ВТ_РасчетыСПоставщиками.СчетУчетаАванса В ИЕРАРХИИ (&СчетаУчетаРасчетов6)
	|				ТОГДА 6
	|			ИНАЧЕ 3
	|		КОНЕЦ,
	|		ВТ_РасчетыСПоставщиками.Организация,
	|		ВТ_РасчетыСПоставщиками.Подразделение,
	|		ВТ_РасчетыСПоставщиками.СчетУчетаАванса,
	|		ВТ_РасчетыСПоставщиками.Контрагент,
	|		ВТ_РасчетыСПоставщиками.ПредоплатаРеглНачальныйОстаток,
	|		ВТ_РасчетыСПоставщиками.ПредоплатаРеглПриход,
	|		ВТ_РасчетыСПоставщиками.ПредоплатаРеглРасход,
	|		ВТ_РасчетыСПоставщиками.ПредоплатаРеглКонечныйОстаток,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТ_РасчетыСПоставщиками КАК ВТ_РасчетыСПоставщиками
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ВТ_РасчетыСКлиентами.СчетУчетаРасчетов В ИЕРАРХИИ (&СчетаУчетаРасчетов6)
	|				ТОГДА 6
	|			ИНАЧЕ 4
	|		КОНЕЦ,
	|		ВТ_РасчетыСКлиентами.Организация,
	|		ВТ_РасчетыСКлиентами.Подразделение,
	|		ВТ_РасчетыСКлиентами.СчетУчетаРасчетов,
	|		ВТ_РасчетыСКлиентами.Контрагент,
	|		ВТ_РасчетыСКлиентами.ДолгРеглНачальныйОстаток,
	|		ВТ_РасчетыСКлиентами.ДолгРеглПриход,
	|		ВТ_РасчетыСКлиентами.ДолгРеглРасход,
	|		ВТ_РасчетыСКлиентами.ДолгРеглКонечныйОстаток,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТ_РасчетыСКлиентами КАК ВТ_РасчетыСКлиентами
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ВТ_РасчетыСКлиентами.СчетУчетаАванса В ИЕРАРХИИ (&СчетаУчетаРасчетов6)
	|				ТОГДА 6
	|			ИНАЧЕ 4
	|		КОНЕЦ,
	|		ВТ_РасчетыСКлиентами.Организация,
	|		ВТ_РасчетыСКлиентами.Подразделение,
	|		ВТ_РасчетыСКлиентами.СчетУчетаАванса,
	|		ВТ_РасчетыСКлиентами.Контрагент,
	|		ВТ_РасчетыСКлиентами.ПредоплатаРеглНачальныйОстаток,
	|		ВТ_РасчетыСКлиентами.ПредоплатаРеглПриход,
	|		ВТ_РасчетыСКлиентами.ПредоплатаРеглРасход,
	|		ВТ_РасчетыСКлиентами.ПредоплатаРеглКонечныйОстаток,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТ_РасчетыСКлиентами КАК ВТ_РасчетыСКлиентами
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		5,
	|		РасчетыПоКредитамДепозитам.Организация,
	|		РасчетыПоКредитамДепозитам.Подразделение,
	|		РасчетыПоКредитамДепозитам.Счет,
	|		РасчетыПоКредитамДепозитам.Контрагент,
	|		РасчетыПоКредитамДепозитам.СуммаРеглНачальныйОстаток,
	|		РасчетыПоКредитамДепозитам.СуммаРеглПриход,
	|		РасчетыПоКредитамДепозитам.СуммаРеглРасход,
	|		РасчетыПоКредитамДепозитам.СуммаРеглКонечныйОстаток,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТ_РасчетыПоКредитамДепозитам КАК РасчетыПоКредитамДепозитам
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_РасчетыСКонтрагентамиРегл.РазделУчета,
	|		ВТ_РасчетыСКонтрагентамиРегл.Организация,
	|		ВТ_РасчетыСКонтрагентамиРегл.Подразделение,
	|		ВТ_РасчетыСКонтрагентамиРегл.Счет,
	|		ВТ_РасчетыСКонтрагентамиРегл.Субконто1,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВТ_РасчетыСКонтрагентамиРегл.СуммаНачальныйОстаток,
	|		ВТ_РасчетыСКонтрагентамиРегл.СуммаОборотДт,
	|		ВТ_РасчетыСКонтрагентамиРегл.СуммаОборотКт,
	|		ВТ_РасчетыСКонтрагентамиРегл.СуммаКонечныйОстаток
	|	ИЗ
	|		ВТ_РасчетыСКонтрагентамиРегл КАК ВТ_РасчетыСКонтрагентамиРегл) КАК Подзапрос
	|ГДЕ
	|	(Подзапрос.РазделУчета = &РазделУчета
	|			ИЛИ &РазделУчета = 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	Подзапрос.РазделУчета,
	|	Подзапрос.Организация,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетУчета,
	|	Подзапрос.Аналитика1
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Подзапрос.НачальныйОстаток) <> 0
	|		ИЛИ СУММА(Подзапрос.Приход) <> 0
	|		ИЛИ СУММА(Подзапрос.Расход) <> 0
	|		ИЛИ СУММА(Подзапрос.КонечныйОстаток) <> 0
	|		ИЛИ СУММА(Подзапрос.НачальноеСальдо) <> 0
	|		ИЛИ СУММА(Подзапрос.ОборотДт) <> 0
	|		ИЛИ СУММА(Подзапрос.ОборотКт) <> 0
	|		ИЛИ СУММА(Подзапрос.КонечноеСальдо) <> 0)";
	
КонецФункции

Функция ТекстЗапросаРасчетыСКонтрагентамиПоРегистраторам()
	
	Возврат
	"ВЫБРАТЬ
	|	КлючиАналитики.Организация,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РасчетыСПоставщиками.ЗаказПоставщику.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(РасчетыСПоставщиками.РасчетныйДокумент.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(РасчетыСПоставщиками.ЗаказПоставщику.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	КОНЕЦ КАК Подразделение,
	|	КлючиАналитики.Контрагент,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РасчетыСПоставщиками.ЗаказПоставщику.ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(РасчетыСПоставщиками.РасчетныйДокумент.ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(РасчетыСПоставщиками.ЗаказПоставщику.ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка))
	|	КОНЕЦ КАК ГруппаФинансовогоУчета,
	|	РасчетыСПоставщиками.ДолгРеглПриход,
	|	РасчетыСПоставщиками.ДолгРеглРасход,
	|	РасчетыСПоставщиками.ПредоплатаРеглПриход,
	|	РасчетыСПоставщиками.ПредоплатаРеглРасход,
	|	РасчетыСПоставщиками.РасчетныйДокумент,
	|	РасчетыСПоставщиками.ХозяйственнаяОперация,
	|	РасчетыСПоставщиками.Регистратор
	|ПОМЕСТИТЬ ВТ_РасчетыСПоставщикамиРег
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоДокументам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику КАК ЗаказПоставщику,
	|		РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент КАК РасчетныйДокумент,
	|		РасчетыСПоставщикамиПоДокументам.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоДокументам.ДолгРегл < 0
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСПоставщикамиПоДокументам.ДолгРегл
	|		КОНЕЦ КАК ДолгРеглПриход,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоДокументам.ДолгРегл < 0
	|				ТОГДА -РасчетыСПоставщикамиПоДокументам.ДолгРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ДолгРеглРасход,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл < 0
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл
	|		КОНЕЦ КАК ПредоплатаРеглПриход,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл < 0
	|				ТОГДА -РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПредоплатаРеглРасход,
	|		РасчетыСПоставщикамиПоДокументам.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		РасчетыСПоставщикамиПоДокументам.Регистратор КАК Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщикамиПоДокументам
	|	ГДЕ
	|		РасчетыСПоставщикамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И РасчетыСПоставщикамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСПоставщикамиПоДокументам.Активность
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоДокументам.АналитикаУчетаПоПартнерам,
	|		РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику,
	|		РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент,
	|		РасчетыСПоставщикамиПоДокументам.Валюта,
	|		0,
	|		РасчетыСПоставщикамиПоДокументам.ДолгРегл,
	|		0,
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл,
	|		РасчетыСПоставщикамиПоДокументам.ХозяйственнаяОперация,
	|		РасчетыСПоставщикамиПоДокументам.Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщикамиПоДокументам
	|	ГДЕ
	|		РасчетыСПоставщикамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСПоставщикамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСПоставщикамиПоДокументам.Активность
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоДокументам.АналитикаУчетаПоПартнерам,
	|		РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику,
	|		РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент,
	|		РасчетыСПоставщикамиПоДокументам.Валюта,
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл,
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл,
	|		0,
	|		0,
	|		РасчетыСПоставщикамиПоДокументам.ХозяйственнаяОперация,
	|		РасчетыСПоставщикамиПоДокументам.Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщикамиПоДокументам
	|	ГДЕ
	|		(РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ПоступлениеУслугПрочихАктивов
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику)
	|		И РасчетыСПоставщикамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСПоставщикамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСПоставщикамиПоДокументам.Активность
	|		И РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоДокументам.АналитикаУчетаПоПартнерам,
	|		РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику,
	|		РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент,
	|		РасчетыСПоставщикамиПоДокументам.Валюта,
	|		0,
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл,
	|		0,
	|		-РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл,
	|		РасчетыСПоставщикамиПоДокументам.ХозяйственнаяОперация,
	|		РасчетыСПоставщикамиПоДокументам.Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщикамиПоДокументам
	|	ГДЕ
	|		РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.КорректировкаПоступления
	|		И РасчетыСПоставщикамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСПоставщикамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСПоставщикамиПоДокументам.Активность
	|		И РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл <> 0) КАК РасчетыСПоставщиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитики
	|		ПО (КлючиАналитики.Ссылка = РасчетыСПоставщиками.АналитикаУчетаПоПартнерам)
	|ГДЕ
	|	КлючиАналитики.Организация В(&МассивОрганизаций)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияКонтрагентКонтрагент.Организация КАК Организация,
	|	ДвиженияКонтрагентКонтрагент.Подразделение КАК Подразделение,
	|	ДвиженияКонтрагентКонтрагент.Контрагент КАК Контрагент,
	|	ДвиженияКонтрагентКонтрагент.ОбъектРасчетов.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгПоставщику)
	|			ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгПоставщику)
	|			ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансВыданный)
	|			ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансВыданный)
	|			ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ДвиженияКонтрагентКонтрагент.ОбъектРасчетов,
	|	ДвиженияКонтрагентКонтрагент.ХозяйственнаяОперация,
	|	ДвиженияКонтрагентКонтрагент.Регистратор
	|ИЗ
	|	РегистрНакопления.ДвиженияКонтрагентКонтрагент.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности)
	|				И ТипСуммы В (ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансВыданный), ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгПоставщику))
	|				И Организация В (&МассивОрганизаций)) КАК ДвиженияКонтрагентКонтрагент
	|ГДЕ
	|	ДвиженияКонтрагентКонтрагент.Организация <> ДвиженияКонтрагентКонтрагент.ОбъектРасчетов.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлючиАналитики.Организация,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РасчетыСКлиентами.ЗаказКлиента.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(РасчетыСКлиентами.РасчетныйДокумент.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(РасчетыСКлиентами.ЗаказКлиента.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	КОНЕЦ КАК Подразделение,
	|	КлючиАналитики.Контрагент,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РасчетыСКлиентами.ЗаказКлиента.ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(РасчетыСКлиентами.РасчетныйДокумент.ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(РасчетыСКлиентами.ЗаказКлиента.ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка))
	|	КОНЕЦ КАК ГруппаФинансовогоУчета,
	|	РасчетыСКлиентами.ДолгРеглПриход,
	|	РасчетыСКлиентами.ДолгРеглРасход,
	|	РасчетыСКлиентами.ПредоплатаРеглПриход,
	|	РасчетыСКлиентами.ПредоплатаРеглРасход,
	|	РасчетыСКлиентами.РасчетныйДокумент,
	|	РасчетыСКлиентами.Регистратор
	|ПОМЕСТИТЬ ВТ_РасчетыСКлиентамиРег
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСКлиентамиПоДокументам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыСКлиентамиПоДокументам.ЗаказКлиента КАК ЗаказКлиента,
	|		РасчетыСКлиентамиПоДокументам.РасчетныйДокумент КАК РасчетныйДокумент,
	|		РасчетыСКлиентамиПоДокументам.Валюта КАК Валюта,
	|		РасчетыСКлиентамиПоДокументам.ДолгРегл КАК ДолгРеглПриход,
	|		0 КАК ДолгРеглРасход,
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаРегл КАК ПредоплатаРеглПриход,
	|		0 КАК ПредоплатаРеглРасход,
	|		РасчетыСКлиентамиПоДокументам.Регистратор КАК Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|	ГДЕ
	|		РасчетыСКлиентамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И РасчетыСКлиентамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСКлиентамиПоДокументам.Активность
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоДокументам.АналитикаУчетаПоПартнерам,
	|		РасчетыСКлиентамиПоДокументам.ЗаказКлиента,
	|		РасчетыСКлиентамиПоДокументам.РасчетныйДокумент,
	|		РасчетыСКлиентамиПоДокументам.Валюта,
	|		ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоДокументам.ДолгРегл < 0
	|				ТОГДА -РасчетыСКлиентамиПоДокументам.ДолгРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоДокументам.ДолгРегл < 0
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСКлиентамиПоДокументам.ДолгРегл
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоДокументам.ПредоплатаРегл < 0
	|				ТОГДА -РасчетыСКлиентамиПоДокументам.ПредоплатаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоДокументам.ПредоплатаРегл < 0
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл
	|		КОНЕЦ,
	|		РасчетыСКлиентамиПоДокументам.Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|	ГДЕ
	|		РасчетыСКлиентамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСКлиентамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСКлиентамиПоДокументам.Активность
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоДокументам.АналитикаУчетаПоПартнерам,
	|		РасчетыСКлиентамиПоДокументам.ЗаказКлиента,
	|		РасчетыСКлиентамиПоДокументам.РасчетныйДокумент,
	|		РасчетыСКлиентамиПоДокументам.Валюта,
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаРегл,
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаРегл,
	|		0,
	|		0,
	|		РасчетыСКлиентамиПоДокументам.Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|	ГДЕ
	|		(РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|				ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.РеализацияУслугПрочихАктивов
	|				ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента)
	|		И РасчетыСКлиентамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И РасчетыСКлиентамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСКлиентамиПоДокументам.Активность
	|		И РасчетыСКлиентамиПоДокументам.ПредоплатаРегл <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоДокументам.АналитикаУчетаПоПартнерам,
	|		РасчетыСКлиентамиПоДокументам.ЗаказКлиента,
	|		РасчетыСКлиентамиПоДокументам.РасчетныйДокумент,
	|		РасчетыСКлиентамиПоДокументам.Валюта,
	|		0,
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаРегл,
	|		0,
	|		-РасчетыСКлиентамиПоДокументам.ПредоплатаРегл,
	|		РасчетыСКлиентамиПоДокументам.Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|	ГДЕ
	|		РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|		И РасчетыСКлиентамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И РасчетыСКлиентамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСКлиентамиПоДокументам.Активность
	|		И РасчетыСКлиентамиПоДокументам.ПредоплатаРегл <> 0) КАК РасчетыСКлиентами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитики
	|		ПО (КлючиАналитики.Ссылка = РасчетыСКлиентами.АналитикаУчетаПоПартнерам)
	|ГДЕ
	|	КлючиАналитики.Организация В(&МассивОрганизаций)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияКонтрагентКонтрагент.Организация КАК Организация,
	|	ДвиженияКонтрагентКонтрагент.Подразделение КАК Подразделение,
	|	ДвиженияКонтрагентКонтрагент.КорКонтрагент КАК Контрагент,
	|	ДвиженияКонтрагентКонтрагент.ОбъектРасчетов.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгКлиента)
	|			ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгКлиента)
	|			ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансПолученный)
	|			ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансПолученный)
	|			ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ДвиженияКонтрагентКонтрагент.ОбъектРасчетов,
	|	ДвиженияКонтрагентКонтрагент.Регистратор
	|ИЗ
	|	РегистрНакопления.ДвиженияКонтрагентКонтрагент.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности)
	|				И ТипСуммы В (ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансПолученный), ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгКлиента))
	|				И Организация В (&МассивОрганизаций)) КАК ДвиженияКонтрагентКонтрагент
	|ГДЕ
	|	ДвиженияКонтрагентКонтрагент.Организация <> ДвиженияКонтрагентКонтрагент.ОбъектРасчетов.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлючиАналитики.Организация,
	|	КлючиАналитики.Контрагент,
	|	ВЫБОР
	|		КОГДА РасчетыПоКредитамДепозитам.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.Депозит)
	|						ТОГДА ВЫБОР
	|								КОГДА ДанныеДоговора.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета
	|									ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеСчетаВБанкеВНациональнойВалюте)
	|								ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеСчетаВБанкеВИностраннойВалюте)
	|							КОНЕЦ
	|					КОГДА ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.ЗаймВыданный)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСДругимиДебиторамиВНациональнойВалюте)
	|					КОГДА ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.КредитИлиЗайм)
	|						ТОГДА ВЫБОР
	|								КОГДА ДанныеДоговора.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета
	|									ТОГДА ВЫБОР
	|											КОГДА ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.Краткосрочный)
	|												ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеКредитыБанковВНациональнойВалюте)
	|											КОГДА ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.Долгосрочный)
	|												ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеКредитыБанковВНациональнойВалюте)
	|											КОГДА ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.ДолгосрочныйИстекающий)
	|												ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТекущаяЗадолженностьПоДолгосрочнымОбязательствамВНациональнойВалюте)
	|										КОНЕЦ
	|								ИНАЧЕ ВЫБОР
	|											КОГДА ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.Краткосрочный)
	|												ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеКредитыБанковВИностраннойВалюте)
	|											КОГДА ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.Долгосрочный)
	|												ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеКредитыБанковВИностраннойВалюте)
	|											КОГДА ДанныеДоговора.ТипСрочности = ЗНАЧЕНИЕ(Перечисление.ТипыСрочностиКредитовИДепозитов.ДолгосрочныйИстекающий)
	|												ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТекущаяЗадолженностьПоДолгосрочнымОбязательствамВИностраннойВалюте)
	|									КОНЕЦ
	|							КОНЕЦ
	|				КОНЕЦ
	|		КОГДА РасчетыПоКредитамДепозитам.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.ЗаймВыданный)
	|						ТОГДА НЕОПРЕДЕЛЕНО
	|					КОГДА ДанныеДоговора.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоНачисленнымПроцентамВНациональнойВалюте)
	|					ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоНачисленнымПроцентамВИностраннойВалюте)
	|				КОНЕЦ
	|	КОНЕЦ КАК СчетУчета,
	|	ДанныеДоговора.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ДанныеДоговора.Подразделение КАК Подразделение,
	|	РасчетыПоКредитамДепозитам.СуммаРеглПриход,
	|	РасчетыПоКредитамДепозитам.СуммаРеглРасход,
	|	РасчетыПоКредитамДепозитам.Регистратор
	|ПОМЕСТИТЬ ВТ_РасчетыПоКредитамДепозитамРег
	|ИЗ
	|	РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, Движения, ) КАК РасчетыПоКредитамДепозитам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитики
	|		ПО (КлючиАналитики.Ссылка = РасчетыПоКредитамДепозитам.АналитикаУчетаПоПартнерам)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКредитовИДепозитов КАК ДанныеДоговора
	|		ПО (ДанныеДоговора.Ссылка = РасчетыПоКредитамДепозитам.Договор)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	КлючиАналитики.Организация В(&МассивОрганизаций)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасчетыСПоставщикамиРег.Организация,
	|	ВТ_РасчетыСПоставщикамиРег.Контрагент,
	|	ВЫБОР
	|		КОГДА ВТ_РасчетыСПоставщикамиРег.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомитенту)
	|			ТОГДА ПорядокОтраженияРасчетовСПартнерами.СчетУчетаРасчетовСПоставщиками
	|		КОГДА ВТ_РасчетыСПоставщикамиРег.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
	|			ТОГДА ПорядокОтраженияРасчетовСПартнерами.СчетУчетаРасчетовПоВознаграждению
	|		КОГДА ЕСТЬNULL(ПорядокОтраженияРасчетовСПартнерами.СчетУчетаРасчетовСПоставщиками, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА ГруппыФинансовогоУчетаРасчетов.СчетУчетаРасчетовСПоставщиками
	|		ИНАЧЕ ЕСТЬNULL(ПорядокОтраженияРасчетовСПартнерами.СчетУчетаРасчетовСПоставщиками, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
	|	КОНЕЦ КАК СчетУчетаРасчетов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПорядокОтраженияРасчетовСПартнерами.СчетУчетаАвансовВыданных, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА ГруппыФинансовогоУчетаРасчетов.СчетУчетаАвансовВыданных
	|		ИНАЧЕ ЕСТЬNULL(ПорядокОтраженияРасчетовСПартнерами.СчетУчетаАвансовВыданных, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
	|	КОНЕЦ КАК СчетУчетаАванса,
	|	ВТ_РасчетыСПоставщикамиРег.Подразделение,
	|	ВТ_РасчетыСПоставщикамиРег.ГруппаФинансовогоУчета,
	|	ВТ_РасчетыСПоставщикамиРег.ДолгРеглПриход,
	|	ВТ_РасчетыСПоставщикамиРег.ДолгРеглРасход,
	|	ВТ_РасчетыСПоставщикамиРег.ПредоплатаРеглПриход,
	|	ВТ_РасчетыСПоставщикамиРег.ПредоплатаРеглРасход,
	|	ВТ_РасчетыСПоставщикамиРег.Регистратор
	|ПОМЕСТИТЬ ВТ_РасчетыСПоставщиками
	|ИЗ
	|	ВТ_РасчетыСПоставщикамиРег КАК ВТ_РасчетыСПоставщикамиРег
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияРасчетовСПартнерами КАК ПорядокОтраженияРасчетовСПартнерами
	|		ПО ВТ_РасчетыСПоставщикамиРег.Организация = ПорядокОтраженияРасчетовСПартнерами.Организация
	|			И ВТ_РасчетыСПоставщикамиРег.ГруппаФинансовогоУчета = ПорядокОтраженияРасчетовСПартнерами.ГруппаФинансовогоУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыФинансовогоУчетаРасчетов КАК ГруппыФинансовогоУчетаРасчетов
	|		ПО (ГруппыФинансовогоУчетаРасчетов.Ссылка = ВТ_РасчетыСПоставщикамиРег.ГруппаФинансовогоУчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасчетыСКлиентамиРег.Организация,
	|	ВТ_РасчетыСКлиентамиРег.Контрагент,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПорядокОтраженияРасчетовСПартнерами.СчетУчетаРасчетовСКлиентами, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА ГруппыФинансовогоУчетаРасчетов.СчетУчетаРасчетовСКлиентами
	|		ИНАЧЕ ЕСТЬNULL(ПорядокОтраженияРасчетовСПартнерами.СчетУчетаРасчетовСКлиентами, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
	|	КОНЕЦ КАК СчетУчетаРасчетов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПорядокОтраженияРасчетовСПартнерами.СчетУчетаАвансовПолученных, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА ГруппыФинансовогоУчетаРасчетов.СчетУчетаАвансовПолученных
	|		ИНАЧЕ ЕСТЬNULL(ПорядокОтраженияРасчетовСПартнерами.СчетУчетаАвансовПолученных, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
	|	КОНЕЦ КАК СчетУчетаАванса,
	|	ВТ_РасчетыСКлиентамиРег.Подразделение,
	|	ВТ_РасчетыСКлиентамиРег.ГруппаФинансовогоУчета,
	|	ВТ_РасчетыСКлиентамиРег.ДолгРеглПриход,
	|	ВТ_РасчетыСКлиентамиРег.ДолгРеглРасход,
	|	ВТ_РасчетыСКлиентамиРег.ПредоплатаРеглПриход,
	|	ВТ_РасчетыСКлиентамиРег.ПредоплатаРеглРасход,
	|	ВТ_РасчетыСКлиентамиРег.Регистратор
	|ПОМЕСТИТЬ ВТ_РасчетыСКлиентами
	|ИЗ
	|	ВТ_РасчетыСКлиентамиРег КАК ВТ_РасчетыСКлиентамиРег
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияРасчетовСПартнерами КАК ПорядокОтраженияРасчетовСПартнерами
	|		ПО ВТ_РасчетыСКлиентамиРег.Организация = ПорядокОтраженияРасчетовСПартнерами.Организация
	|			И ВТ_РасчетыСКлиентамиРег.ГруппаФинансовогоУчета = ПорядокОтраженияРасчетовСПартнерами.ГруппаФинансовогоУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыФинансовогоУчетаРасчетов КАК ГруппыФинансовогоУчетаРасчетов
	|		ПО (ГруппыФинансовогоУчетаРасчетов.Ссылка = ВТ_РасчетыСКлиентамиРег.ГруппаФинансовогоУчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасчетыПоКредитамДепозитамРег.Организация,
	|	ВТ_РасчетыПоКредитамДепозитамРег.Контрагент,
	|	ВЫБОР
	|		КОГДА ВТ_РасчетыПоКредитамДепозитамРег.СчетУчета = НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ПорядокОтраженияРасчетовСПартнерами.СчетУчетаРасчетовСКлиентами, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|						ТОГДА ГруппыФинансовогоУчетаРасчетов.СчетУчетаРасчетовСКлиентами
	|					ИНАЧЕ ЕСТЬNULL(ПорядокОтраженияРасчетовСПартнерами.СчетУчетаРасчетовСКлиентами, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_РасчетыПоКредитамДепозитамРег.СчетУчета
	|	КОНЕЦ КАК Счет,
	|	ВТ_РасчетыПоКредитамДепозитамРег.Подразделение,
	|	ВТ_РасчетыПоКредитамДепозитамРег.ГруппаФинансовогоУчета,
	|	ВТ_РасчетыПоКредитамДепозитамРег.СуммаРеглПриход,
	|	ВТ_РасчетыПоКредитамДепозитамРег.СуммаРеглРасход,
	|	ВТ_РасчетыПоКредитамДепозитамРег.Регистратор
	|ПОМЕСТИТЬ ВТ_РасчетыПоКредитамДепозитам
	|ИЗ
	|	ВТ_РасчетыПоКредитамДепозитамРег КАК ВТ_РасчетыПоКредитамДепозитамРег
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияРасчетовСПартнерами КАК ПорядокОтраженияРасчетовСПартнерами
	|		ПО ВТ_РасчетыПоКредитамДепозитамРег.Организация = ПорядокОтраженияРасчетовСПартнерами.Организация
	|			И ВТ_РасчетыПоКредитамДепозитамРег.ГруппаФинансовогоУчета = ПорядокОтраженияРасчетовСПартнерами.ГруппаФинансовогоУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыФинансовогоУчетаРасчетов КАК ГруппыФинансовогоУчетаРасчетов
	|		ПО (ГруппыФинансовогоУчетаРасчетов.Ссылка = ВТ_РасчетыПоКредитамДепозитамРег.ГруппаФинансовогоУчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	3 КАК РазделУчета,
	|	ХозрасчетныйОбороты.Организация,
	|	ХозрасчетныйОбороты.Подразделение,
	|	ХозрасчетныйОбороты.Счет,
	|	ХозрасчетныйОбороты.Субконто1,
	|	ХозрасчетныйОбороты.Регистратор,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаОборотКт
	|ПОМЕСТИТЬ ВТ_РасчетыСКонтрагентамиРегл
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками)), , Организация В (&МассивОрганизаций), , ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ХозрасчетныйОбороты.Организация,
	|	ХозрасчетныйОбороты.Подразделение,
	|	ХозрасчетныйОбороты.Счет,
	|	ХозрасчетныйОбороты.Субконто1,
	|	ХозрасчетныйОбороты.Регистратор,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками)), , Организация В (&МассивОрганизаций), , ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ХозрасчетныйОбороты.Организация,
	|	ХозрасчетныйОбороты.Подразделение,
	|	ХозрасчетныйОбороты.Счет,
	|	ХозрасчетныйОбороты.Субконто1,
	|	ХозрасчетныйОбороты.Регистратор,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (&СчетаУчетаРасчетов5), , Организация В (&МассивОрганизаций), , ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОбороты.Субконто2) = ТИП(Справочник.ДоговорыКредитовИДепозитов)
	|			ТОГДА 5
	|		ИНАЧЕ 6
	|	КОНЕЦ,
	|	ХозрасчетныйОбороты.Организация,
	|	ХозрасчетныйОбороты.Подразделение,
	|	ХозрасчетныйОбороты.Счет,
	|	ХозрасчетныйОбороты.Субконто1,
	|	ХозрасчетныйОбороты.Регистратор,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСДругимиДебиторами)), , Организация В (&МассивОрганизаций), , ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	ХозрасчетныйОбороты.Организация,
	|	ХозрасчетныйОбороты.Подразделение,
	|	ХозрасчетныйОбороты.Счет,
	|	ХозрасчетныйОбороты.Субконто1,
	|	ХозрасчетныйОбороты.Регистратор,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (&СчетаУчетаРасчетов6), , Организация В (&МассивОрганизаций), , ) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтражениеДокументовВРеглУчете.Регистратор КАК Регистратор,
	|	ОтражениеДокументовВРеглУчете.Организация КАК Организация,
	|	МИНИМУМ(ОтражениеДокументовВРеглУчете.Статус) КАК Статус
	|ПОМЕСТИТЬ ВТ_СтатусыОтражения
	|ИЗ
	|	РегистрСведений.ОтражениеДокументовВРеглУчете КАК ОтражениеДокументовВРеглУчете
	|ГДЕ
	|	ОтражениеДокументовВРеглУчете.Регистратор В
	|			(ВЫБРАТЬ
	|				Т.Регистратор
	|			ИЗ
	|				ВТ_РасчетыСПоставщиками КАК Т
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				Т.Регистратор
	|			ИЗ
	|				ВТ_РасчетыСКлиентами КАК Т
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				Т.Регистратор
	|			ИЗ
	|				ВТ_РасчетыПоКредитамДепозитам КАК Т
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				Т.Регистратор
	|			ИЗ
	|				ВТ_РасчетыСКонтрагентамиРегл КАК Т)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтражениеДокументовВРеглУчете.Организация,
	|	ОтражениеДокументовВРеглУчете.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Подзапрос.РазделУчета КАК РазделУчета,
	|	Подзапрос.Организация,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетУчета КАК СчетБУ,
	|	Подзапрос.Аналитика1,
	|	СУММА(Подзапрос.Приход) КАК Приход,
	|	СУММА(Подзапрос.Расход) КАК Расход,
	|	СУММА(Подзапрос.ОборотДт) КАК ОборотДт,
	|	СУММА(Подзапрос.ОборотКт) КАК ОборотКт,
	|	Подзапрос.Регистратор,
	|	СтатусыОтражения.Статус
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ВТ_РасчетыСПоставщиками.СчетУчетаРасчетов В ИЕРАРХИИ (&СчетаУчетаРасчетов6)
	|				ТОГДА 6
	|			ИНАЧЕ 3
	|		КОНЕЦ КАК РазделУчета,
	|		ВТ_РасчетыСПоставщиками.Организация КАК Организация,
	|		ВТ_РасчетыСПоставщиками.Подразделение КАК Подразделение,
	|		ВТ_РасчетыСПоставщиками.СчетУчетаРасчетов КАК СчетУчета,
	|		ВТ_РасчетыСПоставщиками.Контрагент КАК Аналитика1,
	|		ВТ_РасчетыСПоставщиками.Регистратор КАК Регистратор,
	|		ВТ_РасчетыСПоставщиками.ДолгРеглПриход КАК Приход,
	|		ВТ_РасчетыСПоставщиками.ДолгРеглРасход КАК Расход,
	|		0 КАК ОборотДт,
	|		0 КАК ОборотКт
	|	ИЗ
	|		ВТ_РасчетыСПоставщиками КАК ВТ_РасчетыСПоставщиками
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ВТ_РасчетыСПоставщиками.СчетУчетаАванса В ИЕРАРХИИ (&СчетаУчетаРасчетов6)
	|				ТОГДА 6
	|			ИНАЧЕ 3
	|		КОНЕЦ,
	|		ВТ_РасчетыСПоставщиками.Организация,
	|		ВТ_РасчетыСПоставщиками.Подразделение,
	|		ВТ_РасчетыСПоставщиками.СчетУчетаАванса,
	|		ВТ_РасчетыСПоставщиками.Контрагент,
	|		ВТ_РасчетыСПоставщиками.Регистратор,
	|		ВТ_РасчетыСПоставщиками.ПредоплатаРеглПриход,
	|		ВТ_РасчетыСПоставщиками.ПредоплатаРеглРасход,
	|		0,
	|		0
	|	ИЗ
	|		ВТ_РасчетыСПоставщиками КАК ВТ_РасчетыСПоставщиками
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ВТ_РасчетыСКлиентами.СчетУчетаРасчетов В ИЕРАРХИИ (&СчетаУчетаРасчетов6)
	|				ТОГДА 6
	|			ИНАЧЕ 4
	|		КОНЕЦ,
	|		ВТ_РасчетыСКлиентами.Организация,
	|		ВТ_РасчетыСКлиентами.Подразделение,
	|		ВТ_РасчетыСКлиентами.СчетУчетаРасчетов,
	|		ВТ_РасчетыСКлиентами.Контрагент,
	|		ВТ_РасчетыСКлиентами.Регистратор,
	|		ВТ_РасчетыСКлиентами.ДолгРеглПриход,
	|		ВТ_РасчетыСКлиентами.ДолгРеглРасход,
	|		0,
	|		0
	|	ИЗ
	|		ВТ_РасчетыСКлиентами КАК ВТ_РасчетыСКлиентами
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ВТ_РасчетыСКлиентами.СчетУчетаАванса В ИЕРАРХИИ (&СчетаУчетаРасчетов6)
	|				ТОГДА 6
	|			ИНАЧЕ 4
	|		КОНЕЦ,
	|		ВТ_РасчетыСКлиентами.Организация,
	|		ВТ_РасчетыСКлиентами.Подразделение,
	|		ВТ_РасчетыСКлиентами.СчетУчетаАванса,
	|		ВТ_РасчетыСКлиентами.Контрагент,
	|		ВТ_РасчетыСКлиентами.Регистратор,
	|		ВТ_РасчетыСКлиентами.ПредоплатаРеглПриход,
	|		ВТ_РасчетыСКлиентами.ПредоплатаРеглРасход,
	|		0,
	|		0
	|	ИЗ
	|		ВТ_РасчетыСКлиентами КАК ВТ_РасчетыСКлиентами
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		5,
	|		РасчетыПоКредитамДепозитам.Организация,
	|		РасчетыПоКредитамДепозитам.Подразделение,
	|		РасчетыПоКредитамДепозитам.Счет,
	|		РасчетыПоКредитамДепозитам.Контрагент,
	|		РасчетыПоКредитамДепозитам.Регистратор,
	|		РасчетыПоКредитамДепозитам.СуммаРеглПриход,
	|		РасчетыПоКредитамДепозитам.СуммаРеглРасход,
	|		0,
	|		0
	|	ИЗ
	|		ВТ_РасчетыПоКредитамДепозитам КАК РасчетыПоКредитамДепозитам
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_РасчетыСКонтрагентамиРегл.РазделУчета,
	|		ВТ_РасчетыСКонтрагентамиРегл.Организация,
	|		ВТ_РасчетыСКонтрагентамиРегл.Подразделение,
	|		ВТ_РасчетыСКонтрагентамиРегл.Счет,
	|		ВТ_РасчетыСКонтрагентамиРегл.Субконто1,
	|		ВТ_РасчетыСКонтрагентамиРегл.Регистратор,
	|		0,
	|		0,
	|		ВТ_РасчетыСКонтрагентамиРегл.СуммаОборотДт,
	|		ВТ_РасчетыСКонтрагентамиРегл.СуммаОборотКт
	|	ИЗ
	|		ВТ_РасчетыСКонтрагентамиРегл КАК ВТ_РасчетыСКонтрагентамиРегл) КАК Подзапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусыОтражения КАК СтатусыОтражения
	|		ПО Подзапрос.Организация = СтатусыОтражения.Организация
	|			И Подзапрос.Регистратор = СтатусыОтражения.Регистратор
	|
	|ГДЕ
	|	Подзапрос.РазделУчета = &РазделУчета ИЛИ &РазделУчета = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Подзапрос.РазделУчета,
	|	Подзапрос.Организация,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетУчета,
	|	Подзапрос.Аналитика1,
	|	Подзапрос.Регистратор,
	|	СтатусыОтражения.Статус
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Подзапрос.Приход) <> 0
	|		ИЛИ СУММА(Подзапрос.Расход) <> 0
	|		ИЛИ СУММА(Подзапрос.ОборотДт) <> 0
	|		ИЛИ СУММА(Подзапрос.ОборотКт) <> 0)";
	
	
КонецФункции

Функция ТекстЗапросаПроизводственныеЗатраты()
	
	Возврат
	"ВЫБРАТЬ
	|	СебестоимостьТоваровОстаткиИОбороты.Организация КАК Организация,
	|	КлючиАналитикиУчетаНоменклатуры.Склад КАК Подразделение,
	|	СУММА(СебестоимостьТоваровОстаткиИОбороты.СтоимостьРеглНачальныйОстаток) КАК НачальныйОстаток,
	|	СУММА(СебестоимостьТоваровОстаткиИОбороты.СтоимостьРеглПриход) КАК Приход,
	|	СУММА(СебестоимостьТоваровОстаткиИОбороты.СтоимостьРеглРасход) КАК Расход,
	|	СУММА(СебестоимостьТоваровОстаткиИОбороты.СтоимостьРеглКонечныйОстаток) КАК КонечныйОстаток
	|ПОМЕСТИТЬ ВТ_СебестоимостьТоваровПроизводственныеЗатраты
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Движения,
	|			РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|				И Организация В (&МассивОрганизаций)) КАК СебестоимостьТоваровОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|		ПО СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваровОстаткиИОбороты.Организация,
	|	КлючиАналитикиУчетаНоменклатуры.Склад
    |
	|ОБЪЕДИНИТЬ ВСЕ
    |
	|ВЫБРАТЬ
	|	КорректировкаСебестоимости.Организация,
	|	КлючиАналитикиУчетаНоменклатуры.Склад КАК Подразделение,
	|	0 КАК НачальныйОстаток,
	|	СУММА(КорректировкаСебестоимости.ПриходКорректировка) КАК Приход,
	|	СУММА(КорректировкаСебестоимости.РасходКорректировка) КАК Расход,
	|	0 КАК КонечныйОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		СебестоимостьТоваров.Организация КАК Организация,
	|		СебестоимостьТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		0 КАК ПриходКорректировка,
    |       0 КАК РасходКорректировка
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|	ГДЕ
	|		СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И СебестоимостьТоваров.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И СебестоимостьТоваров.Активность
    |       И СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		И СебестоимостьТоваров.Организация В (&МассивОрганизаций)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СебестоимостьТоваров.Организация,
	|		СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
	|		ВЫБОР 
    |           КОГДА (СебестоимостьТоваров.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаНалоговыхНазначений)
	|		        И ((СебестоимостьТоваров.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Облагаемая) 
	|	   		        И СебестоимостьТоваров.КорНалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Необлагаемая))
	|		          ИЛИ (СебестоимостьТоваров.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.ПропорциональноОблагаемая) 
	|	   		        И СебестоимостьТоваров.КорНалоговоеНазначение = ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность))
    |               )
    |            )
	|			    ТОГДА СебестоимостьТоваров.НДСРегл
    |           КОГДА СебестоимостьТоваров.Регистратор ССЫЛКА Документ.ВыпускПродукции
	|		          И СебестоимостьТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию) 
	|			    ТОГДА -СебестоимостьТоваров.СтоимостьРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПриходКорректировка,
	|		ВЫБОР 
    |           КОГДА (СебестоимостьТоваров.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаНалоговыхНазначений)
	|		        И ((СебестоимостьТоваров.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Облагаемая) 
	|	   		        И СебестоимостьТоваров.КорНалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Необлагаемая))
	|		          ИЛИ (СебестоимостьТоваров.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.ПропорциональноОблагаемая) 
	|	   		        И СебестоимостьТоваров.КорНалоговоеНазначение = ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность))
    |               )
    |            )
	|			    ТОГДА СебестоимостьТоваров.НДСРегл
    |           КОГДА СебестоимостьТоваров.Регистратор ССЫЛКА Документ.ВыпускПродукции
	|		          И СебестоимостьТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию) 
	|			    ТОГДА -СебестоимостьТоваров.СтоимостьРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК РасходКорректировка
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|	ГДЕ
	|		СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И СебестоимостьТоваров.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И СебестоимостьТоваров.Активность
    |       И СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		И СебестоимостьТоваров.Организация В(&МассивОрганизаций)
	|	
    |   ) КАК КорректировкаСебестоимости
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|		ПО КорректировкаСебестоимости.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
    |
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаСебестоимости.Организация,
	|	КлючиАналитикиУчетаНоменклатуры.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СебестоимостьТоваровОстаткиИОбороты.Организация КАК Организация,
	|	КлючиАналитикиУчетаНоменклатуры.Склад КАК Подразделение,
	|	СУММА(СебестоимостьТоваровОстаткиИОбороты.СтоимостьРеглНачальныйОстаток) КАК НачальныйОстаток,
	|	СУММА(СебестоимостьТоваровОстаткиИОбороты.СтоимостьРеглПриход) КАК Приход,
	|	СУММА(СебестоимостьТоваровОстаткиИОбороты.СтоимостьРеглРасход) КАК Расход,
	|	СУММА(СебестоимостьТоваровОстаткиИОбороты.СтоимостьРеглКонечныйОстаток) КАК КонечныйОстаток
	|ПОМЕСТИТЬ ВТ_СебестоимостьТоваровРаботы
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Движения,
	|			РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|				И Организация В (&МассивОрганизаций)) КАК СебестоимостьТоваровОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|				ПО СправочникНоменклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
	|					И (ВидыНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|			ПО КлючиАналитикиУчетаНоменклатуры.Номенклатура = СправочникНоменклатура.Ссылка
	|		ПО СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваровОстаткиИОбороты.Организация,
	|	КлючиАналитикиУчетаНоменклатуры.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Подзапрос.РазделУчета,
	|	Подзапрос.Организация,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетБУ,
	|	СУММА(Подзапрос.НачальныйОстаток) КАК НачальныйОстаток,
	|	СУММА(Подзапрос.Приход) КАК Приход,
	|	СУММА(Подзапрос.Расход) КАК Расход,
	|	СУММА(Подзапрос.КонечныйОстаток) КАК КонечныйОстаток,
	|	СУММА(Подзапрос.НачальныеСальдо) КАК НачальноеСальдо,
	|	СУММА(Подзапрос.ОборотДт) КАК ОборотДт,
	|	СУММА(Подзапрос.ОборотКт) КАК ОборотКт,
	|	СУММА(Подзапрос.КонечноеСальдо) КАК КонечноеСальдо
	|ИЗ
	|	(ВЫБРАТЬ
	|		7 КАК РазделУчета,
	|		ПрочиеРасходыОстаткиИОбороты.Организация КАК Организация,
	|		ПрочиеРасходыОстаткиИОбороты.Подразделение КАК Подразделение,
	|		ЕСТЬNULL(ЕСТЬNULL(НастройкиОтражения1.СчетУчета, ПрочиеРасходыОстаткиИОбороты.СтатьяРасходов.СчетУчета), НастройкиОтражения2.СчетУчета) КАК СчетБУ,
	|		СУММА(ПрочиеРасходыОстаткиИОбороты.СуммаРеглНачальныйОстаток) КАК НачальныйОстаток,
	|		СУММА(ПрочиеРасходыОстаткиИОбороты.СуммаРеглПриход) КАК Приход,
	|		СУММА(ПрочиеРасходыОстаткиИОбороты.СуммаРеглРасход) КАК Расход,
	|		СУММА(ПрочиеРасходыОстаткиИОбороты.СуммаРеглКонечныйОстаток) КАК КонечныйОстаток,
	|		0 КАК НачальныеСальдо,
	|		0 КАК ОборотДт,
	|		0 КАК ОборотКт,
	|		0 КАК КонечноеСальдо
	|	ИЗ
    |		РегистрНакопления.ПрочиеРасходы.ОстаткиИОбороты(
    |           &НачалоПериода, 
    |           &КонецПериода, 
    |           , 
    |           Движения, 
    |           Организация В (&МассивОрганизаций) И НЕ СтатьяРасходов.СебестоимостьРеализации
    |       ) КАК ПрочиеРасходыОстаткиИОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияРасходов КАК НастройкиОтражения1
	|			ПО (НастройкиОтражения1.Организация = ПрочиеРасходыОстаткиИОбороты.Организация)
	|				И (НастройкиОтражения1.Подразделение = ПрочиеРасходыОстаткиИОбороты.Подразделение)
	|				И (НастройкиОтражения1.СтатьяРасходов = ПрочиеРасходыОстаткиИОбороты.СтатьяРасходов)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияРасходов КАК НастройкиОтражения2
	|			ПО (НастройкиОтражения2.Организация = ПрочиеРасходыОстаткиИОбороты.Организация)
	|				И (НастройкиОтражения2.Подразделение = ПрочиеРасходыОстаткиИОбороты.Подразделение)
	|				И (НастройкиОтражения2.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПрочиеРасходыОстаткиИОбороты.Организация,
	|		ПрочиеРасходыОстаткиИОбороты.Подразделение,
	|		ПрочиеРасходыОстаткиИОбороты.СтатьяРасходов,
	|		НастройкиОтражения1.СчетУчета,
	|		НастройкиОтражения2.СчетУчета,
	|		ЕСТЬNULL(ЕСТЬNULL(НастройкиОтражения1.СчетУчета, ПрочиеРасходыОстаткиИОбороты.СтатьяРасходов.СчетУчета), НастройкиОтражения2.СчетУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		7,
	|		ПрочиеРасходыОстаткиИОбороты.Организация,
	|		ПрочиеРасходыОстаткиИОбороты.Подразделение,
	|		НастройкиОтражения.СчетУчета,
	|		СУММА(ПрочиеРасходыОстаткиИОбороты.СтоимостьРеглНачальныйОстаток),
	|		СУММА(ПрочиеРасходыОстаткиИОбороты.СтоимостьРеглПриход),
	|		СУММА(ПрочиеРасходыОстаткиИОбороты.СтоимостьРеглРасход),
	|		СУММА(ПрочиеРасходыОстаткиИОбороты.СтоимостьРеглКонечныйОстаток),
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , Движения, Организация В (&МассивОрганизаций)) КАК ПрочиеРасходыОстаткиИОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияРасходов КАК НастройкиОтражения
	|			ПО (НастройкиОтражения.Организация = ПрочиеРасходыОстаткиИОбороты.Организация)
	|				И (НастройкиОтражения.Подразделение = ПрочиеРасходыОстаткиИОбороты.Подразделение)
	|				И (НастройкиОтражения.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПрочиеРасходыОстаткиИОбороты.Организация,
	|		ПрочиеРасходыОстаткиИОбороты.Подразделение,
	|		НастройкиОтражения.СчетУчета
    |
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		7,
	|		ПрочиеРасходыНезавершенногоПроизводстваКорректировкаНДС.Организация,
	|		ПрочиеРасходыНезавершенногоПроизводстваКорректировкаНДС.Подразделение,
	|		НастройкиОтражения.СчетУчета,
	|		0,
	|		СУММА(ПрочиеРасходыНезавершенногоПроизводстваКорректировкаНДС.ПриходКорректировкаНДС),
	|		СУММА(ПрочиеРасходыНезавершенногоПроизводстваКорректировкаНДС.РасходКорректировкаНДС),
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
    |	    (ВЫБРАТЬ
    |		    ПрочиеРасходыНезавершенногоПроизводства.Организация КАК Организация,
    |		    ПрочиеРасходыНезавершенногоПроизводства.Подразделение КАК Подразделение,
    |		    0 КАК ПриходКорректировкаНДС,
    |           0 КАК РасходКорректировкаНДС
    |	    ИЗ
    |		    РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ПрочиеРасходыНезавершенногоПроизводства
    |	    ГДЕ
    |		    ПрочиеРасходыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
    |		    И ПрочиеРасходыНезавершенногоПроизводства.Период МЕЖДУ &НачалоПериода И &КонецПериода
    |		    И ПрочиеРасходыНезавершенногоПроизводства.Активность
    |		    И ПрочиеРасходыНезавершенногоПроизводства.Организация В (&МассивОрганизаций)
    |	
    |	    ОБЪЕДИНИТЬ ВСЕ
    |	
    |	    ВЫБРАТЬ
    |		    ПрочиеРасходыНезавершенногоПроизводства.Организация,
    |		    ПрочиеРасходыНезавершенногоПроизводства.Подразделение,
    |		    ВЫБОР 
    |               КОГДА (ПрочиеРасходыНезавершенногоПроизводства.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Облагаемая) 
    |	   		            И ПрочиеРасходыНезавершенногоПроизводства.НалоговоеНазначениеВыпуска.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Необлагаемая))
    |		            ИЛИ (ПрочиеРасходыНезавершенногоПроизводства.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.ПропорциональноОблагаемая) 
    |	   		            И ПрочиеРасходыНезавершенногоПроизводства.НалоговоеНазначениеВыпуска = ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность))
    |			    ТОГДА ПрочиеРасходыНезавершенногоПроизводства.НДСРегл
    |			    ИНАЧЕ 0
    |		    КОНЕЦ КАК ПриходКорректировкаНДС,
    |		    ВЫБОР 
    |               КОГДА (ПрочиеРасходыНезавершенногоПроизводства.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Облагаемая) 
    |	   		            И ПрочиеРасходыНезавершенногоПроизводства.НалоговоеНазначениеВыпуска.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Необлагаемая))
    |		            ИЛИ (ПрочиеРасходыНезавершенногоПроизводства.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.ПропорциональноОблагаемая) 
    |	   		            И ПрочиеРасходыНезавершенногоПроизводства.НалоговоеНазначениеВыпуска = ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность))
    |			    ТОГДА ПрочиеРасходыНезавершенногоПроизводства.НДСРегл
    |			    ИНАЧЕ 0
    |		    КОНЕЦ КАК РасходКорректировкаНДС
    |	    ИЗ
    |		    РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ПрочиеРасходыНезавершенногоПроизводства
    |	    ГДЕ
    |		    ПрочиеРасходыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
    |		    И ПрочиеРасходыНезавершенногоПроизводства.Период МЕЖДУ &НачалоПериода И &КонецПериода
    |		    И ПрочиеРасходыНезавершенногоПроизводства.Активность
    |		    И ПрочиеРасходыНезавершенногоПроизводства.Организация В (&МассивОрганизаций)
    |	
    |       ) КАК ПрочиеРасходыНезавершенногоПроизводстваКорректировкаНДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияРасходов КАК НастройкиОтражения
	|		    ПО (НастройкиОтражения.Организация = ПрочиеРасходыНезавершенногоПроизводстваКорректировкаНДС.Организация)
	|			    И (НастройкиОтражения.Подразделение = ПрочиеРасходыНезавершенногоПроизводстваКорректировкаНДС.Подразделение)
	|				И (НастройкиОтражения.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
    |           )
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПрочиеРасходыНезавершенногоПроизводстваКорректировкаНДС.Организация,
	|		ПрочиеРасходыНезавершенногоПроизводстваКорректировкаНДС.Подразделение,
	|		НастройкиОтражения.СчетУчета
    |
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		7,
	|		ТрудозатратыНезавершенногоПроизводстваОстаткиИОбороты.Организация,
	|		ТрудозатратыНезавершенногоПроизводстваОстаткиИОбороты.Подразделение,
	|		НастройкиОтражения.СчетУчета,
	|		СУММА(ТрудозатратыНезавершенногоПроизводстваОстаткиИОбороты.СтоимостьРеглНачальныйОстаток),
	|		СУММА(ТрудозатратыНезавершенногоПроизводстваОстаткиИОбороты.СтоимостьРеглПриход),
	|		СУММА(ТрудозатратыНезавершенногоПроизводстваОстаткиИОбороты.СтоимостьРеглРасход),
	|		СУММА(ТрудозатратыНезавершенногоПроизводстваОстаткиИОбороты.СтоимостьРеглКонечныйОстаток),
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , Движения, Организация В (&МассивОрганизаций)) КАК ТрудозатратыНезавершенногоПроизводстваОстаткиИОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияРасходов КАК НастройкиОтражения
	|			ПО (НастройкиОтражения.Организация = ТрудозатратыНезавершенногоПроизводстваОстаткиИОбороты.Организация)
	|				И (НастройкиОтражения.Подразделение = ТрудозатратыНезавершенногоПроизводстваОстаткиИОбороты.Подразделение)
	|				И (НастройкиОтражения.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТрудозатратыНезавершенногоПроизводстваОстаткиИОбороты.Организация,
	|		ТрудозатратыНезавершенногоПроизводстваОстаткиИОбороты.Подразделение,
	|		НастройкиОтражения.СчетУчета
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		7,
	|		ВТ_СебестоимостьТоваровПроизводственныеЗатраты.Организация,
	|		ВТ_СебестоимостьТоваровПроизводственныеЗатраты.Подразделение,
	|		ПорядокОтраженияРасходов.СчетУчета,
	|		ВТ_СебестоимостьТоваровПроизводственныеЗатраты.НачальныйОстаток,
	|		ВТ_СебестоимостьТоваровПроизводственныеЗатраты.Приход,
	|		ВТ_СебестоимостьТоваровПроизводственныеЗатраты.Расход,
	|		ВТ_СебестоимостьТоваровПроизводственныеЗатраты.КонечныйОстаток,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТ_СебестоимостьТоваровПроизводственныеЗатраты КАК ВТ_СебестоимостьТоваровПроизводственныеЗатраты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияРасходов КАК ПорядокОтраженияРасходов
	|			ПО ВТ_СебестоимостьТоваровПроизводственныеЗатраты.Подразделение = ПорядокОтраженияРасходов.Подразделение
	|				И ВТ_СебестоимостьТоваровПроизводственныеЗатраты.Организация = ПорядокОтраженияРасходов.Организация
	|				И (ПорядокОтраженияРасходов.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		7,
	|		СебестоимостьТоваровОстаткиИОбороты.Организация,
	|		СебестоимостьТоваровОстаткиИОбороты.Подразделение,
	|		ПорядокОтраженияРасходов.СчетУчета,
	|		СебестоимостьТоваровОстаткиИОбороты.НачальныйОстаток,
	|		СебестоимостьТоваровОстаткиИОбороты.Приход,
	|		СебестоимостьТоваровОстаткиИОбороты.Расход,
	|		СебестоимостьТоваровОстаткиИОбороты.КонечныйОстаток,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТ_СебестоимостьТоваровРаботы КАК СебестоимостьТоваровОстаткиИОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияРасходов КАК ПорядокОтраженияРасходов
	|			ПО СебестоимостьТоваровОстаткиИОбороты.Подразделение = ПорядокОтраженияРасходов.Подразделение
	|				И СебестоимостьТоваровОстаткиИОбороты.Организация = ПорядокОтраженияРасходов.Организация
	|				И (ПорядокОтраженияРасходов.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		7,
	|		ХозрасчетныйОстаткиИОбороты.Организация,
	|		ХозрасчетныйОстаткиИОбороты.Подразделение,
	|		ХозрасчетныйОстаткиИОбороты.Счет,
	|		0,
	|		0,
	|		0,
	|		0,
	|		СУММА(ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток),
	|		СУММА(ХозрасчетныйОстаткиИОбороты.СуммаОборотДт),
    |		СУММА(ХозрасчетныйОстаткиИОбороты.СуммаОборотКт),
	|		СУММА(ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток)
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , Движения, 
	|						Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство), 
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), 
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АдминистративныеРасходы),
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), 
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаСбыт),
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗатратыБудущихПериодов),
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельностиГруппа),
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФинансовыеЗатраты),
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПотериОтУчастияВКапитале),
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеЗатратыДеятельности)
    |						) И Счет НЕ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованныхПроизводственныхЗапасов))
    |						,,Организация В (&МассивОрганизаций)
    |       ) КАК ХозрасчетныйОстаткиИОбороты
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ХозрасчетныйОстаткиИОбороты.Подразделение,
	|		ХозрасчетныйОстаткиИОбороты.Счет,
	|		ХозрасчетныйОстаткиИОбороты.Организация) КАК Подзапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	Подзапрос.РазделУчета,
	|	Подзапрос.Организация,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетБУ";
    
КонецФункции

Функция ТекстЗапросаПроизводственныеЗатратыПоРегистраторам()
	
	Возврат
	"ВЫБРАТЬ
	|	7 КАК РазделУчета,
	|	Подзапрос.Организация,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетБУ,
	|	СУММА(Подзапрос.Приход) КАК Приход,
	|	СУММА(Подзапрос.Расход) КАК Расход,
	|	СУММА(Подзапрос.ОборотДт) КАК ОборотДт,
	|	СУММА(Подзапрос.ОборотКт) КАК ОборотКт,
	|	Подзапрос.Регистратор,
	|	ОтражениеДокументовВРеглУчете.Статус
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПрочиеРасходы.Организация КАК Организация,
	|		ПрочиеРасходы.Подразделение КАК Подразделение,
	|		ЕСТЬNULL(ЕСТЬNULL(НастройкиОтражения1.СчетУчета, ПрочиеРасходы.СтатьяРасходов.СчетУчета), НастройкиОтражения2.СчетУчета) КАК СчетБУ,
	|		СУММА(ВЫБОР
	|				КОГДА ПрочиеРасходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА ПрочиеРасходы.СуммаРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Приход,
	|		СУММА(ВЫБОР
	|				КОГДА ПрочиеРасходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					ТОГДА ПрочиеРасходы.СуммаРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Расход,
	|		0 КАК ОборотДт,
	|		0 КАК ОборотКт,
	|		ВЫБОР
	|			КОГДА ПрочиеРасходы.ДокументДвижения = ЗНАЧЕНИЕ(Документ.РаспределениеПрочихЗатрат.ПустаяСсылка)
	|				ТОГДА ПрочиеРасходы.Регистратор
	|			ИНАЧЕ ПрочиеРасходы.ДокументДвижения
	|		КОНЕЦ КАК Регистратор
	|	ИЗ
	|		РегистрНакопления.ПрочиеРасходы КАК ПрочиеРасходы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияРасходов КАК НастройкиОтражения1
	|			ПО (НастройкиОтражения1.Организация = ПрочиеРасходы.Организация)
	|				И (НастройкиОтражения1.Подразделение = ПрочиеРасходы.Подразделение)
	|				И (НастройкиОтражения1.СтатьяРасходов = ПрочиеРасходы.СтатьяРасходов)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияРасходов КАК НастройкиОтражения2
	|			ПО (НастройкиОтражения2.Организация = ПрочиеРасходы.Организация)
	|				И (НастройкиОтражения2.Подразделение = ПрочиеРасходы.Подразделение)
	|				И (НастройкиОтражения2.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|	ГДЕ
	|		ПрочиеРасходы.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ПрочиеРасходы.Организация В(&МассивОрганизаций)
    |       И НЕ ПрочиеРасходы.СтатьяРасходов.СебестоимостьРеализации
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЕСТЬNULL(ЕСТЬNULL(НастройкиОтражения1.СчетУчета, ПрочиеРасходы.СтатьяРасходов.СчетУчета), НастройкиОтражения2.СчетУчета),
	|		ПрочиеРасходы.Организация,
	|		ПрочиеРасходы.Подразделение,
	|		ПрочиеРасходы.ДокументДвижения,
	|		ПрочиеРасходы.Регистратор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПрочиеРасходыНезавершенногоПроизводства.Организация,
	|		ПрочиеРасходыНезавершенногоПроизводства.Подразделение,
	|		НастройкиОтражения.СчетУчета,
	|		СУММА(ВЫБОР
	|				КОГДА ПрочиеРасходыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА ПрочиеРасходыНезавершенногоПроизводства.СтоимостьРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА ПрочиеРасходыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					ТОГДА ПрочиеРасходыНезавершенногоПроизводства.СтоимостьРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА ПрочиеРасходыНезавершенногоПроизводства.ДокументДвижения = НЕОПРЕДЕЛЕНО
	|				ТОГДА ПрочиеРасходыНезавершенногоПроизводства.Регистратор
	|			ИНАЧЕ ПрочиеРасходыНезавершенногоПроизводства.ДокументДвижения
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ПрочиеРасходыНезавершенногоПроизводства
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияРасходов КАК НастройкиОтражения
	|			ПО (НастройкиОтражения.Организация = ПрочиеРасходыНезавершенногоПроизводства.Организация)
	|				И (НастройкиОтражения.Подразделение = ПрочиеРасходыНезавершенногоПроизводства.Подразделение)
	|				И (НастройкиОтражения.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|	ГДЕ
	|		ПрочиеРасходыНезавершенногоПроизводства.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ПрочиеРасходыНезавершенногоПроизводства.Организация В(&МассивОрганизаций)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПрочиеРасходыНезавершенногоПроизводства.Организация,
	|		ПрочиеРасходыНезавершенногоПроизводства.Подразделение,
	|		ПрочиеРасходыНезавершенногоПроизводства.Регистратор,
	|		ПрочиеРасходыНезавершенногоПроизводства.ДокументДвижения,
	|		НастройкиОтражения.СчетУчета
    |
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПрочиеРасходыНезавершенногоПроизводства.Организация,
	|		ПрочиеРасходыНезавершенногоПроизводства.Подразделение,
	|		НастройкиОтражения.СчетУчета,
    
    |		СУММА(ВЫБОР 
    |               КОГДА (ПрочиеРасходыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
    |		            И ((ПрочиеРасходыНезавершенногоПроизводства.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Облагаемая) 
    |	   		            И ПрочиеРасходыНезавершенногоПроизводства.НалоговоеНазначениеВыпуска.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Необлагаемая))
    |		            ИЛИ (ПрочиеРасходыНезавершенногоПроизводства.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.ПропорциональноОблагаемая) 
    |	   		            И ПрочиеРасходыНезавершенногоПроизводства.НалоговоеНазначениеВыпуска = ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность))
    |                   )
    |               )
    |			        ТОГДА ПрочиеРасходыНезавершенногоПроизводства.НДСРегл
    |			    ИНАЧЕ 0
    |       КОНЕЦ) КАК ПриходКорректировкаНДС,
    |		СУММА(ВЫБОР 
    |               КОГДА (ПрочиеРасходыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
    |		            И ((ПрочиеРасходыНезавершенногоПроизводства.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Облагаемая) 
    |	   		            И ПрочиеРасходыНезавершенногоПроизводства.НалоговоеНазначениеВыпуска.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Необлагаемая))
    |		            ИЛИ (ПрочиеРасходыНезавершенногоПроизводства.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.ПропорциональноОблагаемая) 
    |	   		            И ПрочиеРасходыНезавершенногоПроизводства.НалоговоеНазначениеВыпуска = ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность))
    |                   )
    |               )
    |			    ТОГДА ПрочиеРасходыНезавершенногоПроизводства.НДСРегл
    |			    ИНАЧЕ 0
    |       КОНЕЦ) КАК РасходПриходКорректировкаНДС,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА ПрочиеРасходыНезавершенногоПроизводства.ДокументДвижения = НЕОПРЕДЕЛЕНО
	|				ТОГДА ПрочиеРасходыНезавершенногоПроизводства.Регистратор
	|			ИНАЧЕ ПрочиеРасходыНезавершенногоПроизводства.ДокументДвижения
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ПрочиеРасходыНезавершенногоПроизводства
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияРасходов КАК НастройкиОтражения
	|			ПО (НастройкиОтражения.Организация = ПрочиеРасходыНезавершенногоПроизводства.Организация)
	|				И (НастройкиОтражения.Подразделение = ПрочиеРасходыНезавершенногоПроизводства.Подразделение)
	|				И (НастройкиОтражения.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|	ГДЕ
	|		ПрочиеРасходыНезавершенногоПроизводства.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ПрочиеРасходыНезавершенногоПроизводства.Организация В(&МассивОрганизаций)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПрочиеРасходыНезавершенногоПроизводства.Организация,
	|		ПрочиеРасходыНезавершенногоПроизводства.Подразделение,
	|		ПрочиеРасходыНезавершенногоПроизводства.Регистратор,
	|		ПрочиеРасходыНезавершенногоПроизводства.ДокументДвижения,
	|		НастройкиОтражения.СчетУчета
    |
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТрудозатратыНезавершенногоПроизводстваОстаткиИОбороты.Организация,
	|		ТрудозатратыНезавершенногоПроизводстваОстаткиИОбороты.Подразделение,
	|		НастройкиОтражения.СчетУчета,
	|		СУММА(ТрудозатратыНезавершенногоПроизводстваОстаткиИОбороты.СтоимостьРеглПриход),
	|		СУММА(ТрудозатратыНезавершенногоПроизводстваОстаткиИОбороты.СтоимостьРеглРасход),
	|		0,
	|		0,
	|		ТрудозатратыНезавершенногоПроизводстваОстаткиИОбороты.Регистратор
	|	ИЗ
	|		РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, Движения, Организация В (&МассивОрганизаций)) КАК ТрудозатратыНезавершенногоПроизводстваОстаткиИОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияРасходов КАК НастройкиОтражения
	|			ПО (НастройкиОтражения.Организация = ТрудозатратыНезавершенногоПроизводстваОстаткиИОбороты.Организация)
	|				И (НастройкиОтражения.Подразделение = ТрудозатратыНезавершенногоПроизводстваОстаткиИОбороты.Подразделение)
	|				И (НастройкиОтражения.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТрудозатратыНезавершенногоПроизводстваОстаткиИОбороты.Организация,
	|		ТрудозатратыНезавершенногоПроизводстваОстаткиИОбороты.Подразделение,
	|		НастройкиОтражения.СчетУчета,
	|		ТрудозатратыНезавершенногоПроизводстваОстаткиИОбороты.Регистратор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СебестоимостьТоваров.Организация,
	|		КлючиАналитикиУчетаНоменклатуры.Склад,
	|		ПорядокОтраженияРасходов.СчетУчета,
	|		СУММА(ВЫБОР
	|				КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА СебестоимостьТоваров.СтоимостьРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					ТОГДА СебестоимостьТоваров.СтоимостьРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА СебестоимостьТоваров.ДокументДвижения = НЕОПРЕДЕЛЕНО
	|				ТОГДА СебестоимостьТоваров.Регистратор
	|			ИНАЧЕ СебестоимостьТоваров.ДокументДвижения
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|			ПО СебестоимостьТоваров.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияРасходов КАК ПорядокОтраженияРасходов
	|			ПО (КлючиАналитикиУчетаНоменклатуры.Склад = ПорядокОтраженияРасходов.Подразделение)
	|				И СебестоимостьТоваров.Организация = ПорядокОтраженияРасходов.Организация
	|				И (ПорядокОтраженияРасходов.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|	ГДЕ
	|		СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		И СебестоимостьТоваров.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И СебестоимостьТоваров.Организация В(&МассивОрганизаций)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СебестоимостьТоваров.Организация,
	|		СебестоимостьТоваров.Регистратор,
	|		СебестоимостьТоваров.ДокументДвижения,
	|		КлючиАналитикиУчетаНоменклатуры.Склад,
	|		ПорядокОтраженияРасходов.СчетУчета
	|	
    |
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СебестоимостьТоваров.Организация,
	|		КлючиАналитикиУчетаНоменклатуры.Склад,
	|		ПорядокОтраженияРасходов.СчетУчета,
    |
	|		СУММА(ВЫБОР 
    |           КОГДА (СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		        И ((СебестоимостьТоваров.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Облагаемая) 
	|	   		        И СебестоимостьТоваров.КорНалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Необлагаемая))
	|		          ИЛИ (СебестоимостьТоваров.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.ПропорциональноОблагаемая) 
	|	   		        И СебестоимостьТоваров.КорНалоговоеНазначение = ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность))
    |               )
    |            )
	|			    ТОГДА СебестоимостьТоваров.НДСРегл
    |           КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
    |                 И СебестоимостьТоваров.Регистратор ССЫЛКА Документ.ВыпускПродукции
	|		          И СебестоимостьТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию) 
	|			    ТОГДА -СебестоимостьТоваров.СтоимостьРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПриходКорректировка,
	|		СУММА(ВЫБОР 
    |           КОГДА (СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		        И ((СебестоимостьТоваров.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Облагаемая) 
	|	   		        И СебестоимостьТоваров.КорНалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Необлагаемая))
	|		          ИЛИ (СебестоимостьТоваров.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.ПропорциональноОблагаемая) 
	|	   		        И СебестоимостьТоваров.КорНалоговоеНазначение = ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность))
    |               )
    |            )
	|			    ТОГДА СебестоимостьТоваров.НДСРегл
    |           КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
    |                 И СебестоимостьТоваров.Регистратор ССЫЛКА Документ.ВыпускПродукции
	|		          И СебестоимостьТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию) 
	|			    ТОГДА -СебестоимостьТоваров.СтоимостьРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РасходКорректировка,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА СебестоимостьТоваров.ДокументДвижения = НЕОПРЕДЕЛЕНО
	|				ТОГДА СебестоимостьТоваров.Регистратор
	|			ИНАЧЕ СебестоимостьТоваров.ДокументДвижения
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|			ПО СебестоимостьТоваров.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияРасходов КАК ПорядокОтраженияРасходов
	|			ПО (КлючиАналитикиУчетаНоменклатуры.Склад = ПорядокОтраженияРасходов.Подразделение)
	|				И СебестоимостьТоваров.Организация = ПорядокОтраженияРасходов.Организация
	|				И (ПорядокОтраженияРасходов.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|	ГДЕ
	|		СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		И СебестоимостьТоваров.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И СебестоимостьТоваров.Организация В (&МассивОрганизаций)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СебестоимостьТоваров.Организация,
	|		СебестоимостьТоваров.Регистратор,
	|		СебестоимостьТоваров.ДокументДвижения,
	|		КлючиАналитикиУчетаНоменклатуры.Склад,
	|		ПорядокОтраженияРасходов.СчетУчета
    |
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СебестоимостьТоваров.Организация,
	|		КлючиАналитикиУчетаНоменклатуры.Склад,
	|		ПорядокОтраженияРасходов.СчетУчета,
	|		СУММА(ВЫБОР
	|				КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА СебестоимостьТоваров.СтоимостьРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					ТОГДА СебестоимостьТоваров.СтоимостьРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА СебестоимостьТоваров.ДокументДвижения = НЕОПРЕДЕЛЕНО
	|				ТОГДА СебестоимостьТоваров.Регистратор
	|			ИНАЧЕ СебестоимостьТоваров.ДокументДвижения
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|					ПО СправочникНоменклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
	|						И (ВидыНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|				ПО КлючиАналитикиУчетаНоменклатуры.Номенклатура = СправочникНоменклатура.Ссылка
	|			ПО СебестоимостьТоваров.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияРасходов КАК ПорядокОтраженияРасходов
	|			ПО (КлючиАналитикиУчетаНоменклатуры.Склад = ПорядокОтраженияРасходов.Подразделение)
	|				И СебестоимостьТоваров.Организация = ПорядокОтраженияРасходов.Организация
	|				И (ПорядокОтраженияРасходов.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|	ГДЕ
	|		СебестоимостьТоваров.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		И СебестоимостьТоваров.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И СебестоимостьТоваров.Организация В(&МассивОрганизаций)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		КлючиАналитикиУчетаНоменклатуры.Склад,
	|		СебестоимостьТоваров.Организация,
	|		СебестоимостьТоваров.Регистратор,
	|		СебестоимостьТоваров.ДокументДвижения,
	|		ПорядокОтраженияРасходов.СчетУчета
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ХозрасчетныйОстаткиИОбороты.Организация,
	|		ХозрасчетныйОстаткиИОбороты.Подразделение,
	|		ХозрасчетныйОстаткиИОбороты.Счет,
	|		0,
	|		0,
	|		СУММА(ХозрасчетныйОстаткиИОбороты.СуммаОборотДт),
	|		СУММА(ХозрасчетныйОстаткиИОбороты.СуммаОборотКт),
	|		ХозрасчетныйОстаткиИОбороты.Регистратор
	|	ИЗ
    |		РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
    |           &НачалоПериода, 
    |           &КонецПериода, 
    |           Регистратор, 
    |           Движения, 
    |           Счет В ИЕРАРХИИ (
    |               ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство), 
    |               ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), 
    |               ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АдминистративныеРасходы), 
    |               ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), 
    |               ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаСбыт), 
    |               ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗатратыБудущихПериодов),  
    |               ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельностиГруппа),  
    |               ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФинансовыеЗатраты), 
    |               ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПотериОтУчастияВКапитале), 
    |               ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеЗатратыДеятельности)
    |           ) И Счет НЕ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованныхПроизводственныхЗапасов)),
    |           , 
    |           Организация В (&МассивОрганизаций)
    |       ) КАК ХозрасчетныйОстаткиИОбороты
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ХозрасчетныйОстаткиИОбороты.Подразделение,
	|		ХозрасчетныйОстаткиИОбороты.Счет,
	|		ХозрасчетныйОстаткиИОбороты.Организация,
	|		ХозрасчетныйОстаткиИОбороты.Регистратор) КАК Подзапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтражениеДокументовВРеглУчете КАК ОтражениеДокументовВРеглУчете
	|		ПО Подзапрос.Организация = ОтражениеДокументовВРеглУчете.Организация
	|			И Подзапрос.Регистратор = ОтражениеДокументовВРеглУчете.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	Подзапрос.Организация,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетБУ,
	|	Подзапрос.Регистратор,
	|	ОтражениеДокументовВРеглУчете.Статус";
	
КонецФункции

#КонецОбласти 

#Область ДоработкаТабличногоДокумента

Функция ДокументыВРегламентированномУчетеОтражены(Дата)

	СтруктураВозврата = Новый Структура("ДанныеАктуальны, ЧислоДокументов, ГраницаОтражения", Истина);
	
	Запрос = Новый Запрос;
	
	Если Метаданные.ОбщиеМодули.Найти("ЗакрытиеМесяцаУТВызовСервера") <> Неопределено Тогда
		ЗакрытиеМесяцаУТ = ОбщегоНазначения.ОбщийМодуль("ЗакрытиеМесяцаУТВызовСервера");
	Иначе
		ЗакрытиеМесяцаУТ = ОбщегоНазначения.ОбщийМодуль("ЗакрытиеМесяцаУТ");
	КонецЕсли;
	Запрос.Текст = ЗакрытиеМесяцаУТ.ТекстЗапросаСостояниеОтраженияДокументов(Ложь);
	
	ДатаОкончания = ?(ЗначениеЗаполнено(Дата), Дата, Дата(3999, 1, 1));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("МассивОрганизаций", ЭтотОбъект.МассивОрганизаций);
	Запрос.УстановитьПараметр("ПоВсемОрганизациям", Ложь);
	Запрос.УстановитьПараметр("РазделУчета", ЭтотОбъект.РазделУчета);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ВыборкаКОтражениюВУчете = МассивРезультатов[1].Выбрать();
	ВыборкаНеОтраженоВУчете = МассивРезультатов[2].Выбрать();
	
	ЕстьДокументыНеОтраженныеВУчете = ВыборкаНеОтраженоВУчете.Следующий();
	ЕстьДокументыКОтражению = ВыборкаКОтражениюВУчете.Следующий();
	
	Если ЕстьДокументыКОтражению и ВыборкаКОтражениюВУчете.ДатаНачала <= ДатаОкончания Тогда 
		
		СтруктураВозврата.ДанныеАктуальны = Ложь;
		СтруктураВозврата.ЧислоДокументов = ВыборкаКОтражениюВУчете.Количество;
		СтруктураВозврата.ГраницаОтражения = ВыборкаКОтражениюВУчете.ДатаНачала;
		
	ИначеЕсли ЕстьДокументыНеОтраженныеВУчете и ВыборкаНеОтраженоВУчете.ДатаНачала <= ДатаОкончания Тогда
		
		СтруктураВозврата.ДанныеАктуальны = Ложь;
		СтруктураВозврата.ЧислоДокументов = ВыборкаНеОтраженоВУчете.Количество;
		СтруктураВозврата.ГраницаОтражения = ВыборкаНеОтраженоВУчете.ДатаНачала;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ДоступныеОрганизации(Организация = Неопределено)
	УстановитьПривилегированныйРежим(Истина);
	СписокОрганизаций = Новый СписокЗначений;
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеСправочника.Ссылка КАК Организация
		|ИЗ
		|	Справочник.Организации КАК ДанныеСправочника
		|ГДЕ
		|	(ДанныеСправочника.Ссылка = &Организация
		|			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
		|	И ДанныеСправочника.Ссылка <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)");
		Запрос.УстановитьПараметр("Организация", Организация);
		МассивОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");
		СписокОрганизаций.ЗагрузитьЗначения(МассивОрганизаций);
	Иначе
		СписокОрганизаций.Добавить(Организация);
	КонецЕсли;
	Возврат СписокОрганизаций;
КонецФункции

Процедура ПостОбработка(ТабДок, ДанныеРасшифровки, КлючВарианта)
	
	СостояниеОтраженияДокументов = ДокументыВРегламентированномУчетеОтражены(ЭтотОбъект.КонецПериода);
	Если Не СостояниеОтраженияДокументов.ДанныеАктуальны Тогда
		ТабДок.Область("R1C1").Текст = НСтр("ru='Не все документы отражены в регламентированном учете, поэтому данные отчета могут быть неактуальны';uk='Не всі документи відображені в регламентованому обліку, тому дані звіту можуть бути неактуальні'");;
		ТабДок.Область("R1C1").ЦветТекста = Метаданные.ЭлементыСтиля.ЦветТекстаПроблема.Значение;
	КонецЕсли;
	
	СписокЯчеек = Новый СписокЗначений;
	СписокЯчеек.Добавить("Начальный остаток");
	СписокЯчеек.Добавить("Приход");
	СписокЯчеек.Добавить("Расход");
	СписокЯчеек.Добавить("Конечный остаток");
	СписокЯчеек.Добавить("Показатели");
	
	ОбъединяемыеЯчейки = Новый СписокЗначений;
	ОбъединяемыеЯчейки.Добавить("Оперативный учет");
	ОбъединяемыеЯчейки.Добавить("Бухгалтерский учет");
	ОбъединяемыеЯчейки.Добавить("Отклонение (ОУ-БУ)");
	ОбъединяемыеЯчейки.Добавить("Начальный остаток");
	ОбъединяемыеЯчейки.Добавить("Начальное сальдо");
	ОбъединяемыеЯчейки.Добавить("Отклонение (начальный остаток)");
	ОбъединяемыеЯчейки.Добавить("Приход");
	ОбъединяемыеЯчейки.Добавить("Оборот Дт");
	ОбъединяемыеЯчейки.Добавить("Отклонение (приход)");
	ОбъединяемыеЯчейки.Добавить("Расход");
	ОбъединяемыеЯчейки.Добавить("Оборот Кт");
	ОбъединяемыеЯчейки.Добавить("Отклонение (расход)");
	ОбъединяемыеЯчейки.Добавить("Конечный остаток");
	ОбъединяемыеЯчейки.Добавить("Конечное сальдо");
	ОбъединяемыеЯчейки.Добавить("Отклонение (конечный остаток)");
	
	
	Для индСтр = 1 По ТабДок.ВысотаТаблицы Цикл
		МаксимальнаяВысотаШапки = 0;
		Для индКол = 1 По ТабДок.ШиринаТаблицы Цикл
			
			Если ТабДок.Область(индСтр, 1).Текст = "Итого" Тогда
				ТабДок.Область(индСтр, индКол).Расшифровка = Неопределено;
			КонецЕсли;

			Если ОбъединятьЯчейки(ТабДок, индСтр, индКол, СписокЯчеек, КлючВарианта) Тогда
				ТекстЗаголовка = ТабДок.Область(индСтр, индКол).Текст;
				Если КлючВарианта = "СверкаПоРегистраторам" Тогда
					ОбъединяемаяОбласть = ТабДок.Область(индСтр, индКол, Макс(индСтр, ТабДок.ФиксацияСверху), индКол);
				Иначе
					ВысотаШапки = 0;
					Для К = 1 По 5 Цикл
						СледующаяЯчейка = ТабДок.Область(индСтр+К, индКол, индСтр+К, индКол).Текст;
						Если ОбъединяемыеЯчейки.НайтиПоЗначению(СледующаяЯчейка) <> Неопределено Тогда
							ВысотаШапки = ВысотаШапки + 1;
						КонецЕсли;
					КонецЦикла;
					ОбъединяемаяОбласть = ТабДок.Область(индСтр - 1, индКол, индСтр + ВысотаШапки, индКол);
					МаксимальнаяВысотаШапки = Макс(МаксимальнаяВысотаШапки, ВысотаШапки);
				КонецЕсли;
				ОбъединяемаяОбласть.Объединить();
				ОбъединяемаяОбласть.Текст = ТекстЗаголовка;
				ОбъединяемаяОбласть.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
				
				Если СписокЯчеек.Количество() = 0 Тогда 
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		индСтр = индСтр + МаксимальнаяВысотаШапки;
	КонецЦикла;

КонецПроцедуры

Функция ОбъединятьЯчейки(ТабДок, индСтр, индКол, СписокЯчеек, КлючВарианта)

	Ячейка = ТабДок.Область(индСтр, индКол);
	ЯчейкаКОбъединению = СписокЯчеек.НайтиПоЗначению(Ячейка.Текст);
	Если ЯчейкаКОбъединению <> Неопределено Тогда
		Если КлючВарианта = "СверкаПоРегистраторам" Тогда
			СписокЯчеек.Удалить(ЯчейкаКОбъединению);
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли