
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
	
	СтатьяРасходовВзносов = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ПодбираемыеАналитики = Новый Массив;
	ПодбираемыеАналитики.Добавить(Тип("СправочникСсылка.ФизическиеЛица"));
	ПодбираемыеАналитики.Добавить(Тип("СправочникСсылка.Организации"));
	ПодбираемыеАналитики.Добавить(Тип("СправочникСсылка.СтруктураПредприятия"));
	ПодбираемыеАналитики.Добавить(Тип("ПеречислениеСсылка.ВидыОперацийПоЗарплате"));
	ПодбираемыеАналитики.Добавить(Тип("СправочникСсылка.ОбъектыЭксплуатации"));
	
	Если ПодбираемыеАналитики.Найти(ТипЗнч(АналитикаРасходов)) = Неопределено Тогда
		ПланыВидовХарактеристик.СтатьиРасходов.ПроверитьЗаполнениеАналитик(
			ЭтотОбъект, "СтатьяРасходов, АналитикаРасходов", МассивНепроверяемыхРеквизитов, Отказ);
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("АналитикаРасходов");
	КонецЕсли;
	
	Если РежимУчетаВзносов = 1 Тогда
		Если ПодбираемыеАналитики.Найти(ТипЗнч(АналитикаРасходовВзносов)) = Неопределено Тогда
			ПланыВидовХарактеристик.СтатьиРасходов.ПроверитьЗаполнениеАналитик(
			ЭтотОбъект, "СтатьяРасходовВзносов, АналитикаРасходовВзносов", МассивНепроверяемыхРеквизитов, Отказ);
		Иначе
			МассивНепроверяемыхРеквизитов.Добавить("АналитикаРасходовВзносов");
		КонецЕсли;
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяРасходовВзносов");
		МассивНепроверяемыхРеквизитов.Добавить("АналитикаРасходовВзносов");
	КонецЕсли;
	
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(
		ПроверяемыеРеквизиты,
		МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ЕстьПрочиеОперации = Справочники.СпособыОтраженияЗарплатыВБухУчете.ОтражениеПрочихОпераций(ЭтотОбъект);
	
	Если СтатьяРасходов = Неопределено Тогда
		СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
	КонецЕсли;
	ОписаниеТипов = Новый ОписаниеТипов(СтатьяРасходов.ТипЗначения);
	АналитикаРасходов = ОписаниеТипов.ПривестиЗначение(АналитикаРасходов);
	АналитикаАктивовПассивов = ОписаниеТипов.ПривестиЗначение(АналитикаАктивовПассивов);
	
	
	Если РежимУчетаВзносов = 0 Тогда
		СтатьяРасходовВзносов = СтатьяРасходов;
		АналитикаРасходовВзносов = АналитикаРасходов;
		АналитикаАктивовПассивовВзносов = АналитикаАктивовПассивов;
		СчетУчетаВзносов = СчетУчета;
		Субконто1Взносов = Субконто1;
		Субконто2Взносов = Субконто2;
		Субконто3Взносов = Субконто3;
	Иначе
		Если СтатьяРасходовВзносов = Неопределено Тогда
			СтатьяРасходовВзносов = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
		КонецЕсли;
		ОписаниеТипов = Новый ОписаниеТипов(СтатьяРасходовВзносов.ТипЗначения);
		АналитикаРасходовВзносов = ОписаниеТипов.ПривестиЗначение(АналитикаРасходов);
		АналитикаАктивовПассивовВзносов = ОписаниеТипов.ПривестиЗначение(АналитикаАктивовПассивов);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
