Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	// Основной раздел Зарплата
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержаний, "ПолныйСводНачисленийУдержанийИВыплат");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата, "Важный");
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержаний, "РасчетныйЛисток");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата, "Важный");
	// Формируем см. также раздела Зарплата
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержаний, "КраткийСводНачисленийИУдержаний");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата, "СмТакже");
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.Договорники, "Договоры");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата, "СмТакже");
	
	// Формирование подраздела АнализЗарплаты
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержаний, "АнализЗарплатыПоПодразделениямИСотрудникам");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата.Подсистемы.АнализЗарплаты);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализПлановыхНачислений, "АнализФОТПоНачислениям");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата.Подсистемы.АнализЗарплаты);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализПлановыхНачислений, "АнализФОТПоСотрудникам");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата.Подсистемы.АнализЗарплаты);
	
	// Отражение зарплаты в финансовом учете
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОтражениеЗарплатыВФинансовомУчете);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата.Подсистемы.ВыплатыПеречисления);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержаний, "РасчетнаяВедомость");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата.Подсистемы.ВыплатыПеречисления, "Важный");
	
	// Формирование подраздела Удержания
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержаний, "УдержанияИзЗарплаты");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата.Подсистемы.Удержания);
	
	// Формируем см. также раздела Кадры
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.Договорники, "Договорники");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Кадры, "СмТакже");
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВоинскийУчетОбщий, "СписокГражданПодлежащихПостановкеНаВоинскийУчет");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Кадры, "СмТакже");
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВоинскийУчетОбщий, "СписокЮношей15_16Лет");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Кадры, "СмТакже");
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВоинскийУчетОбщий, "СписокПервоначальнойПостановкиНаВоинскийУчет");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Кадры, "СмТакже");
	
	// Отчет Среднесписочная численность выводим только в разделе Кадры (по умолчанию попадает в оба раздела)
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СтатистикаПерсонала, "СреднесписочнаяЧисленность");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Кадры);
	
КонецПроцедуры
