////////////////////////////////////////////////////////////////////////////////
// Общие процедуры и функции работы с выгрузкой и загрузкой из Excel
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Создание присоединенного файла с Excel
// Подробности см. РаботаСExcel.СоздатьПрисоединенныйФайлExcel
Функция СоздатьПрисоединенныйФайлExcel(ДокументСсылка, ИдентификаторФормы, ИмяПроцедуры) Экспорт 

	Возврат РаботаСExcel.СоздатьПрисоединенныйФайлExcel(ДокументСсылка, ИдентификаторФормы, ИмяПроцедуры);

КонецФункции 

#КонецОбласти