Процедура ОтразитьКонтролируемыеОперации(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаКонтролируемыеОперации;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.КонтролируемыеОперации.Записывать = Истина;
	Движения.КонтролируемыеОперации.Загрузить(Таблица);

КонецПроцедуры

Процедура ОтразитьОбщиеСведенияОКонтролируемыхОперациях(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОбщиеСведенияОКонтролируемыхОперациях;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.ОбщиеСведенияОКонтролируемыхОперациях.Записывать = Истина;
	Движения.ОбщиеСведенияОКонтролируемыхОперациях.Загрузить(Таблица);

КонецПроцедуры

