
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ДатаСобытия", ДатаСобытия);
	Параметры.Свойство("Организация", Организация);
	
	ОписаниеТипаФизическоеЛицо = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
	СтруктураПараметраФизическоеЛицо = Новый Структура("ТипПараметра, ИмяПараметра", ОписаниеТипаФизическоеЛицо, "МассивДокументов");
	СтруктураПараметровОтбора = Новый Структура(НСтр("ru='Сотрудник';uk='Співробітник'"), СтруктураПараметраФизическоеЛицо);
	ЗарплатаКадры.ПриСозданииНаСервереФормыСДинамическимСписком(ЭтотОбъект, "Список", "СписокНастройкиОтбора",
		СтруктураПараметровОтбора, "СписокКритерииОтбора");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписок

&НаКлиенте
Процедура Подключаемый_ПараметрКритерияОтбораПриИзменении(Элемент)
	ПараметрКритерияОтбораНаФормеСДинамическимСпискомПриИзмененииНаСервере(Элемент.Имя);
КонецПроцедуры

&НаСервере
Процедура ПараметрКритерияОтбораНаФормеСДинамическимСпискомПриИзмененииНаСервере(ИмяЭлемента)
	ЗарплатаКадры.ПараметрКритерияОтбораНаФормеСДинамическимСпискомПриИзменении(ЭтотОбъект, ИмяЭлемента);
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Параметр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	
	ЗарплатаКадрыКлиент.ДинамическийСписокПередНачаломДобавления(ЭтотОбъект, ПараметрыОткрытия, Параметр, "Сотрудник", "");
	
	Если ЗначениеЗаполнено(ДатаСобытия) Тогда
		
		Если Параметр = Тип("ДокументСсылка.ИсполнительныйЛист") Тогда
			ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("ДатаДействия", ДатаСобытия);
		ИначеЕсли Параметр = Тип("ДокументСсылка.ПостоянноеУдержаниеВПользуТретьихЛиц") Тогда
			ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("ДатаНачала", ДатаСобытия);
		ИначеЕсли Параметр = Тип("ДокументСсылка.УдержаниеПрофсоюзныхВзносов") Тогда
			ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("ДатаНачала", ДатаСобытия);
		ИначеЕсли Параметр = Тип("ДокументСсылка.ИзменениеУсловийИсполнительногоЛиста") Тогда
			ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("ДатаИзменения", ДатаСобытия);
		ИначеЕсли Параметр = Тип("ДокументСсылка.УдержаниеВСчетРасчетовПоПрочимОперациям") Тогда
			ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("ДатаНачала", ДатаСобытия);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Организация) Тогда
			ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("Организация", Организация);
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ПараметрыОткрытия.ЗначенияЗаполнения);
	
	Отказ = Истина;
	ОткрытьФорму(ПараметрыОткрытия.ОписаниеФормы, ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, Истина);
КонецПроцедуры

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
